{"judul":"The Story of a Low-Rank Soldier Becoming a Monarch","slug":"the-story-of-a-low-rank-soldier-becoming-a-monarch","tipe":"Manhwa","released":"Mei 25, 2021","rating":"8.7","author":"Doip","artist":"","status":"Completed","genre":["Action"],"synopsis":"Ketika saya berumur 15, saya kehilangan tangan kanan saya di medan perang … Pada usia 24, saya menguasai keterampilan yang diperlukan yang tidak dapat saya bertahan hidup tanpanya – Saya selalu diberitahu kata-kata yang sama: «Berhenti saja. Aku akan menjadi abu-abu lebih cepat jika aku mencoba mengajarimu sōjutsu. » «Jika Anda ingin mempelajari sesuatu, maka Anda tidak akan memiliki hambatan apa pun kecuali produktivitas Anda dalam pincang.» “Hei,\r\n mari kita kumpulkan herbal saja. Kenapa kamu begitu terobsesi dengan ilmu pedang? » «Hiduplah seperti orang lain.» ―Dan pada usia 39, saya kehilangan tangan kiri saya dan jatuh dari tebing. Menelan Artefak Aku tidak memiliki pengetahuan tentang … [Kekuatan pencarian …] – Ketersediaan untuk pertumbuhan – Keinginan untuk pengetahuan – Keserakahan Abyssal – Kekuatan dan keuletan –\r\n Kegigihan tanpa bakat -Membalikkan naluri Setelah pertempuran, saya terlahir kembali sebagai rookie berusia 15 tahun. 《Poin pengalaman meningkat! 》 《Poin pengalaman meningkat! 》 《Poin pengalaman meningkat! 》 《Poin pengalaman meningkat! 》 《Poin pengalaman meningkat! 》 Dari tentara bayaran Chris yang usang hingga tentara muda Chris! –\r\n Ini adalah kisah tentang seorang pemuda yang terampil yang menemukan kejayaan di medan perang. – Ini adalah kisah tentang seorang pria tanpa bakat yang melampaui batas. – Ini adalah kisah tentang seorang pria biasa yang menjadi seorang ksatria. – Ini adalah kisah tentang raja yang tidak biasa yang melindungi rakyatnya. – Ini adalah kisah tentang seorang pria yang kembali untuk menyelamatkan benua.\r\n 《Poin pengalaman diperoleh!》","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/05/the-story-of-a-low-rank-soldier-becoming-a-monarch-364397-ggzO6pBi-220x300.webp"}