[{"judul":"1000 Ways – Sun Shangxiang","slug":"1000-ways-sun-shangxiang","tipe":"Manhua","released":"Maret 6, 2021","rating":"7.15","author":"Snow Animation","artist":"","status":"Ongoing","genre":["Action","Adventure","Isekai"],"synopsis":"Reinkarnasi, tiba-tiba bangun di tubuh tuan muda, pas bangun hilang ingatan, pokoknya ke gitu lah…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/100-ways-sun-shangxiang-565414-uTIBZ85S-212x300.jpeg"},{"judul":"20.000 Years of Physical Cultivation","slug":"20-000-years-of-physical-cultivation","tipe":"Manhua","released":"Agustus 19, 2024","rating":"6","author":"爱豆喵漫画","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Martial Arts","Shounen"],"synopsis":"Original Manhua","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/08/20000-years-of-physical-cultivation-233700-jaTQuDrM-201x300.jpg"},{"judul":"48 Hours a Day","slug":"48-hours-a-day","tipe":"Manhua","released":"Juli 6, 2022","rating":"7.00","author":"Little Bleary Zhao","artist":"","status":"Ongoing","genre":["Action","Fantasy","Horror","Shounen","Supernatural"],"synopsis":"Dewa Waktu – Khronos – memberi Zhang Heng hadiah yang luar biasa. Waktu membeku di penghujung hari untuk semua orang kecuali Zhang Heng, yang mendapatkan tambahan 24 jam. Sebagai gantinya, Zhang Heng harus bertindak sebagai agen untuk Dewa Waktu dan berpartisipasi dalam permainan berbahaya setiap bulan: Deserted Island Survival [Tujuan Misi: Bertahan selama 40 hari], Tokyo Drift [Tujuan Misi: Memenangkan balapan mobil jalanan yang dimodifikasi] , dan seterusnya… Saat Zhang Heng menumpuk kemenangan demi kemenangan, dia semakin dekat dengan kebenaran dunia.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/07/48-hours-a-day-025249-eugQA6zC-225x300.webp"},{"judul":"1/2 Prince","slug":"1-2-prince","tipe":"Manhua","released":"Maret 4, 2021","rating":"8.4","author":"Yu Wo","artist":"","status":"Ongoing","genre":["Action","Adventure","Comedy","Fantasy","Gender Bender","Romance","Sci-fi","Shoujo","Shounen"],"synopsis":"Ini adalah tahun 2100 A.D., dan manusia telah mengembangkan game virtual reality dengan tingkat realisme 99%.  Feng Lan, karena bertaruh dengan saudara kembarnya, bersumpah untuk berhasil dalam permainan tanpa menggunakan “keuntungan perempuan”.  Karena itu, dia menjadi wanita pertama dan satu-satunya yang bermain sebagai karakter pria dalam “Second Life.”  Saat keburukannya meningkat sebagai pejuang yang haus darah, dapatkah dia merahasiakan identitasnya dari kenalan kehidupan aslinya yang telah dia pukuli?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/102-865093-ZKC3i1rb-200x300.jpg"},{"judul":"A Brick to Break Into Other World","slug":"a-brick-to-break-into-other-world","tipe":"Manhua","released":"Maret 7, 2021","rating":"7.0","author":"Qi Ling Zhe","artist":"","status":"Ongoing","genre":["Action","Fantasy","Horror","Martial Arts","Romance","Supernatural"],"synopsis":"Tokoh utama laki-laki disilangkan ke dunia lain. Secara kebetulan, dia mendapatkan batu bata senjata ajaib terkuat, tetapi dia juga dicap sebagai penjahat pertama di dunia. Saat melarikan diri, dia berlatih, hanya untuk menemukan dirinya terlibat dalam pertempuran besar Konspirasi, dan terkait dengan kehidupan sebelumnya. Wakil baris: Karier Yuan Xu Shizun telah melakukan segala kemungkinan untuk membunuh kelompok protagonis.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/a-brick-to-break-into-other-world-415632-mSN5ZJle-226x300.jpg"},{"judul":"996 At The Start","slug":"996-at-the-start","tipe":"Manhua","released":"Maret 11, 2023","rating":"7.00","author":"噼咔噼","artist":"","status":"Ongoing","genre":["Comedy","Drama","Fantasy","Shounen"],"synopsis":"Sistem yang menyedihkan hewan anti sosial Li Xiaoming yang hampir memeluk paha seorang wanita kaya dan juga cantik, dan dia akan memulai kehidupan yang mesum, tapi ditangkap oleh sistem [007] dan dikirim ke dunia lain untuk melanjutkan sistem [996] ![007] Sistem: Ambil sistem [996] ini, dan kamu tidak akan lagi menjadi manusia mulai sekarang…\r\n Li Xiaoming: Siapa yang mau mendengar omong kosong ini?! Aku ingin pulang ke rumah!\r\n [007] Sistem: Hanya dengan melakukan perbuatan baik dan mengumpulkan poin, kamu dapat kembali.\r\n Sistem [996] memiliki banyak manfaat, yang merupakan keuntungan untukmu.\r\n Li Xiaoming: …","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/03/996-at-the-start-520052-O7r96GdW.jpg"},{"judul":"A Callous Chairman’s Summer","slug":"a-callous-chairman-s-summer","tipe":"Manhua","released":"Maret 7, 2021","rating":"8.7","author":"Ego (ài gē)","artist":"","status":"Ongoing","genre":["Josei","Romance"],"synopsis":"Tanpa sengaja menghancurkan gambar senilai beberapa ribu, anak baru Gu Yi Ru jatuh ke tangan ketua yang tidak berperasaan Qi Xing Chen –– mengancam keluarganya, memeras dengan masa depan yang menjanjikan, dan juga tidak dapat menolak pelukan itu…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/a-callous-chairmans-summer-924129-Ps7Bfwgh-212x300.jpg"},{"judul":"A Comic Artist’s Survival Guide","slug":"a-comic-artist-s-survival-guide","tipe":"Manhua","released":"Juni 4, 2022","rating":"7.50","author":"凯特动漫","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Shounen"],"synopsis":"Snow, seorang komikus gagal yang komiknya akan dihentikan, dan secara kebetulan bereinkarnasi kedalam komiknya sendiri. Dalam komiknya, Benua Pante berada di ambang kehancuran karena perkembangan pasukan Raja Iblis, yang mengakibatkan Snow dalam bahaya. Saat hidupnya hampir berakhir, Snow mendapat kesempatan untuk bertahan hidup, dengan syarat dia mengambil alih peran penulis dan menulis ulang seluruh alur cerita komik. Jika dia gagal “membuat” cerita yang lebih menarik, maka Snow dan dunia komiknya akan hancur…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/06/a-comic-artists-survival-guide-992588-00rb7n3x-225x300.webp"},{"judul":"1 Million Times Attack Speed","slug":"1-million-times-attack-speed","tipe":"Manhua","released":"November 11, 2024","rating":"7.00","author":"猫三月文化","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Martial Arts","Shounen"],"synopsis":"Setelah bereinkarnasi ke Benua Tianwu, Ye Yun mengaktifkan Multiverse Devouring System dan menerima hadiah jutaan kali kecepatan serangan dalam paket hadiah pemula. Sejak saat itu, dia menjadi pembangkit tenaga listrik yang tak terkalahkan! Seperti kata pepatah, dalam dunia seni bela diri, kecepatan adalah yang terpenting. Apakah Anda pikir saya hanya mengupil dan membersihkan telinga saya? Faktanya, saya baru saja mengeksekusi tiga puluh lima ribu orang dengan satu serangan pedang dan delapan puluh tujuh ribu orang dengan satu ayunan pedang, sambil juga melepaskan berbagai teknik tinju dan seni rahasia.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/11/thumbnail-64b9c3a158007-181855-dnSAoqYZ-228x300.png"},{"judul":"A God’s Ascension","slug":"a-god-s-ascension","tipe":"Manhua","released":"Maret 6, 2021","rating":"7.54","author":"ReadComic (阅动文化)","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Isekai"],"synopsis":"Aku dipindahkan ke tubuh seorang penjahat? Siapa yang menulis cerita seperti ini?! Dan aku bahkan mencuri gadis orang lain? Dan punya kakak perempuan yang kuat? Cerita ini terus menjadi semakin buruk! Dan bahkan ada ruang ilahi dan sepuluh ribu dunia? Aku pasti sedang bermimpi!\r\n Setelah memantapkan dirinya, Wu Ming menghadapi perkembangan baru ini dan melanjutkan perjalanannya…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/a-gods-ascension-953030-Uf65hVJE-200x300.png"},{"judul":"A Lonesome Fragrance Waiting To Be Appreciated","slug":"a-lonesome-fragrance-waiting-to-be-appreciated","tipe":"Manhua","released":"Maret 7, 2021","rating":"7.4","author":"FENG Nong","artist":"","status":"Ongoing","genre":["Drama","Historical","Romance","Shoujo"],"synopsis":"Dia memiliki kecerdasan yang tak tertandingi yang memberinya gelar ‘Perempuan Zhuge’ dan merupakan pelayan Istana Jingan? Bai PingTing. Dia memegang gelar ‘Duke’ Kerajaan Donglin, juga dikenal sebagai ‘God of War’ – Chu BeiJie. Mereka dipisahkan oleh kesetiaan mereka kepada kerajaan mereka, oleh karena itu membuat mereka bermusuhan … namun mereka tidak dapat melarikan diri dari cinta mereka satu sama lain. Ketika dunia akhirnya damai, apakah masih mungkin bagi mereka untuk bersama, dan kali ini, untuk seumur hidup?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/a-lonesome-fragrance-waiting-to-be-appreciated-186234-3KtdaD7L-228x300.jpg"},{"judul":"A Novel Way of Escaping Death","slug":"a-novel-way-of-escaping-death","tipe":"Manhua","released":"Juni 19, 2022","rating":"7.00","author":"七夕八幡 不可能的世界","artist":"","status":"Ongoing","genre":["Adventure","Drama","Ecchi","Fantasy","Harem","School Life","Shounen"],"synopsis":"Original dari “My Escape From the Harem of Death.” Ceritanya tentang kehidupan sehari-hari yang lucu dan aneh dari seorang protagonis novel bernama Qi Huantian, yang sebenarnya adalah seorang kutu buku yang dipindahkan dari kenyataan kita. Saat ia menggali lebih dalam, Qi menyadari bahwa misinya bukanlah sesuatu yang sederhana seperti hanya meningkatkan popularitas sebuah buku yang buruk. Dengan pembangunan dunia yang rumit, rahasia dendam penulis, dan identitas sebenarnya dari protagonis wanita dan hubungannya dengan kenyataan, satu langkah yang salah bisa membuat dia kehilangan segalanya. Bisakah seseorang benar-benar melarikan diri dari Harem kematiannya?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/06/a-novel-way-of-escaping-death-363089-IvIHwgOT-225x300.webp"},{"judul":"19 Days","slug":"19-days","tipe":"Manhua","released":"Maret 4, 2021","rating":"9.1","author":"Mosspaca Studio, Old Xian","artist":"","status":"Ongoing","genre":["Comedy","Drama","School Life","Shounen Ai","Slice of Life"],"synopsis":"Hubungan imut dan lucu antara 4 anak laki-laki SMA yang tumbuh dengan sangat lambat, membentuk band rock bernama One Day, & jatuh cinta satu sama lain, sambil mencoba menjauhkan mereka dari masalah dengan mafia Cina &  geng jalanan.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/13942-492587-1UgQm16x-183x300.jpeg"},{"judul":"A Strange World","slug":"a-strange-world","tipe":"Manhua","released":"Maret 6, 2021","rating":"7.00","author":"Chen Dong, Xiatian Dao Dong","artist":"","status":"Ongoing","genre":["Action","Adventure","Mystery"],"synopsis":"Dimasa lalu dan sekarang, ada banyak zat khusus dengan sifat aneh, yang dahulu disebut “benda ilahi” dan sekarang kita menyebutnya “harta karun eksotis”. Zhou Mu adalah seorang pencuri legendaris, tapi dia dengan sembarangan meremehkan musuhnya dan terjebak dalam JEBAKAN JIWA [benda suci] selama 2000 tahun.\r\n Dia bersumpah untuk membalas dendam dari semua orang yang telah menganiaya dia. Ini ceritanya! kisah balas dendamnya!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/a-strange-world-613211-6OhcTjM3-225x300.jpg"},{"judul":"A Demonic Heart","slug":"a-demonic-heart","tipe":"Manhua","released":"Maret 27, 2023","rating":"7.00","author":"笔头工作室 [Add, ]阅文漫画","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Martial Arts","Seinen","Supernatural"],"synopsis":"Li Yunxin adalah manusia, tetapi apa yang dia lakukan sebanding dengan iblis.Seorang psikiater di kehidupan sebelumnya, di kehidupan ini dia bereinkarnasi sebagai pelukis yang bisa memanipulasi mantra, tapi yang paling bisa dia manipulasi adalah hati manusia.\r\n Dia kejar oleh pendeta Tao, dan berteman dengan iblis.\r\n Apakah itu manusia atau monster, pada akhirnya mereka akan menjadi bidak catur Li Yunxin.\r\n Bahkan Yan jun hitam dan putih, yang mengambil jiwa manusia, harus bertanya kepadanya ketika dia melihatnya: Dari mana demon heart itu berasal?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/03/a-demonic-heart-148205-98Uyaynm.jpg"},{"judul":"A Legend of the Wind","slug":"a-legend-of-the-wind","tipe":"Manhua","released":"Maret 7, 2021","rating":"6","author":"Island Project","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Shounen"],"synopsis":"Perjalanan seorang pria muda yang biasa berdarah naik dari biasa ke luar biasa, dan dari palung ke puncak. Pada generasi ke-16 dari keluarga Shangguan Shangguan Xu, dia selalu berubah dan terlihat seperti hantu. Dia datang dan pergi tanpa jejak. Dia menemukan metode yang benar dalam mempraktikkan seni bela diri keluarga, dan mengubah hidupnya.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/a-legend-of-the-wind-649202-sLvjaKJv-225x300.jpg"},{"judul":"A Post-Apocalyptic Journey","slug":"a-post-apocalyptic-journey","tipe":"Manhua","released":"Maret 8, 2021","rating":"7.4","author":"Ai Ran","artist":"","status":"Ongoing","genre":["Action","Adventure","Martial Arts","Seinen"],"synopsis":"Berkisah tentang seorang pria penyeludup kejam dan haus akan darah. Banyak yang mengatkan dia adalah monster karena darah iblisnya. Ini adalah kisahnya menyelundupkan barang-barang di dunia yang sudah porak poranda yang kembali ke Hukum alam “Siapa kuat, maka dia yang akan bertahaan”","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/a-post-apocalyptic-journey-885333-yEJi1zJ3-215x300.jpg"},{"judul":"A Will Eternal","slug":"a-will-eternal","tipe":"Manhua","released":"Maret 9, 2021","rating":"7.00","author":"Er Gen","artist":"","status":"Ongoing","genre":["Action","Adventure","Comedy","Drama","Fantasy","Martial Arts","Romance"],"synopsis":"Seseorang akan menciptakan lautan. Seseorang akan memanggil ladang mulberry.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/a-will-eternal-629581-dsclRqKZ-203x300.jpg"},{"judul":"A True Martial World","slug":"a-true-martial-world","tipe":"Manhua","released":"Februari 5, 2022","rating":"7","author":"阅文漫画","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Martial Arts","Shounen"],"synopsis":"Di dunia Seni Bela Diri yang luas dan liar, peradaban seni bela diri masih dalam tahap awal, Yi Yun secara tidak sengaja melakukan perjalanan dengan spar ungu yang dapat dengan cepat menyerap “energi” kultivasi. Dengan kedatangannya, legenda dunia Seni Bela Diri resmi dimulai.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/02/a-true-martial-world-393776-p8ByXHW8.jpg"},{"judul":"Ability Stealing Hunter","slug":"ability-stealing-hunter","tipe":"Manhua","released":"Juni 14, 2022","rating":"7.00","author":"夏_青 [Add, ]","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Shounen","Supernatural"],"synopsis":"Bertahun-tahun yang lalu, portal rahasia mulai muncul di bumi, dan manusia memiliki pekerjaan tambahan: pemburu. Meskipun batas atas level yang dapat dicapai setiap orang berbeda karena perbedaan bakat, dibandingkan dengan kebanyakan pekerjaan biasa di bumi, pendapatan pemburu secara objektif lebih banyak, terutama pendapatan pemburu tingkat tinggi lebih tinggi. Ini patut ditiru, sehingga semakin banyak orang mulai bergabung dengan tim pemburu. Dan protagonis pria adalah pemburu paling sial dalam sejarah!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/06/ability-stealing-hunter-235140-2E31UBdx.jpg"},{"judul":"Abnormal Hunting","slug":"abnormal-hunting","tipe":"Manhua","released":"Juli 2, 2025","rating":"7.00","author":"Apostle","artist":"","status":"Ongoing","genre":[],"synopsis":"Dua puluh tahun yang lalu, Kota Wuge dilanda bencana yang menyebabkannya mengalami berbagai kelainan yang tidak dapat dijelaskan. Seorang seniman yang memiliki kepribadian ganda dan seorang polisi secara aneh dipasangkan untuk memecahkan kasus-kasus aneh. Saat keduanya memecahkan kejadian-kejadian yang ganjil, mereka perlahan-lahan mengetahui kebenaran bencana dua puluh tahun yang lalu.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/07/abnormal-hunting-922522-pYHtornJ.jpg"},{"judul":"Above the Cloud Sea","slug":"above-the-cloud-sea","tipe":"Manhua","released":"Maret 6, 2021","rating":"7.5","author":"North Lane","artist":"","status":"Ongoing","genre":["Action","Adventure","Sci-fi"],"synopsis":"Apa yang protagonis kita, Neil, senang lakukan setiap hari adalah dengan keras “mengkhotbahkan” apa yang telah dilihat ayahnya di atas (Cloud Sea) Laut Awan. Tidak ada yang percaya bahwa itu benar, dan semua mengatakan bahwa ayahnya adalah pembohong yang menipu masyarakat untuk mendapatkan ketenaran.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/above-the-cloud-sea-287553-VK3oVvEe.jpg"},{"judul":"A Sword’s Evolution Begins From Killing","slug":"a-sword-s-evolution-begins-from-killing","tipe":"Manhua","released":"Juni 24, 2022","rating":"7.00","author":"噼咔噼","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Martial Arts","Shounen"],"synopsis":"Ye Fan terlahir kembali sebagai pedang aneh dengan sistem peningkatannya sendiri.Ye Fan terus ditingkatkan melalui pengalaman membunuh para ahli pedang dari dinasti masa lalu, dan telah menjadi pedang jahat yang diperebutkan oleh semua orang di dunia lain.Segera setelah pedang jahat lahir, itu pasti akan menyebabkan badai berdarah, dan Ye Fan juga bekerja keras untuk menyingkirkan tubuh pedang dan mengembalikan bentuk manusianya sesegera mungkin…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/06/a-swords-evolution-begins-from-killing-346680-Mhsi7eKK.jpg"},{"judul":"A Transmigrated Warden’s Battle for Redemption","slug":"a-transmigrated-warden-s-battle-for-redemption","tipe":"Manhua","released":"Juli 12, 2023","rating":"7.00","author":"绘世TONY","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Harem","Shounen"],"synopsis":"Penjara Mawar di Kota Baiyin dikenal sebagai penjara wanita yang paling ketat dan terkuat di seluruh benua. Penjara ini menampung para penjahat wanita paling berbahaya dan kejam di benua ini, dan Aku-Aiden adalah sipir yang bertanggung jawab untuk mengelola penjara ini. Tapi “Aiden” yang asli adalah orang kuat yang mahir menggunakan tombak, pedang, dan bahkan ilmu hitam! Aku hanyalah orang biasa yang berpindah ke tubuhnya, dan aku bahkan tidak tahu keterampilan bertarung yang disebutkan di atas…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/07/6da4w654e64e-745314-lEZdnwPD.jpg"},{"judul":"Above the Heavens","slug":"above-the-heavens","tipe":"Manhua","released":"Oktober 1, 2021","rating":"7","author":"二周目漫画","artist":"","status":"Ongoing","genre":["Action","Adventure","Drama","Fantasy","Martial Arts","Mystery","Shounen"],"synopsis":"Mahasiswa Zhou Mingyu telah menjadi sasaran berbagai kekuatan di dunia warlock karena memiliki kekuatan aneh yang disebut [Tengu]. Untuk menghilangkan pengaruh [Tengu] padanya dan untuk mengungkap kebenaran tentang kematian ayahnya, sebuah peristiwa misterius yang terjadi di Pegunungan Kunlun lebih dari seratus tahun yang lalu terungkap …","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/10/above-the-heavens-178899-ng9N8fsU-205x300.png"},{"judul":"Accidentally Joined The Demon Cult","slug":"accidentally-joined-the-demon-cult","tipe":"Manhua","released":"Desember 8, 2022","rating":"7.00","author":"Man Shen Wenhua","artist":"","status":"Ongoing","genre":["Action","Fantasy"],"synopsis":"Zhao He terkirim dan melakukan perjalanan ke dunia kultivasi, tanpa adanya keuntungan emas sama sekali! Dia hanya bisa melihat para Jenius membuat nama untuk dirinya dari jauh! tapi, aku sama sekali tidak berpikir bahwa tubuhku ini akan dirasuki oleh jiwa mati dari kultivator tertinggi, dan berubah menjadi dua jiwa dengan satu tubuh! Karena basis kultivasi milikku tidak cukup, Raja Iblis yang menempati tubuhku secara paksa mengolah dan menerobos dengan sangat cepat. Tidak adanya sumber daya yang cukup untuk kultivasi membuat Raja Iblis dengan paksa merebut berbagai harta karun. Tidak ada pendamping Tao membuat raja iblis mengambil alih Saintess dari kultus iblis atas dan digunakan sebagai tungku kultivasi.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/12/accidentally-joined-the-demon-cult-001882-0Go29zau-219x300.webp"},{"judul":"Accidentally Became a God","slug":"accidentally-became-a-god","tipe":"Manhua","released":"April 25, 2022","rating":"7.00","author":"女少阁","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Shounen"],"synopsis":"Zhang Buzheng, seorang pemuda Buddhis pengangguran yang dipilih oleh para dewa, ingin menyingkirkan kehidupan biasa dan menjadi dewa pembohong. Di luar dugaan, semua rekan satu timnya dalam perjalanan mendaki menara itu setengah hati. Agar tidak menyerah di tengah jalan untuk menjadi dewa, Zhang Buzheng terpaksa memulai jalan tersulit menuju Tuhan.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/04/accidentally-became-a-god-594332-XVy1UOCQ-207x300.jpg"},{"judul":"Ace God Doctor","slug":"ace-god-doctor","tipe":"Manhua","released":"Maret 9, 2021","rating":"7.0","author":"Benming Comic","artist":"","status":"Ongoing","genre":["Action","Slice of Life"],"synopsis":"Ye Lao, yang telah mencapai prestasi luar biasa, memiliki masalah jantung. Banyak dokter kunci di rumah sakit tidak berdaya, tetapi Ye Lao diselamatkan oleh seorang sopir ambulans Yang Feng. Mereka yang merendahkannya memarahinya dari latar belakang yang sederhana, dan menuduhnya bermain-main dengan ketenaran. Yang Feng muda tersenyum sepanjang jalan untuk melihat kecurigaan dan penghujatan, mempertahankan martabat cara medis, dan keterampilan medis serta kemampuannya sebagai seorang master secara bertahap muncul. Pada saat yang sama, para master dari semua lapisan masyarakat berkumpul di Zhonghai, Kota Zhonghai sedang melonjak, dia dengan dominan bersumpah bahwa yang saya inginkan adalah dunia cina!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/ace-god-doctor-254832-Omzh5SJP-225x300.jpeg"},{"judul":"Ace Master","slug":"ace-master","tipe":"Manhua","released":"April 26, 2021","rating":"6.9","author":"暂无","artist":"","status":"Ongoing","genre":["Action","Adventure","Harem"],"synopsis":"Dia adalah agen super dan raja dunia tentara bayaran. Untuk melindungi tunangannya, presiden cantik, Ye Xiao menjadi pengawal super, melakukan perlindungan pribadi selama 24 jam.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/ace-master-906789-MSKKD1kL-225x300.jpeg"},{"judul":"After Being Chased By Snails","slug":"after-being-chased-by-snails","tipe":"Manhua","released":"November 15, 2022","rating":"7.00","author":"BOOM工作室","artist":"","status":"Ongoing","genre":["Action","Adventure","Drama","Fantasy"],"synopsis":"Para dewa memberi tahuku bahwa dia bisa memberiku kekayaan tanpa akhir, tetapi sebagai gantinya aku akan diburu oleh siput. “Haha? Itu hanya siput, datang saja ke sini…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/11/after-being-chased-by-snails-441626-cZJE5RZZ-225x300.jpg"},{"judul":"After Confessing My Love to the Beautiful Sect Leader, I Become Invincible?","slug":"after-confessing-my-love-to-the-beautiful-sect-leader-i-become-invincible","tipe":"Manhua","released":"Mei 29, 2024","rating":"7.00","author":"猫仆工作室","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Martial Arts","Romance","Shounen"],"synopsis":"Di tengah tanda-tanda surgawi dan perubahan nasib, pada hari ini, Lin Fan lahir dan menjadi putra kaisar Tianmen. Dia juga diambil sebagai murid oleh leluhur pendiri Tianmen. Dalam insiden ledakan tungku yang tampaknya biasa namun luar biasa, sesuatu yang tak terduga terjadi… Ingatan Lin Fan terbangun! Dia! Transmigrasi? Sistem? Kebaikan? Peningkatan? Lin Fan tiba-tiba menyadari, dan dengan “bantuan” sistem, memilih target pertama untuk ditaklukkan — leluhur pendiri Tianmen.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/05/after-confessing-my-love-to-the-beautiful-sect-leader-i-become-invincible-928482-W7b8jHev-225x300.jpg"},{"judul":"After Demon","slug":"after-demon","tipe":"Manhua","released":"Maret 9, 2021","rating":"7","author":"Chu Mo Fangxue Hou","artist":"","status":"Ongoing","genre":["Action","Fantasy","School Life","Shounen","Supernatural"],"synopsis":"Di ibu kota negara, ada iblis perempuan! Kota ini adalah kampus universitas besar yang dibangun oleh semua negara di dunia. Di kota ini yang melambangkan perdamaian, ada banyak setan dan hantu yang mengancam murid dari seluruh dunia. Setiap malam kejadian aneh tumpang tindih dan menyebabkan kekacauan di seluruh kota. Seorang gadis misterius, Ji An, berjalan di antara cahaya dan bayangan. Dia memiliki semua jenis petualangan indah dengan setan dan manusia.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/after-demon-241231-OJ2qTB6D-212x300.jpg"},{"judul":"Advanced Evolution","slug":"advanced-evolution","tipe":"Manhua","released":"Juli 28, 2021","rating":"7","author":"Chaos, Lulai Buddha, Ningen (宁恩)","artist":"","status":"Ongoing","genre":["Action","Adventure","Martial Arts"],"synopsis":"Ming-hye adalah seorang pemuda dengan kemampuan supernatural yang misterius. Tapi miliknya adalah kekuatan yang paling tidak berguna, pangkat debu putih. Ming He sedang bersepeda di sepanjang jalan yang sepi dalam perjalanan pulang ketika bencana yang dijuluki “dewi” menyerangnya. Itu menjadi roh kepemilikan setelah bertemu Ming He. Ming He menerima kekuatan super yang kuat dan mencengangkan dari “Dewi”. Kekuatan super “sampah” dasarnya menerima dorongan yang tidak terduga, dan dengan itu datang.  Ming Hye naik ke posisi orang terkuat. Dia secara bertahap menemukan kebenaran tentang kekuatan alam semesta!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/07/advanced-evolution-666921-LCekYqDf-225x300.jpg"},{"judul":"After Rebirth, I Used Mirror Reversal For Vengeance","slug":"after-rebirth-i-used-mirror-reversal-for-vengeance","tipe":"Manhua","released":"Juli 19, 2025","rating":"7","author":"多拉格","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Shounen"],"synopsis":"Lima puluh tahun setelah dunia gim dan dunia nyata menyatu, seorang pejuang agung muncul. Ia mengabdikan seluruh hidupnya untuk dunia, hanya untuk akhirnya ditakuti dan dibunuh oleh penguasa tertinggi. Sebelum kematiannya, ia membangkitkan kemampuan mirror-reflecting, menyegel jiwanya sendiri di bawah permukaan danau.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/07/after-rebirth-i-used-mirror-reversal-for-vengeance-577421-kmsraBsY-225x300.jpg"},{"judul":"100.000 Layers of Body Refining: I Raise All Emperor","slug":"100-000-layers-of-body-refining-i-raise-all-emperor","tipe":"Manhua","released":"Maret 6, 2021","rating":"7.0","author":"Three Realms Animation","artist":"","status":"Ongoing","genre":["Action","Fantasy","Harem","Martial Arts","Romance"],"synopsis":"Lima ribu tahun yang lalu, ada banyak sekali orang muda yang tahu bagaimana berkultivasi, tetapi karena fisik mereka yang istimewa, mereka tidak dapat menembus masa latihan fisik dan memasuki alam kultivasi berikutnya. Dia telah berlatih dari era mitologi kuno hingga masyarakat modern, berdiri di kota yang ramai, Xuanyuan Ming di lantai sembilan puluh sembilan sembilan sembilan selama periode pelatihan fisik. Saya menetapkan tujuan kecil untuk diri saya sendiri: pertama berkultivasi hingga 100.000 tingkat periode pemurnian tubuh!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/0-602c438dcc29d-511143-1PLhQO0u-225x300.jpg"},{"judul":"Adventures of an Undead Who Became Paladin","slug":"adventures-of-an-undead-who-became-paladin","tipe":"Manhua","released":"Oktober 20, 2021","rating":"7","author":"我是隐身的","artist":"","status":"Ongoing","genre":["Action","Adventure","Comedy","Drama","Fantasy","Harem","Shounen"],"synopsis":"Kerendahan hati! Integritas! Kasih Sayang! Keberanian! Keadilan! Pengorbanan! Kehormatan! Iman!” Dia lich (Iblis), bagaimanapun, dia ksatria! Dia lich (Iblis), tapi dia tetap percaya pada cahaya! “Tak kenal takut di hadapan musuh! Setia dan jujur, dia bertarung sampai mati! Mengapa Anda bertanya? Karena melindungi yang lemah tidak bertentangan dengan hukum dunia!” ……………. Ini adalah kisah seekor kucing dengan mulut yang buruk dan seekor lich yang memberikan tubuh dan jiwanya untuk melayani Cahaya!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/10/adventures-of-an-undead-who-became-paladin-620001-BJj0vX8r-178x300.jpg"},{"judul":"After the High School Goddess Dumped Me I Became a Martial Arts God (After breaking up with the school beauty)","slug":"after-the-high-school-goddess-dumped-me-i-became-a-martial-arts-god-after-breaking-up-with-the-school-beauty","tipe":"Manhua","released":"Juli 25, 2025","rating":"7","author":"","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Martial Arts"],"synopsis":"Fang Yi melakukan perjalanan lintas waktu, dan baru saja ditinggalkan oleh pacarnya yang cantik. Dia pikir itu akan menjadi cerita romantis perkotaan yang biasa, tapi sistem mengejutkannya dengan memperingatkan bahwa pemulihan energi spiritual akan dimulai dalam setahun, dan dunia akan mengalami perubahan drastis, menandakan akhir dari dunia. “Dengan sistem, aku tidak takut apa-apa.”","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/07/after-the-high-school-goddess-dumped-me-i-became-a-martial-arts-god-354748-t1a1RHLC-226x300.jpg"},{"judul":"After The Identity of The Boss Was Exposed","slug":"after-the-identity-of-the-boss-was-exposed","tipe":"Manhua","released":"Maret 9, 2021","rating":"7.00","author":"Dao Shang Project","artist":"","status":"Ongoing","genre":["Harem","Martial Arts"],"synopsis":"Raja legendaris terkuat dari Sky Group, karena kota tempat rahasia bersembunyi, menggelembung, dan berisik. Pada siang hari, dia adalah murid yang terpesona, dan di malam hari, dia berjalan di tepi kegelapan. Pada saat ini, penampilan seorang gadis muda benar-benar mengganggu kehidupannya yang tampaknya damai. Permukaannya dingin, lembut, dan penuh perhatian, dan bayangan gelap yang tersembunyi di balik layar mulai menunjukkan taringnya…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/after-the-identity-of-the-boss-was-exposed-340068-tXeyhKaG-212x300.jpg"},{"judul":"After The Friendship Full","slug":"after-the-friendship-full","tipe":"Manhua","released":"Mei 1, 2021","rating":"7","author":"Myriad Tribulation Fire, Hedgehog Cat Reading","artist":"","status":"Ongoing","genre":["Fantasy","Harem"],"synopsis":"Liu Yuan Reinkarnasi setelah mengisi kesukaan semua pemain di game online Xianxia “Shangyang”. Akibat Reinkarnasinya Keseimbangan Dunia, terbesar dan terburuk dalam sejarah Alam Shangyang Menjadi Kacau, dan Cerita “Sage of Love” akan dimulai!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/05/after-the-friendship-full-600341-TREztWRr-226x300.jpg"},{"judul":"After Thousands Of Years Of Beta Testing, The Game Finally Finished","slug":"after-thousands-of-years-of-beta-testing-the-game-finally-finished","tipe":"Manhua","released":"Oktober 29, 2022","rating":"7","author":"","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Game","Isekai"],"synopsis":"Ketika dia bangun, Chen Mo menemukan bahwa dia telah memasuki dunia game yang disebut “Quanxing”. Itu bukan pemain tetapi memiliki panel pemain, dan itu bukan NPC tetapi memiliki fungsi berinteraksi dengan pemain.\r\n Tanpa diduga, game ini masih merupakan versi beta tertutup, dan Chen Mo telah ada di sini selama ribuan tahun.\r\n Selama ribuan tahun, Chen Mo telah melalui 10 putaran pengujian internal tanpa menghapus file dan 266 pengujian internal menghapus file!\r\n Selama periode ini, Chen Mo menyaksikan kebangkitan NPC legendaris satu demi satu. Dia mencapai kemahiran penuh dalam semua pekerjaan, dan dia memilih BOSS pertempuran nasional tingkat 10.000. Dia menyerang semua NPC wanita dengan ratusan pose, dan bahkan menutupnya. mata Chen Mo dapat menemukan artefak!\r\n Saya tidak tahu kapan saya bosan.\r\n Siapa yang tahu bahwa pada hari ini, game itu dirilis untuk beta publik …","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/10/after-thousands-of-years-of-beta-testing-the-game-finally-finished-454443-3lcweBI0-225x300.webp"},{"judul":"After Ten Years of Chopping Wood, Immortals Begged To Become My Disciples","slug":"after-ten-years-of-chopping-wood-immortals-begged-to-become-my-disciples","tipe":"Manhua","released":"Oktober 5, 2022","rating":"6","author":"","artist":"","status":"Ongoing","genre":["Action","Comedy","Fantasy","Harem","Martial Arts","Mystery","Reincarnation"],"synopsis":"Belum ada","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/10/after-ten-years-of-chopping-wood-immortals-begged-to-become-my-disciples-990761-8tY8M126-225x300.jpg"},{"judul":"After the Novel Villains Heard My Inner Voice","slug":"after-the-novel-villains-heard-my-inner-voice","tipe":"Manhua","released":"Mei 18, 2025","rating":"7","author":"二三玖陆工作室","artist":"","status":"Ongoing","genre":["Fantasy","Romance","Shoujo","Supernatural"],"synopsis":"Namaku Zhu Yuzhi. Lima menit yang lalu, aku bertransmigrasi ke dalam novel. Berita baiknya? Aku putri seorang pangeran. Jika tidak ada bencana, hidup seharusnya berjalan lancar. Berita buruknya? Bencana melanda. Aku akan mati malam ini. Berita terburuknya? Ibu dan saudara-saudaraku adalah penjahat utama dalam cerita ini. Namun, saat Zhu Yuzhi berjuang melewati kekacauan ini, dia menemukan sesuatu yang mengejutkan—keluarga jahat itu menentang takdir?!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/05/after-the-novel-villains-heard-my-inner-voice-249361-kgEDw1wi-223x300.jpg"},{"judul":"After Improperly Licking a Dog, I Became a Billionaire","slug":"after-improperly-licking-a-dog-i-became-a-billionaire","tipe":"Manhua","released":"November 11, 2024","rating":"7.00","author":"DAZUI","artist":"","status":"Ongoing","genre":["Action","Drama","Shounen"],"synopsis":"Lin Xin awalnya adalah anjing penjilat biasa, setelah dibuang, dia memperoleh Sistem dan memperoleh miliaran pada awalnya! Yang menyakitkan adalah uang itu hanya bisa dibelanjakan untuk wanita! Tidak mungkin, untuk menghabiskan semua uangnya, Lin Xin memulai jalur serangan balik yang tidak biasa!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/12/after-improperly-licking-a-dog-i-became-a-billionaire-428235-Gwl5q5X0-jpg.webp"},{"judul":"After Transformation, Mine and Her Wild Fantasy","slug":"after-transformation-mine-and-her-wild-fantasy","tipe":"Manhua","released":"Maret 9, 2021","rating":"5.1","author":"Xue Yan Tian Zhao","artist":"","status":"Ongoing","genre":["Action","Adventure","Comedy","Fantasy","Gender Bender","Martial Arts"],"synopsis":"Ketika orang lain mengalami transformasi tubuh, sudah dipastikan laki-laki menjadi perempuan atau perempuan menjadi laki-laki.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/after-transformation-mine-and-her-wild-fantasy-036165-Oqoiqo4v-225x300.png"},{"judul":"Age of the Gods: The World Becomes an Online Game","slug":"age-of-the-gods-the-world-becomes-an-online-game","tipe":"Manhua","released":"Juni 28, 2022","rating":"7.00","author":"","artist":"","status":"Ongoing","genre":["Action","Adventure","Game","Harem"],"synopsis":"Dunia sedang menghadapi serangan binatang buas, dan seluruh umat manusia membangkitkan kekuatan luar biasa dengan percaya pada berkah para dewa. Protagonis, Ye Bei ditertawakan karena tidak menjadi seorang Awakener, tetapi tidak ada yang tahu bahwa seluruh dunia hanyalah game online untuknya, dan dia adalah satu-satunya pemain! Dia akan menggiling dan menjadi makhluk terkuat. Sekarang, Mari kita mulai dengan membunuh semut…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/06/age-of-the-gods-the-world-becomes-an-online-game-103121-rJMZyAMd-252x300.webp"},{"judul":"Agent Crazy Concubine: Peerless Comprehension","slug":"agent-crazy-concubine-peerless-comprehension","tipe":"Manhua","released":"April 24, 2021","rating":"6.5","author":"Author 九夏动漫","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Romance"],"synopsis":"Agen wanita pertama, Su Chengyue, melakukan perjalanan ke Benua Pemahaman Fantastis, terikat pada Ye Li, Bupati Pertapa Mensao, dan dilatih sebagai “agen selir gila” yang mendominasi daratan. Dengan semua sumber daya dunia di tangan, dia menghadapi pria cantik dari semua lapisan masyarakat yang telah membawa mereka ke pintunya. Sebelum dia sempat menikmatinya, dia melihat Ye Li, yang selalu berwajah Bingshan, dengan cemburu bertanya padanya pergi ke Jiuchi Roulin, memintanya untuk mengembalikannya?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/agent-crazy-concubine-peerless-comprehension-200432-qroYOM6F-225x300.jpeg"},{"judul":"Above All Gods","slug":"above-all-gods","tipe":"Manhua","released":"Maret 3, 2021","rating":"7.5","author":"AAG","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Shounen","Supernatural"],"synopsis":"Gu Tianlang, Raja Xiaoxiao, ibu kota dewa peri baru, dikepung oleh semua orang, cemburu pada surga, dikepung di Chiyan Ridge, diadili oleh surga, kehilangan fondasi sihir peri, tahta hidup dan mati, tetapi Sirius kuno menggunakan giok kuno Misterius, lahir kembali lima ratus tahun kemudian! Musuh di kehidupan terakhir, balas dendam dari kehidupan ini, rasa malu di kehidupan terakhir, salju kehidupan ini! Saya Gu Tianlang, dan saya berbicara untuk diri saya sendiri…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/above-all-gods-034633-U9ZaW7tP-225x300.jpg"},{"judul":"Against The Heaven Supreme (Heaven Guards)","slug":"against-the-heaven-supreme-heaven-guards","tipe":"Manhua","released":"Maret 13, 2021","rating":"7.0","author":"Chén xiāng","artist":"","status":"Ongoing","genre":["Action","Martial Arts","Reincarnation"],"synopsis":"Mereka yang menyakiti orang yang kucintai, bunuh! Siapapun yang merenggut wanitaku, bunuh! Berani berakting di depanku? Lebih banyak untuk dibunuh! Setelah jatuh kedalam reinkarnasi tanpa akhir, Tan Yun akhirnya teringat identitasnya – saat aku bangun, seluruh dunia akan gemetar di bawah kakiku!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/against-the-heaven-supreme-heaven-guards-340673-NBwRBa7g-225x300.jpg"},{"judul":"Age of Terror","slug":"age-of-terror","tipe":"Manhua","released":"September 23, 2021","rating":"7","author":"","artist":"","status":"Ongoing","genre":["Horror","Slice of Life","Super Power"],"synopsis":"Setelah seratus tahun yang aneh di mana hantu muncul, hanya sepersepuluh umat manusia yang tersisa dan jumlah hantu melebihi jumlah manusia yang tersisa! Untuk bertahan hidup, manusia harus memilih “hantu pendamping” sejak lahir, dan terus-menerus mengolah hantu pendamping mereka sendiri sehingga mereka dapat digunakan untuk melawan hantu lain. Dunia telah memasuki era coeksistensi yang aneh dengan hantu! Dengan bantuan sistem, hantu tak terkalahkan yang dikultivasikan Lin Feng menyebabkan seluruh dunia bergetar","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/09/age-of-terror-258145-LI2RQo2f-208x300.jpg"},{"judul":"Against the Gods","slug":"against-the-gods","tipe":"Manhua","released":"November 11, 2024","rating":"6.2","author":"Mars Gravity","artist":"","status":"Ongoing","genre":["Action","Adventure","Comedy","Drama","Fantasy","Harem","Martial Arts","Seinen"],"synopsis":"Ini adalah kisah seorang pemuda yang mempunya mutiara racun langit, mengkultivasi kekuatan untuk menentang surga dan bumi, seorang penguasa menghadapi dunia!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/against-the-gods-227210-4a2SRugb-225x300.jpg"},{"judul":"All Heavenly Days","slug":"all-heavenly-days","tipe":"Manhua","released":"Maret 16, 2021","rating":"5.8","author":"Shen Ju Dong","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Martial Arts"],"synopsis":"Antara Bumi dan Surga, ada tempat yang dikenal sebagai Dunia Luofu yang agung. Setelah 100.000 tahun kelahiran dan 100.000 tahun kematian, satu miliar makhluk hidup memenuhi dunia ini. Siklus hidup dan mati selama 200.000 tahun ini telah terus berubah, tanpa akhir, hingga saat ini, ketika seorang pemuda yang mati selama 10.000 tahun terbangun dalam diri Cang Jian Ge…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/all-heavenly-days-102766-cHLE6cfS-200x300.png"},{"judul":"All of My Female Apprentices Want to Kill Me","slug":"all-of-my-female-apprentices-want-to-kill-me","tipe":"Manhua","released":"Januari 28, 2023","rating":"7.00","author":"金古文化","artist":"","status":"Ongoing","genre":["Action","Drama","Ecchi","Fantasy","Harem","Martial Arts","Shounen"],"synopsis":"Dengan memiliki kenangan dari abad ke-21, Aku pindah ke dalam diri seorang tokoh besar, “Su Bei”, dan membawa sistem “Magang Hingga [10.000] Kali Umpan Balik” ku sendiri. Para murid tidak hanya seindah bunga, tetapi mereka juga diberkati dengan takdir yang revolusioner. Ini adalah orang terpilih yang bisa menjadi protagonis utama dalam novel apa pun. Tapi para murid ini benci tidak bisa mengupas kulit dan merobek tulangku. Apa yang dilakukan Su Bei di masa lalu terhadap para murid ini!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/01/all-of-my-female-apprentices-want-to-kill-me-338282-DIhQ1eAL-225x300.jpg"},{"judul":"All Attributes Martial Arts","slug":"all-attributes-martial-arts","tipe":"Manhua","released":"Januari 6, 2022","rating":"7","author":"仟绘动漫, 莫入江湖","artist":"","status":"Ongoing","genre":["Action","Adventure","Drama","Fantasy","Martial Arts","Shounen"],"synopsis":"Dalam kehidupan sebelumnya, Wang Teng telah menyinggung pejabat dan menyebabkan keluarganya sendiri hancur, bahkan jika dia tidak memiliki keinginan untuk melawan, dia didorong menuju kepunahan. Setelah kematiannya, Wang Teng membawa keengganannya untuk terlahir kembali ke dunia seni bela diri, dan memperoleh jari emas yang bisa mengambil atribut. Dalam kehidupan terakhir, saya terpana sepanjang hidup saya, tetapi dalam kehidupan ini, saya akan mengubah nasib saya melawan langit!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/01/all-attributes-martial-arts-974211-udVqdPzf.jpg"},{"judul":"All Purpose Apocalyptic Upgrade System","slug":"all-purpose-apocalyptic-upgrade-system","tipe":"Manhua","released":"April 30, 2023","rating":"6","author":"夏青","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Horror","Shounen"],"synopsis":"In a world overrun by zombies, survival is difficult, but I suddenly gained an all-purpose apocalyptic upgrade system.What is this?!By killing the zombie and completing tasks, you can earn upgrade points that can be used to upgrade anything. With this, I no longer fear material scarcity, I just have to keep upgrading. From fruit cores to trees that last for millennia, from wild fields to super farms, from broken guns to plasma explosive weapons, from peas to super zombie-killers, and from paper airplanes to F22s. With this system, a single person is equivalent to a whole city!Original Webcomic:","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/04/all-purpose-apocalyptic-upgrade-system-606015-ZeHmPVF1.jpg"},{"judul":"Almight Network","slug":"almight-network","tipe":"Manhua","released":"Maret 16, 2021","rating":"7","author":"Golden Orange","artist":"","status":"Ongoing","genre":["Comedy","Josei","Romance"],"synopsis":"Ketika Fang Lin membeli handphone baru, dia menemukan ada sebuah aplikasi ajaib yang bernama Vchat, setelah dia pulang ke desa, dia terkena berbagai macam masalah, akhirnya Fang Lin memutuskan untuk menggunakan aplikasi ajaib ini untuk menjalani kehidupan yang lebih baik","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/almight-network-593546-1gysw5VE-225x300.jpg"},{"judul":"Aisha","slug":"aisha","tipe":"Manhua","released":"Juni 21, 2022","rating":"9","author":"Fa Ji Te","artist":"","status":"Ongoing","genre":["Drama","Historical","Horror","Mature","Mystery","Psychological","Romance","Tragedy"],"synopsis":"Si kembar yang telah kehilangan ibu dan ayah mereka memiliki warisan yang sangat besar yang dicuri oleh ibu tiri mereka yang jahat. Ketiga putra ibu tiri mereka memiliki hubungan khusus dengan saudara perempuan non-biologis mereka. Dengan demikian, adegan cinta dan benci terjadi di rumah tua ini. Ini adalah dongeng tentang romansa dan balas dendam.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/06/aisha-214351-82mAngJH-225x300.jpg"},{"judul":"All Female Cultivators Want To Sleep With Me","slug":"all-female-cultivators-want-to-sleep-with-me","tipe":"Manhua","released":"Maret 16, 2021","rating":"5.3","author":"九木立日","artist":"","status":"Ongoing","genre":["Comedy","Fantasy","Harem","Shounen"],"synopsis":"Aku, Xia Yi, memiliki Tubuh Tao bawaan yang memungkinkan untuk memahami berbagai metode dan meningkatkan konstitusi gadis mana pun selama berkultivasi ganda dengan mereka. Tapi apa yang terjadi ketika kamu seseorang dengan Tubuh Tao bawaan dan belum menjadi pembangkit tenaga listrik? Secara alami, kamu akan diculik dan berfungsi sebagai tungku budidaya bagi penculikmu!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/all-female-cultivators-want-to-sleep-with-me-364622-MjBiEKyH-225x300.jpg"},{"judul":"Amateur Demigod","slug":"amateur-demigod","tipe":"Manhua","released":"Maret 16, 2021","rating":"7.00","author":"Ptsd创应碍","artist":"","status":"Ongoing","genre":["Action","Fantasy","Supernatural"],"synopsis":"Tiba-tiba, Xie Lingya menjadi pemilik properti sebuah kuil Tao kecil. Kuil Tao berbatasan dengan jalan komersial di sebelah kiri, alun-alun di sebelah kanan, dan pasar sayur di belakangnya. Sayangnya, dupa itu ditinggalkan dan orang miskin berdenting. Tujuan kami adalah membuka kuil Tao terbesar dan membakar dupa yang paling tebal! … Xie Lingya: Aku tidak memiliki izin untuk menangkap hantu, meramal nasib, menggambar simbol, dan menonton Feng Shui … Tapi aku tahu aku setengah abadi!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/amateur-demigod-non-professional-fairy-261943-2hqsww25-225x300.jpg"},{"judul":"Ambiguous Apartment","slug":"ambiguous-apartment","tipe":"Manhua","released":"Maret 16, 2021","rating":"7.6","author":"Ji Guang Comic","artist":"","status":"Ongoing","genre":["Comedy","Ecchi","Harem","Romance"],"synopsis":"Desainer Joe ditemukan secara tidak sengaja oleh atasannya bahwa dia biasanya menganggapnya sebagai fantasi seksualnya … Karena marah, dia mengurangi gaji Joe, menyebabkan serangkaian masalah ekonomi dan Joe harus mengambil strategi berbagi rumah dengan orang lain untuk memotong  biaya.  Tapi penyewa pertama adalah bosnya yang cantik …","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/ambiguous-apartment-454951-plmkMavA-212x300.jpg"},{"judul":"Ancestor","slug":"ancestor","tipe":"Manhua","released":"Maret 18, 2021","rating":"7.00","author":"Bi Ge Xiong","artist":"","status":"Ongoing","genre":["Action","Comedy","Fantasy"],"synopsis":"Bantuan leluhur yang tak terkalahkan yang datang, Yanvor dan teman-temannya yang luar biasa berkomitmen untuk menghidupkan kembali sekte.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/ancestor-024499-ePTKQKdz.jpg"},{"judul":"An Illicit Affair","slug":"an-illicit-affair","tipe":"Manhua","released":"September 12, 2022","rating":"8","author":"卡比丘, 长佩文学","artist":"","status":"Ongoing","genre":["Drama","Fantasy","Romance","Shounen Ai","Supernatural","Yaoi"],"synopsis":"Kisah seorang pejuang yang cantik, kuat dan kejam seperti gunung es, dan pewaris pangeran kecil yang imut, banci, dan banyak bicara. Wuxia Cina.Webcomic AsliBahasa Inggris Resmi Pahlawan gunung es yang kejam, putra mahkota yang cerewet dan rapuh. Wuxia.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/09/7735cacb36b9d9fb88248ab11f94fc47af0a976cpng300w-621093-w4j39D5T-225x300.webp"},{"judul":"Ancestor of The Gods","slug":"ancestor-of-the-gods","tipe":"Manhua","released":"Maret 18, 2021","rating":"7.00","author":"乐匠文化","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy"],"synopsis":"Su Mu dari Keluarga Su dari Dinasti Tang sangat berbakat dan sombong, tetapi karena suatu penyakit, kultivasinya hilang. Suatu hari, tembakan panah dari luar langit menghantamnya, yang tidak hanya membantunya mendapatkan kembali kekuatannya, tetapi juga menjadikan Su Mu seorang guru ilahi, dan putra kedelapan yang telah menggandakan dendamnya kembali","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/ancestor-of-the-gods-433705-VbGqyHRU-225x300.webp"},{"judul":"Ancestor is beautiful and elegant","slug":"ancestor-is-beautiful-and-elegant","tipe":"Manhua","released":"September 10, 2025","rating":"7.00","author":"å¸åé¸ä¸å, å¸åé¸å·¥ä½å®¤, éææ¼«ç»","artist":"","status":"Ongoing","genre":["Drama","Fantasy","Josei","Romance","Supernatural"],"synopsis":"Bai Chuwei menunggu selama lima ribu tahun sebelum memasuki plot aslinya, memulai debutnya sebagai leluhur seluruh umat manusia. Kekayaan? Aset terbesar di dunia yang dimilikinya. Delapan keluarga bangsawan? Semuanya hanyalah pelayannya. Saat semua orang memuja leluhur mereka, Bai Chuwei, tuan muda keempat dari keluarga Duan di Haicheng, memeluknya. Apa-apaan ini! Bai Chuwei hanya mencoba menyerap energi spiritual dari pria ini, yang ia saksikan tumbuh dewasa. Ia tidak menyangka akan kehilangan hatinya.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/09/ancestor-is-beautiful-and-elegant-470437-SDphdeBe.jpg"},{"judul":"Ancestor, Please Come Out of the Mountain","slug":"ancestor-please-come-out-of-the-mountain","tipe":"Manhua","released":"April 6, 2022","rating":"7.00","author":"23! 23! 23333!","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Martial Arts","Shounen"],"synopsis":"Terlahir dengan darah abadi, ia menjalani kehidupan yang santai dan tanpa beban. Tetapi karena tujuan sekte, dia dijual dari gunung! Dengan hanya menggosok pil, itu menjadi peringkat ke-9! Dengan hanya mengulurkan tangannya, dia memiliki seni guntur kuno! Ketika dipercayakan dengan misi di saat yang kritis dan sulit, dia diminta untuk “berpura-pura menjadi ahli tanpa berbicara”. Dikelilingi oleh banyak wanita dan santo kultus, dia tidak menyadari tentang sekte dan niat membunuh keluarga kerajaan.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/04/ancestor-please-come-out-of-the-mountain-154669-mQ9mRXAg-225x300.jpg"},{"judul":"Ancient Godly Monarch","slug":"ancient-godly-monarch","tipe":"Manhua","released":"November 4, 2022","rating":"7.00","author":"Jing Wuhen (original) + Ge Ge youzhi","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy"],"synopsis":"Manhua Ancient Godly Monarch Sembilan galaksi, Jutaan bintang, semuanya adalah bentuk dari Representasi bintang seni bela diri, Para Seniman Beladiri dapat berkomunikasi dengan bintang, membangkitkan jiwa bintang, dan menjadi Kultivator seni bela diri. Legenda mengatakan bahwa Kultivator bela diri paling kuat di Sembilan Benua Surga, setiap kali dia menerobos tahapanya, dia akan dapat membuka pintu Stargate, hingga Alam Surgawi, memiliki bintang seni bela diri sendiri, menjelma menjadi Raja Dewa Kuno yang dapat menembus langit dan bumi. Qin Wentian muda bangkit dari ketidak berdayaannya dan bangkit melawan langit. Melihatlangit sambil tersenyum, dia ingin menjadi bintang paling terang di langit dan dunia!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/11/ancient-godly-monarch-310016-aAuYNKIc-226x300.png"},{"judul":"Aola Star – Parallel Universe","slug":"aola-star-parallel-universe","tipe":"Manhua","released":"Maret 21, 2021","rating":"3.3","author":"Baiman Masaike Studio","artist":"","status":"Ongoing","genre":["Action","Adventure","Sci-fi","Supernatural"],"synopsis":"Bai Xiaotian tanpa sengaja dipindah ke dunia game “Aola Star – Parallel Universe” . Di dunia yang tidak dikenal ini ia akan menghadapi banyak petualangan berdarah …","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/aola-star-parallel-universe-826856-p0OtCR7x-212x300.jpg"},{"judul":"Ancestral Visit","slug":"ancestral-visit","tipe":"Manhua","released":"November 9, 2021","rating":"7","author":"尹天下 春日文化 [Add, ]","artist":"","status":"Ongoing","genre":["Action","Fantasy","Martial Arts","Shounen"],"synopsis":"Gunung Wudang. Tempat Suci Untuk Mempelajari Taoisme, dibagi menjadi dua bagian, yaitu luar dan dalam. Xie Luo, seorang Taoist Modern Unik yang mempelajari buku surgawi sedari muda, menerim","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/11/ancestral-visit-935571-oyyS3Kuw-218x300.jpg"},{"judul":"Apocalypse Insect Master","slug":"apocalypse-insect-master","tipe":"Manhua","released":"November 1, 2024","rating":"7.00","author":"愚者","artist":"","status":"Ongoing","genre":["Action","Fantasy","Shounen"],"synopsis":"Apocalypse Insect Master: Saat kiamat tiba, semua hal bermutasi, dan manusia jatuh dari puncak rantai makanan, menjadi tidak lebih dari semut yang berjuang. Penjarahan dan pembantaian memenuhi setiap sudut. Ini adalah neraka bagi orang biasa, tetapi surga bagi yang berevolusi. Dimulai dengan Parasit Kaisar Serangga dan memperoleh kekuatan evolusi, saya akan menjadi penguasa gurun ini!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/11/apocalypse-insect-master-035044-tEe6PBd6.jpg"},{"judul":"Apocalypse Livestream – Start With Alpaca!","slug":"apocalypse-livestream-start-with-alpaca","tipe":"Manhua","released":"Juli 25, 2022","rating":"7.00","author":"乐游映画","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Shounen"],"synopsis":"Hao Shuang, live Streamer kelas tiga, Terpana saat melihat seorang gadis model ketika dia bekerja di Live Streaming dan menjual barang. Ketika dia bangun, dia menemukan bahwa dia sudah terikat oleh “sistem” dan dibawa ke dunia apokaliptik di mana zombie merajalela. Ada juga “alpaca” yang menyebut dirinya dewi sistem. Aku harus mengandalkan Live Streaming untuk menyelesaikan tugas sistem di dunia Apokaliptik yang dilanda krisis. Hanya dengan mencegah proses Kehancuran dunia Apokaliptik,aku bisa kembali ke bumi…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/07/apocalypse-livestream-start-with-alpaca-650583-3n9PG65D.jpg"},{"judul":"Apocalypse Mechanic","slug":"apocalypse-mechanic","tipe":"Manhua","released":"Mei 31, 2022","rating":"8.2","author":"沙丘","artist":"","status":"Ongoing","genre":["Action","Drama","Horror","Shounen"],"synopsis":"Kiamat semakin dekat, dan virus zombie telah menyebar dengan luas. Ye Bei dianiaya oleh pemimpin regu “Pelacur Teratai Putih”, lengannya digigit oleh zombie, dan dia hidup seperti kecoak selama lima puluh tahun dalam kiamat. Dengan usahanya sendiri untuk menjadi seorang mekanik, Ye Bei mengembangkan mesin waktu, kembali ke awal akhir 50 tahun yang lalu, dan menulis ulang kehidupan legendarisnya. Setelah melihat hati orang-orang yang jahat, dia bersumpah untuk menjadi lebih buruk, lebih egois, dan lebih jahat daripada orang lain. Hal pertama yang dia lakukan setelah berhasil menyeberang adalah mendorong perwakilan kelas wanita untuk memberi makan zombie!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/05/apocalypse-mechanic-193x278-837808-WRCQNJAl.jpg"},{"judul":"Almighty Master","slug":"almighty-master","tipe":"Manhua","released":"Maret 16, 2021","rating":"2","author":"Xin Yi Ren Comics","artist":"","status":"Ongoing","genre":["Action","Comedy","Martial Arts"],"synopsis":"Mari kita lihat pahlawan muda kita di sini, yang lahir dan memasuki dunia Seni Bela Diri. Tidak ada yang tidak bisa dia lakukan! Baik itu musik, catur, kedokteran, atau bahkan seni kuliner. Berpura-pura menjadi yang terlemah sementara dia yang terkuat. Wanita dari kiri ke kanan, lihat bagaimana anak yatim bangkit. Seorang yatim piatu yang akan menyelesaikan banyak kasus dan yang akan menjadi penguasa kota!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/almighty-master-350007-y5xqhRsC-225x300.jpg"},{"judul":"Apocalypse 100% Drop Rate","slug":"apocalypse-100-drop-rate","tipe":"Manhua","released":"Februari 28, 2023","rating":"7.00","author":"番茄漫画","artist":"","status":"Ongoing","genre":["Action","Adventure","Drama","Fantasy","Shounen"],"synopsis":"Lin Ziluo terlahir kembali dan kembali ke hari sebelum game kiamat akan turun. Dikhianati oleh pacarnya, mengikat “sistem cheat game kiamat”, ia mendapatkan tingkat drop item 100%. Ia pun menapaki jalan balas dendam! namun… kiamat ini sepertinya berbeda dari yang ia pikirkan…?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/02/apocalypse-100-drop-rate-992908-npE3oL0p-210x300.jpg"},{"judul":"Apocalypse: Cockroaches Gives Me Buff","slug":"apocalypse-cockroaches-gives-me-buff","tipe":"Manhua","released":"Maret 17, 2025","rating":"7","author":"叨卟狸","artist":"","status":"Ongoing","genre":["Action","Fantasy"],"synopsis":"Petualang superpower biasa, Zhou Yi, dikhianati oleh rekan-rekannya dan tewas di rahang monster saat membersihkan dungeon. Di saat-saat terakhirnya, ia menyesali nasibnya yang tak lebih baik dari kecoa. Tak disangka, Dewa Kecoa menganggap ucapannya serius dan mereinkarnasikannya menjadi seekor kecoa! Di dunia yang penuh dengan monster dan kekuatan super, Zhou Yi, yang kini hanya seekor kecoa kecil, harus berjuang untuk bertahan hidup melawan segala rintangan.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/03/jxxn5g-077678-Wxm6DWY0-225x300.jpg"},{"judul":"Apocalypse Super Farm","slug":"apocalypse-super-farm","tipe":"Manhua","released":"Juli 16, 2023","rating":"7.00","author":"诶嘿工作室","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Shounen","Supernatural"],"synopsis":"Kiamat melanda, dan semua tanaman serta sumber air habis. Dunia sedang panik, dan makanan serta kelangsungan hidup sekali lagi menjadi topik perhatian terbesar orang-orang. Beras dan mie telah menjadi barang mewah, dan sayuran bahkan lebih mahal! Namun, saat ini, seseorang mengirim video ke situs tersebut, yang mengejutkan dunia. Sayuran manis digulung ke dalam hot pot, memancarkan warna hijau yang menarik! Kaki domba emas panggang mendesis dan berminyak! Sup ikan yang lezat semurni dan seputih susu! Gadis kecil di samping phon: Kakak, aku benar-benar tidak bisa makan lagi!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/07/apocalypse-super-farm-698717-tU3S9fZC-244x300.jpeg"},{"judul":"Apocalypse Sword God","slug":"apocalypse-sword-god","tipe":"Manhua","released":"Maret 3, 2024","rating":"7.00","author":"七猫免费小说 & 我爱吃猫片啊 (Author), 春日文化 (Artist)","artist":"","status":"Ongoing","genre":["Action","Adventure","Drama","Fantasy","Martial Arts"],"synopsis":"Jika belas kasihan dan kebaikan tidak bisa menyelamatkan dunia, maka kali ini, aku memilih untuk membunuh— Eternal Slayer! Heavenly Lightning Slash! Sword of Annihilation! Selama Anda mempelajari keterampilan pedang yang paling umum, keterampilan itu dapat ditingkatkan ke peringkat SSS?! Divine Talent + Skill terlarang! Aku adalah percikan harapan terakhir dalam kiamat ini!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/03/apocalypse-sword-god-641286-3QWywcn7-227x300.jpg"},{"judul":"Apocalyptic Forecast","slug":"apocalyptic-forecast","tipe":"Manhua","released":"Oktober 20, 2021","rating":"7","author":"合火人工作室","artist":"","status":"Ongoing","genre":["Action","Adventure","Drama","Fantasy","Shounen","Supernatural"],"synopsis":"Hidup sepertinya tidak pernah berjalan sesuai keinginan Huai Shi. Tidak ada teman, tidak ada keluarga, tidak ada uang… Dia melamar pekerjaan sebagai musisi restoran, tapi ternyata iklan untuk gigolo! Ini bukan cara untuk karakter utama dengan cheat untuk hidup … Namun, ketika supernatural akhirnya mulai mengejar dia, dia mulai berharap itu tidak pernah terjadi.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/10/apocalyptic-forecast-102755-jcxFj5pk-212x300.jpg"},{"judul":"Apocalyptic Food stall","slug":"apocalyptic-food-stall","tipe":"Manhua","released":"April 19, 2025","rating":"7","author":"-","artist":"","status":"Ongoing","genre":["Action","Comedy","Fantasy"],"synopsis":"Gao Xiaoliang, seorang mahasiswa biasa, tidak pernah membayangkan hidupnya akan berubah begitu aneh. Setelah mengalami kecelakaan mobil yang aneh, ia terbangun dan mendapati dirinya terikat dengan sebuah “Sistem Makanan” misterius yang memberinya kekuatan kuliner unik. Ditransportasi ke dunia pasca-apokaliptik yang dipenuhi oleh zombie dan di ambang kehancuran, Gao Xiaoliang harus bertahan hidup di dunia baru yang berbahaya ini. Dapatkah Gao Xiaoliang bertahan hidup di dunia apokaliptik ini dengan warung makanannya dan mengungkap alasan mengapa ia dikirim ke sini?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/04/apocalyptic-food-stall-654859-zNGOn0EV-225x300.webp"},{"judul":"App Mode 2","slug":"app-mode-2","tipe":"Manhua","released":"September 24, 2021","rating":"6.00","author":"YOU.LING","artist":"","status":"Ongoing","genre":["Drama","Mystery","School Life","Sci-fi","Shounen","Supernatural"],"synopsis":"Setelah pembunuh berantai tanpa ampun menyerang saudara perempuannya, seorang anak laki-laki pemalu mengunduh aplikasi yang memberinya kekuatan super: Mode II. Melalui aplikasi, Shu Ye dapat mendengar pikiran dan perasaan batin yang tinggal jauh di dalam hati orang-orang. Tapi ada tangkapan dan, dengan kekuatan… datanglah mereka yang menyalahgunakannya.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/09/app-mode-2-883325-IXjT1Z1i-200x300.jpeg"},{"judul":"Am I Invincible","slug":"am-i-invincible","tipe":"Manhua","released":"November 7, 2021","rating":"7","author":"戏柳先生","artist":"","status":"Ongoing","genre":["Action","Comedy","Fantasy","Historical","Martial Arts","Shounen"],"synopsis":"[Invincible + Funny + Divine] Dia selalu mengira dia adalah manusia fana, tetapi dia tidak tahu bahwa halamannya penuh dengan senjata divine dan ayam yang dia pelihara lebih seperti burung phoenix! Tidak sampai setelah lima tahun tinggal di desa fana ketika sistem akhirnya memungkinkan dia untuk berhubungan dengan para pembudidaya. Saat itulah dia menemukan bahwa tidak peduli seberapa kuat seseorang, saat mereka melihatnya, mereka akan sangat takut sehingga kaki mereka mati rasa dan memanggilnya senior. Beberapa bahkan berlutut dan menyembahnya…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/11/1636279124-7019-i363758.jpg"},{"judul":"Apocalyptic Thief","slug":"apocalyptic-thief","tipe":"Manhua","released":"Juli 19, 2021","rating":"7","author":"Yushui","artist":"","status":"Ongoing","genre":["Action","Fantasy"],"synopsis":"Badai alam semesta membawa mutasi spesies. Racun, undead, raksasa, dan monster di kota , Saat binatang buas di hutan memperebutkan hak teritorial, manusia juga membangkitkan kemampuan yang dikenal sebagai kekuatan bintang … Zhou Zheng, tanpa kekuatan bintang, melintasi dunia apokaliptik ini. Menggunakan kemampuan karakter pencuri dalam permainan, dia menghancurkan kegelapan dan kabut, mencari kekuatan tertinggi!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/07/apocalyptic-thief-969443-ts2HFgsg.jpg"},{"judul":"Arch Villain","slug":"arch-villain","tipe":"Manhua","released":"Juli 13, 2022","rating":"7.00","author":"大行道动漫","artist":"","status":"Ongoing","genre":["Action","Drama","Harem","Shounen"],"synopsis":"Yin Wudao, seorang pria tampan yang sangat kaya. Karena pencuri Cao, dia disiksa dan dibunuh oleh menantu Raja Naga. Namun, dia secara tidak sengaja memicu Sistem Penjahat Agung tingkat dewa, dan hidupnya dimulai lagi.Karena Anda telah memilih untuk menjadi Penjahat, Anda harus menjadi penjahat terhebat dalam sejarah. Raja Naga, Tabib Ilahi, Dewa Perang, Shura, Master Bela Diri Kuno, Abadi… semua orang jenius yang dipilih oleh surga akan kukirimkan ke neraka!!!! dengan cara itu generasi Raja Penjahat akan segera keluar…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/07/arch-villain-539881-RITVhIhJ.webp"},{"judul":"Arknights: 123 Rhodes Island!?","slug":"arknights-123-rhodes-island","tipe":"Manhua","released":"Agustus 21, 2022","rating":"7.00","author":"Hypergryph","artist":"","status":"Ongoing","genre":["4-Koma","Comedy"],"synopsis":"Berkenalanlah dengan para operator bersama Amiya dan Dokter!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/08/arknights-040480-81UJSdgZ-203x300.webp"},{"judul":"As A Villain, It’s Not Too Much To Hang and Beat The Protagonist, Right","slug":"as-a-villain-it-s-not-too-much-to-hang-and-beat-the-protagonist-right","tipe":"Manhua","released":"Oktober 22, 2022","rating":"7.00","author":"","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Martial Arts","Reincarnation"],"synopsis":"Su Wuya melakukan perjalanan ke dunia fantasi dan menjadi Daozi dari keluarga Su dari keluarga kuno. Tak disangka, setelah dia bertransmigrasi, dia akan membawa sebuah riwayat bersamanya. Saya pikir narasi ini adalah Goldfinger, tapi saya tidak berharap itu akan mengeluh tentang diri saya sepanjang waktu. Ketika saya berlatih di alam bawah, saya secara tidak sengaja menemukan bahwa saya adalah seorang penjahat! Pada saat ini, rentetan narasi secara tidak sengaja membuka kunci fungsi prompt. Selama Anda menekan anak keberuntungan, Anda dapat menggunakan nilai penjahat yang dapat Anda gunakan untuk memeriksa petunjuk","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/10/as-a-villain-its-not-too-much-to-hang-and-beat-the-protagonist-right-489362-ZfwlqzpE-225x300.jpg"},{"judul":"As Soon as I Became a Quasi-Sage, I Was Summoned by the Empress","slug":"as-soon-as-i-became-a-quasi-sage-i-was-summoned-by-the-empress","tipe":"Manhua","released":"Juni 9, 2023","rating":"7.00","author":"为峰文化","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Harem","Historical","Martial Arts","Shounen"],"synopsis":"Di istana permaisuri, si pembunuh jatuh ke tanah. Lin Ke memimpin sekelompok penjaga cantik yang menjaga tempat tidur Permaisuri. Melihat permaisuri di tempat tidur, dia berkata dengan dominan: Mulai sekarang, saya akan menjadi orang di belakang permaisuri!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/06/as-soon-as-i-became-a-quasi-sage-i-was-summoned-by-the-empress-956220-QuSGAOaA-225x300.jpg"},{"judul":"Ascension Starts From Raising A Fairy","slug":"ascension-starts-from-raising-a-fairy","tipe":"Manhua","released":"Maret 30, 2021","rating":"7.0","author":"萌月文化, 来碗牛肉饭","artist":"","status":"Ongoing","genre":["Adventure","Comedy","Fantasy","Harem"],"synopsis":"Lu Wuyan telah memupuk keabadian selama ribuan tahun, dan tidak terkalahkan di seluruh dunia, tetapi mengapa orang yang lebih buruk dariku menjadi abadi, aku masih tidak bisa naik! Saya tidak yakin! Saya mencari peri untuk berdiskusi dan berdiskusi bagaimana menjadi peri dan menjadi bahagia!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/ascension-starts-from-raising-a-fairy-107844-wS8xbhpx-225x300.jpg"},{"judul":"Ascension to Godhood by Slaying Demons","slug":"ascension-to-godhood-by-slaying-demons","tipe":"Manhua","released":"Maret 30, 2021","rating":"7.0","author":"Man Duola","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Martial Arts","Mystery","Seinen"],"synopsis":"Setelah diculik ke dunia roh, seorang anak lelaki membangunkan kekuatan keilahiannya dengan mengakses nirwana. Bersama dengan saudara kembarnya yang lebih muda, mereka menjelajahi dunia misterius ini, mempelajari Taoisme, menjadi lebih kuat, membantu para dewa, berteman, memecahkan misteri, dan menjadi dewa pembunuh iblis nomor satu!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/ascension-to-godhood-by-slaying-demons-735776-Q3JI2F2L-209x300.jpg"},{"judul":"All Hail the Sect Leader","slug":"all-hail-the-sect-leader","tipe":"Manhua","released":"November 11, 2024","rating":"7.9","author":"阅文漫画","artist":"","status":"Ongoing","genre":["Action","Adventure","Comedy","Fantasy","Historical","Martial Arts","Shounen"],"synopsis":"Kepala sekte terakhir selalu tertawa, tetapi dia tidak pernah menyangka: Murid wanita dingin yang direkrut dengan santai menyembunyikan kengeriannya, dan murid pria yang menutup matanya di jalan untuk menyelamatkan sebenarnya adalah jenius pertama. Dia menendang bola ke kelahiran kembali Kaisar Wu menendang sekte itu untuk meragukan bahwa adik laki-laki yang melihat kesia-siaan dalam hidup adalah seorang jenius yang jatuh. Sekte ini semua mempesona … Tuhan ingin aku menentang langit, itu tidak bisa menghentikannya.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/01/all-hail-the-sect-leader-475939-NS5wxgvb.jpg"},{"judul":"Ascension: From Water Spirit to Deity","slug":"ascension-from-water-spirit-to-deity","tipe":"Manhua","released":"Januari 28, 2025","rating":"7.00","author":"-","artist":"","status":"Ongoing","genre":[],"synopsis":"Protagonisnya, Liang Qu, bertransmigrasi ke dunia bernama Da Shun. Ketika dia dijebak dan jatuh ke dalam krisis, dia secara ajaib membangunkan sistem yang disebut “Ze Ding”, dan segalanya berubah! Sang protagonis akan menyatu dengan garis keturunan binatang dewa kuno, mendapatkan kekuatan yang sangat besar, meningkatkan bakatnya, dan bahkan memperoleh keterampilan prajurit yang seperti dewa. Ayo pergi! Menyatu dengan garis keturunan Ze Ling! Sistem: “Membangkitkan garis keturunan Ze Ling—Monyet Air.” Protagonis: “???”","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/01/from-water-spirit-to-deity-467928-eoa8WLE2-210x300.jpg"},{"judul":"Asshole Hero","slug":"asshole-hero","tipe":"Manhua","released":"April 2, 2021","rating":"7.0","author":"赛客斯文化","artist":"","status":"Ongoing","genre":["Action","Adventure"],"synopsis":"Brengsek? Bagaimana bisa ada bajingan di dunia? Semua pahlawan! Erdan li hanya ingin menjadi bajingan, tapi dia selalu melakukan “perbuatan baik” karena kesalahan, dan berulang kali diberitakan sebagai pahlawan oleh media. Namun, tepat ketika dia hendak meninggalkan kegelapan dan bekerja keras, takdirnya tampak seperti lelucon …","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/asshole-hero-756753-bBAgVrnO.jpg"},{"judul":"Apprentices Are All Female Devil","slug":"apprentices-are-all-female-devil","tipe":"Manhua","released":"November 11, 2024","rating":"7","author":"-","artist":"","status":"Ongoing","genre":["Action","Ecchi"],"synopsis":"Semua murid yang bekerja sangat keras untuk berkultivasi pada saat itu sekarang telah menjadi abadi dan dewasa. Ye Bei, “Tiga ratus tahun … Tiga ratus tahun, saatnya melatih untuk guru … Tidak, aku mengajarimu!”","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/apprentices-are-all-female-devil-064018-v8bfjNBm-234x300.jpg"},{"judul":"Askr Yggdrasil’s Wood","slug":"askr-yggdrasil-s-wood","tipe":"Manhua","released":"April 2, 2021","rating":"6.4","author":"dna_s","artist":"","status":"Ongoing","genre":["Action","Adventure","Mystery","Sci-fi","Seinen"],"synopsis":"Diasingkan ke planet yang sunyi dan keras, Ayr menghabiskan hari-harinya berburu monster raksasa sebagai sumber makanannya. Kemudian, semuanya berubah ketika seorang polisi datang dan memberi tahu dia bahwa pengasingannya telah dicabut. Setelah tiba di Askr dia mengetahui bahwa banyak waktu telah berlalu ketika dia pergi. 100 tahun. Segalanya tampak berbeda sekarang, tetapi satu pertanyaan tetap: Untuk alasan apa pengasingannya dicabut setelah sekian lama?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/askr-yggdrasils-wood-738683-UHflgaCn-192x300.jpg"},{"judul":"Autophagy Regulation","slug":"autophagy-regulation","tipe":"Manhua","released":"April 2, 2021","rating":"6.8","author":"Chang Guo Peng, Ji Ye-Ya Ku Mo","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Shounen","Supernatural"],"synopsis":"Ryan adalah manusia biasa.  Selama kejadian yang tidak disengaja ia menerima kekuatan yang disebut “Berkah” Sejak itu, pandangannya tentang dunia telah berubah secara radikal.  Itu merupakan kejutan besar baginya.  Dia mengejar impian keadilan, menghadapi realitas dunianya dalam fantasi Shounen ini.  Di situlah manhua ini akan mengangkut Anda.  Dunia baru yang penuh bahaya, aksi, dan fantasi!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/autophagy-regulation-604501-lODdSJis-225x300.jpg"},{"judul":"Attribute Extractor","slug":"attribute-extractor","tipe":"Manhua","released":"September 12, 2021","rating":"7","author":"","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Martial Arts"],"synopsis":"Saya, Gu Shaoyang, memiliki kemampuan untuk mengekstrak atribut yang menyatu. Mengekstrak akar cerdas dari jenius yang tak terhitung jumlahnya, saya adalah penjahat paling mempesona, arogan yang tiada taranya. Menggabungkan batu primordial tingkat rendah yang tak terhitung jumlahnya dan elixir inferior, saya dapat membuat batu primordial terbaik dan elixir tingkat dewa. Sekarang saya hanya ingin bertanya: kapan saya akan menjadi tak terkalahkan? ! !","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/09/attribute-extractor-472976-ufNtOYv1.jpeg"},{"judul":"Back From The Dead To Build To The Strongest Guild Of All Time","slug":"back-from-the-dead-to-build-to-the-strongest-guild-of-all-time","tipe":"Manhua","released":"Oktober 1, 2023","rating":"7.00","author":"博易动漫","artist":"","status":"Ongoing","genre":["Action","Fantasy","Supernatural"],"synopsis":"Dalam kehidupan sebelumnya, Su Ye berdiri sebagai orang terakhir yang selamat di tengah pertempuran dahsyat di dunia, sebuah saksi pedih atas kejatuhan umat manusia. Namun, setelah kematiannya, dia terbangun dan mendapati dirinya terlahir kembali sepuluh tahun yang lalu. Menghadapi tantangan yang akan datang dan tak tertandingi, dia bertekad untuk memimpin semua orang menuju kemenangan!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/10/back-from-the-dead-to-build-to-the-strongest-guild-of-all-time-675938-2pdoqtAw-225x300.webp"},{"judul":"Bad Girl’s Diary","slug":"bad-girl-s-diary","tipe":"Manhua","released":"April 4, 2021","rating":"4","author":"Yu Yu Muchang Manhua Sheji Gongzuoshi","artist":"","status":"Ongoing","genre":["Comedy","Drama","Romance"],"synopsis":"Kenapa aku harus menjadi gadis kedua di cerita novel yang kubuat sendiri?!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/bad-girls-diary-860221-MPCjYnrB-225x300.jpg"},{"judul":"As The Richest Man, I Really Don’t Want To Be Reborn","slug":"as-the-richest-man-i-really-don-t-want-to-be-reborn","tipe":"Manhua","released":"Juni 27, 2023","rating":"7.00","author":"幼儿园园霸","artist":"","status":"Ongoing","genre":["Action","Fantasy","Martial Arts"],"synopsis":"Manusia mengenakan elemen kostum kuno, ksatria menggunakan sihir elemen, pembudidaya abadi terbang di awan dan pedang terbang, tim loli mengendarai mech seratus meter, mayat hidup di luar gerbang alien, alien, Saiyans … Ini tidak penting, yang penting apakah kamu ingin menjadi kaya? Sepuluh Ribu Alam! Yang terkuat di alam semesta! Hao Qiong, No. 1 di daftar peringkat Fu Undead! Membawa Anda keliling dunia! Ajari Anda cara menjadi kaya! Raih kebebasan finansial! Mendapatkan banyak uang! !","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/06/as-the-richest-man-i-really-dont-want-to-be-reborn-234929-SXh4dvQm-225x300.jpg"},{"judul":"Awakening SSS-Rank Skill After A Kiss","slug":"awakening-sss-rank-skill-after-a-kiss","tipe":"Manhua","released":"Mei 9, 2022","rating":"7.00","author":"博易动漫","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Harem","Martial Arts","Shounen"],"synopsis":"Lin Ran yang mengawali Hidupnya dengan berpindah di Dunia Lain dan terbangun di Tong Sampah, tapi siapa sangka dia membangkitkan Kemampuan Kelas-SSS hanya dengan berciuman dengan seorang Wanita? Hidupnya untuk mendaki Puncak Kehidupan mulai berjalan, apa dia akan Fokus pada Pendakian Kehidupan atau hanya akan Berjalan dalam masalah dengan Seorang Gadis jenius dengan hati yang baik, seorang ratu roh jahat dengan kepribadian genit, dan berbagai wanita lain?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/05/awakening-sss-rank-skill-after-a-kiss-033090-wZjjnJyp-291x300.webp"},{"judul":"Badminton Ghost","slug":"badminton-ghost","tipe":"Manhua","released":"Juni 20, 2024","rating":"7.00","author":"-","artist":"","status":"Ongoing","genre":["Drama","Shounen","Sports"],"synopsis":"Badminton, dah itu aja","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/06/image-2024-06-20-094319190-197051-W7QAGUYw-226x300.png"},{"judul":"Auto-Hunting With Clones","slug":"auto-hunting-with-clones","tipe":"Manhua","released":"September 5, 2022","rating":"7.00","author":"차씨","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Shounen"],"synopsis":"Suatu hari, ketika mahasiswa berusia 20 tahun Sang-Woo sedang bermalas-malasan, seperti biasa, dia akhirnya bergabung dengan program awakening, sebuah sistem yang memungkinkan bahkan warga sipil gunakan untuk belajar dan menggunakan skill.Didirikan beberapa tahun yang lalu, program awakening dimajukan oleh pemerintah, dan sekarang, mayoritas warga menerima sistem dan akhirnya menjadi seorang awakener.Sang-Woo, juga, memasuki program tanpa banyak berpikir, dan berkat itu, memperoleh skill kloning.Orang-orang di sekitarnya mengira skill kloning ini hanya membodohi mata dengan menciptakan ilusi, tetapi setelah Sang-Woo menyadari itu adalah keterampilan yang tidak menciptakan ilusi tetapi tubuh nyata, ia memutuskan untuk menjadi pemburu.Setelah itu, di depan Sang-Woo, yang mengendarai gelombang kesuksesan dengan skill ini, muncul Jumper George Lucas. Lucas, melihat keterampilan kloning Sang-Woo, merasakan kemungkinan tertentu, dan tertarik. Sang-Woo, yang juga merasakan bagian kecil dari rencana besar yang dibuat Lucas, tidak dapat menghilangkan kegelisahan yang dia rasakan. Pada akhirnya, Sang-Woo, yang melanjutkan aktivitas pemburunya, akhirnya mengetahui rencana Lucas dan juga rahasia gelap di baliknya…d","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/09/auto-hunting-with-clones-330950-EkGARHen-210x300.jpg"},{"judul":"Apotheosis","slug":"apotheosis","tipe":"Manhua","released":"Maret 3, 2021","rating":"6.8","author":"Gift Of Liberation","artist":"","status":"Completed","genre":["Action","Fantasy","Harem","Martial Arts","Shounen"],"synopsis":"Luo Zheng yang dulunya merupakan tuan muda dari keluarganya terpaksa menjadi budak karena penghianatan yang di lakukan dari keluarga cabang, tapi dia cuma memikirkan adiknya (hm flag siscon ini), dia berusaha menyelamatkan imouto-nya yang berada di pengawasan sekte lain.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/Apotheosis-225x300.jpg"}]