[{"judul":"Corpse Knight Gunther","slug":"corpse-knight-gunther","tipe":"Manhwa","released":"Oktober 10, 2022","rating":"7","author":"Mayoneoguli","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Manhwa","Psychological","Sci-fi","Shounen","Supernatural","Tragedy"],"synopsis":"Perang antara manusia dan vampir berakhir dengan kemenangan para vampir, seperti yang diharapkan semua orang. Setelah kerja keras untuk serangan balik umat manusia di Bahal, tanah suci yang belum diserang, Kami berhasil menghasilkan ‘ksatria mayat’ abadi dan ‘sumber kekuatan’ yang dapat menggerakkannya, ‘Gunter’, yang dulunya adalah seorang gladiator, dihidupkan kembali sebagai ‘ksatria mayat’.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/10/corpse-knight-gunther-710533-nDLIuefI.webp"},{"judul":"Black serpent","slug":"black-serpent","tipe":"Manhwa","released":"Desember 1, 2024","rating":"7.00","author":"An gyeong-al","artist":"","status":"Ongoing","genre":["Action","Drama","Historical","Martial Arts","Super Power","Supernatural","Tragedy"],"synopsis":"Dalam pertempuran terakhir melawan Kultus Iblis, pemimpin Ular Hitam Jeonghwa dikhianati oleh Aliansi Murim, dan kehilangan semua rekannya. Nyaris tak bisa bertahan hidup, ia bersumpah untuk melenyapkan Kultus Iblis dan Aliansi Murim yang telah menyebabkan rekan-rekannya tewas. “Ya Tuhan! Jika keadilan benar-benar ada… berikan aku kesempatan untuk membalaskan dendam atas rekan-rekanku yang gugur!” show the remaining","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/12/thumbnail-981979-Vl4mP9fz-207x300.jpeg"},{"judul":"Attention Seeker","slug":"attention-seeker","tipe":"Manhwa","released":"Juli 28, 2022","rating":"7.00","author":"Woong (웅)","artist":"","status":"Ongoing","genre":["Action","Drama","Martial Arts","School Life","Seinen"],"synopsis":"belum ada","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/07/attention-seeker-159310-Nv1KYgg7.jpg"},{"judul":"Admission is a Waste of Time","slug":"admission-is-a-waste-of-time","tipe":"Manhwa","released":"Oktober 25, 2024","rating":"7.00","author":"Toika, Doen","artist":"","status":"Ongoing","genre":["Action","Fantasy","Sci-fi"],"synopsis":"Bagaimana jika perjalanan harian Anda adalah ke universitas yang dibangun seperti Menara Babel? Ban Yuwon memiliki kemampuan yang luar biasa. Ia tidak hanya dapat menguraikan bahasa yang belum pernah dilihatnya sebelumnya, tetapi ia juga dapat memahami dan memperoleh ‘konsep’ dari benda-benda di sekitarnya. Sejak kecil, kemampuan unik Yuwon telah menarik perhatian kakeknya, yang mengungkapkan rahasia keluarga: “Keluarga kami adalah keturunan dari mereka yang membangun Menara Babel, yang menyatukan orang-orang dengan kekuatan komunikasi. Sebagai pewaris kekuatan ini, Anda dapat merebut kembali menara yang hilang.” Awalnya menganggapnya sebagai cerita yang tidak masuk akal, Yuwon tiba-tiba dipanggil ke akademi misterius di dimensi lain saat menunggu penerimaan universitas. Yang mengejutkannya, ia mendapati dirinya menatap Menara Babel yang selama ini hanya ia dengar dalam cerita. Didorong oleh campuran keinginan materialistis untuk merebut kembali bangunan milik keluarganya yang hilang dan kerinduan yang tulus untuk memenuhi tugas leluhurnya, Yuwon mendaftar di akademi tersebut. Akhirnya, ia memulai pendakian yang sulit ke Menara Babel, ruang bawah tanah berbahaya yang dipenuhi monster dan kekuatan kosmik yang menjanjikan kemampuan ilahi bagi mereka yang dapat menaklukkannya.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/10/image-2024-10-25-130422738-381592-KCwf7MAj-210x300.png"},{"judul":"A Spy’s Survival In The Demonic Cult","slug":"a-spy-s-survival-in-the-demonic-cult","tipe":"Manhwa","released":"Maret 13, 2025","rating":"7.00","author":"DAE Eunho","artist":"","status":"Ongoing","genre":[],"synopsis":"Jang Yiseo, seorang mata-mata dari Aliansi Murim yang menyusup ke Kultus Iblis, itu adalah misi pertama dan terakhirnya. Untuk menjadi Tuan Muda Ketujuh yang terkenal, Ma-oh, sebagai Wakil Ketua Sekte! Meskipun memiliki bela diri yang luar biasa, potensi Yiseo terhalang oleh konstitusinya yang lemah. Sementara itu, Ma-Oh, kekuatan yang luar biasa namun tidak dapat diprediksi, berjalan di garis tipis antara kejeniusan dan kegilaan. Saat nasib mereka saling terkait, keduanya harus menghadapi pengkhianatan, perebutan kekuasaan, dan risiko yang selalu ada untuk terungkap. Bisakah Jang Yiseo membuat Ma-Oh naik ke peringkat kedua setelah Ketua Sekte, atau akankah bayangan melahap mereka terlebih dahulu?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/03/a-spys-survival-in-the-demonic-cult-969654-UXaqt5TY-200x300.webp"},{"judul":"Dangerous Dungeon Escape","slug":"dangerous-dungeon-escape","tipe":"Manhwa","released":"Februari 14, 2023","rating":"7.00","author":"Hot Six, Kim Jakka","artist":"","status":"Ongoing","genre":["Action","Adventure","Drama","Fantasy","Shounen","Supernatural"],"synopsis":"Go Insung tidak masuk surga maupun neraka setelah mendadak mati, tapi malah masuk ke dungeon. Suatu tempat antara akhirat dan dunia. Dan ini bukanlah dungeon biasa, melainkan dungeon yang memiliki sistem. Sambil dinonton oleh ribuan makhluk yang sudah mati di akhirat, Go Insung harus menyelesaikan dungeonnya dengan para penantang lain agar dapat melarikan diri.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/02/dangerous-dungeon-escape-613197-oZjQ4RjN-209x300.jpg"},{"judul":"Cruise","slug":"cruise","tipe":"Manhwa","released":"April 19, 2023","rating":"7.00","author":"Webnyu","artist":"","status":"Ongoing","genre":["Drama","Horror","Seinen","Supernatural"],"synopsis":"Pelayaran terbaik di Korea mengundang tim Yongjin Taekwondo, yang telah mengumpulkan sepuluh juta penayangan di YouTube dan semakin populer, dan naik untuk tampil. Tapi apa yang menanti mereka setelah penampilan mereka adalah ?! Masih ada seminggu sampai kapal pesiar mendarat. Di atas laut, di mana tidak ada tempat untuk pergi, kapal pesiar berubah menjadi penjara tempat orang-orang dikurung dalam sekejap, dan pertarungan untuk bertahan hidup dari kejaran zombie dimulai!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/04/cruise-773617-EB4G8BzI.jpg"},{"judul":"Artifact Reading Appraiser","slug":"artifact-reading-appraiser","tipe":"Manhwa","released":"Juli 11, 2023","rating":"7.00","author":"Yeongwan","artist":"","status":"Ongoing","genre":["Adventure","Drama","Fantasy"],"synopsis":"Hae Jin memiliki seorang ayah yang mengabdikan seluruh hidupnya untuk menemukan artefak nasional yang diselundupkan ke luar negeri. Kemudian suatu hari, setelah menerima “artefak” tak dikenal yang dikirim oleh ayahnya, yang telah lama hilang kontak dengannya, cahaya aneh tiba-tiba datang darinya, memberi Hae Jin “kekuatan” misterius dan “misi” … “The Magic of the Heavenly object telah diberikan kepadamu.” Dengan demikian, petualangan yang melibatkan artefak yang tersebar di seluruh dunia, termasuk “The heavenly object”, yang berisi jiwa orang-orang Korea, dimulai!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/07/artifact-reading-appraiser-272349-WcPVzD76.jpg"},{"judul":"A Guide to Proper Dating","slug":"a-guide-to-proper-dating","tipe":"Manhwa","released":"Mei 15, 2021","rating":"8.3","author":"Namsoo","artist":"","status":"Ongoing","genre":["Comedy","Romance","School Life","Shoujo","Slice of Life"],"synopsis":"Agenda Bareum mungkin penuh, tetapi satu hal yang sangat dia butuhkan dalam buku hariannya adalah kencan. Saat dia dibujuk untuk bergabung dengan klub pemrograman oleh rekan kerjanya yang keren, sepertinya masih ada harapan untuknya. Tapi akankah kurangnya pengalaman menyebabkan kejatuhannya? Dan mengapa dia terus bertemu dengan temannya yang pemarah?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/05/a-guide-to-proper-dating-955389-IbH57grl-300x300.jpg"},{"judul":"Asterisk The Dragon Walking on the Milky Way","slug":"asterisk-the-dragon-walking-on-the-milky-way","tipe":"Manhwa","released":"Juli 20, 2022","rating":"7","author":"Yeonhak","artist":"","status":"Ongoing","genre":["Drama","Fantasy","Shounen"],"synopsis":"Seorang anak laki-laki yang merindukan dunia magis, Gazel bermimpi berhubungan dengan seekor naga. Namun, hanya orang dengan konstitusi khusus yang dapat melihat naga. suatu hari, saat menghabiskan berhari-hari merasakan kenyataan yang tidak bisa mendekati mimpi, Gazel bertemu dengan seekor naga yang telah jatuh dari langit….","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/07/asterisk-the-dragon-walking-on-the-milky-way-725963-DyGnz4DY-188x300.webp"},{"judul":"Bad Born Blood","slug":"bad-born-blood","tipe":"Manhwa","released":"Maret 15, 2025","rating":"7","author":"Pumpkin Bird","artist":"","status":"Ongoing","genre":["Action","Drama","Seinen"],"synopsis":"Rumah umat manusia bukan lagi Bumi. Perjalanan antar bintang sudah menjadi lumrah, dan teknologi telah menggantikan darah dan daging. Luka, yang tumbuh di daerah kumuh, telah berumur 15 tahun dan mengikuti ujian seleksi. Bakatnya adalah “Imperial Guard.”","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/03/image-2025-03-15-120152974-933963-AlyBL3A4-231x300.png"},{"judul":"Cursed Manager’s Regression","slug":"cursed-manager-s-regression","tipe":"Manhwa","released":"Agustus 19, 2022","rating":"8","author":"Studio Grigo","artist":"","status":"Ongoing","genre":["Action","Adventure","Comedy","Fantasy","Shounen"],"synopsis":"Sebagai manajer Grup Bongsan, Kim MuJin adalah orang normal yang merupakan bagian dari tim pendukung untuk para transenden, yang bertarung menggunakan kekuatan gaib.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/08/cursed-managers-regression-123309-pgofGuK2-210x300.png"},{"judul":"Blood Blade","slug":"blood-blade","tipe":"Manhwa","released":"April 12, 2021","rating":"7.5","author":"Yunyeol Choi","artist":"","status":"Ongoing","genre":["Action","Fantasy"],"synopsis":"Setelah terperangkap dalam ledakan yang disebabkan oleh tabrakan meteor, Red bangun dan menyadari bahwa semuanya telah berubah.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/blood-blade-296245-cJ8rA0US-212x300.jpg"},{"judul":"Chasing Tails","slug":"chasing-tails","tipe":"Manhwa","released":"Mei 9, 2023","rating":"7.00","author":"Bashi","artist":"","status":"Ongoing","genre":["Drama","Horror","Mystery","Psychological"],"synopsis":"Setelah sembilan mahasiswa terjebak di bawah gedung yang runtuh selama 14 hari, hanya enam orang yang keluar hidup-hidup, dan hanya empat di antaranya yang dapat berbicara. Mayat rekan-rekan mahasiswa mereka dicincang dengan kejam, membuat polisi menyelidiki kasus ini sebagai pembunuhan. Letnan Detektif Jeongdo Kwon dan Yeongchae Shin, bersama dengan ahli neuropsikiatri terkenal Dr. Yeongwha Ju, harus mengurai kesaksian para saksi dan bukti fisik yang tidak meyakinkan untuk mengungkap kebenaran. Tapi bagaimana caranya memecahkan kasus pembunuhan di kamar terkunci ketika setiap saksi adalah tersangka? Siapa Pembunuhnya di antara mereka?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/05/chasing-tails-147394-lpClP0rM.jpg"},{"judul":"Dawn of the Predecessor: Prelude","slug":"dawn-of-the-predecessor-prelude","tipe":"Manhwa","released":"Juni 25, 2023","rating":"7.00","author":"Kim Yujeong","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Seinen"],"synopsis":"“Pada era di mana mitos dan realitas bertemu, dewa-dewa dan pahlawan dari mitologi kuno seperti Yunani, Romawi, Yahudi, Mesir, dan lainnya, dihidupkan kembali dalam dunia nyata abad ke-21. Protagonis utama, Yugeon, mengalami proses yang disebut ‘pemunculan’ di mana ia mendapatkan indera dan kekuatan baru. Dengan indera baru yang terbuka, Yugeon dapat melihat hal-hal yang tidak terlihat oleh orang lain dan menyadari bahwa dunia sedang berubah. Yugeon tumbuh dan berkembang melalui rasa ingin tahu tentang dunia, kesadaran akan ketidakadilan dalam realitas yang membingungkan, sensitivitas masa remaja, dan pengalaman cinta. Namun, ia terjebak dalam situasi di mana ia harus melawan ancaman yang datang dari dunia baru ini dan menghadapi krisis yang menghampiri keluarganya. Ini adalah kisah cinta dan petualangan yang dibentuk oleh pahlawan baru abad ke-21 dalam menghadapi tantangan dan bahaya.”","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/06/dawn-of-the-predeces-194655-OhEYvQTC-210x300.png"},{"judul":"Archmage Streamer","slug":"archmage-streamer","tipe":"Manhwa","released":"Januari 30, 2022","rating":"7.00","author":"D-Dart,디다트","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Shounen"],"synopsis":"Jung Hyunwoo hanyalah seorang gamer sial yang hampir tidak bisa memenuhi kebutuhan dalam game VR “God Wars”. Dia bahkan kehilangan akses ke akun gimnya karena kecelakaan yang mengerikan dan terpaksa membuat karakter baru. Dalam prosesnya, dia menemukan bahwa dia memiliki kemampuan yang memungkinkan dia untuk melihat informasi tersembunyi di dalam game, yang membuatnya menjadi Grand Warlock. Sekarang dilengkapi dengan keterampilan yang luar biasa dan kelas legendaris, yang tersisa hanyalah dia naik level dan beralih dari nol menjadi pahlawan …","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/01/archmage-streamer-900454-XoU6OvqV-222x300.jpg"},{"judul":"Broken Daily Life","slug":"broken-daily-life","tipe":"Manhwa","released":"Februari 9, 2022","rating":"7.00","author":"Seunghan","artist":"","status":"Ongoing","genre":["Drama","Mystery","Psychological","Shounen"],"synopsis":"“Tolong aku!” Aku telah diculik oleh orang ini!”\r\n Suara wanita aneh terdengar dari headphone dari mikrofon saudara laki-lakiku yang sedang kami mainkan.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/02/broken-daily-life-576264-J9eqYaXd-210x300.jpg"},{"judul":"Auto Hunting","slug":"auto-hunting","tipe":"Manhwa","released":"Maret 4, 2021","rating":"7.8","author":"Black Seed Entertainment","artist":"","status":"Ongoing","genre":["Action","Adventure","Sci-fi"],"synopsis":"Dunia diserang oleh monster yang mengalir dari ‘fraktur’. Dan ‘pemburu’ yang memburu monster-monster itu adalah pekerjaan yang paling didambakan di dunia saat ini. Suatu hari, Oh Yunsung yang bekerja paling keras dari hari ke hari sebagai pekerja di restoran daging membangkitkan kemampuan untuk secara otomatis berburu monster dengan teknik sempurna dan kehebatan fisik seperti di MMORPG ketika dia menekan tombol ‘Berburu Otomatis’ yang muncul di depan dia…!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/auto-hunting-814312-gFiROXNG-225x300.png"},{"judul":"Asirhart Kingdom Aide","slug":"asirhart-kingdom-aide","tipe":"Manhwa","released":"Mei 25, 2021","rating":"7","author":"이태산","artist":"","status":"Ongoing","genre":["Drama","Historical","Romance","Shoujo"],"synopsis":"“Apakah Anda ingin menjadi Putri Asirhart?”","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/05/asirhart-kingdom-aide-868413-qZp4L4KQ-202x300.png"},{"judul":"A Simple Thinking About Blood Type","slug":"a-simple-thinking-about-blood-type","tipe":"Manhwa","released":"Maret 8, 2021","rating":"8.3","author":"PARK Dongsun","artist":"","status":"Ongoing","genre":["Comedy","Slice of Life"],"synopsis":"Pernahkah Anda bertanya-tanya mengapa orang Korea bertanya tentang golongan darah Anda? Itu bukan karena mereka ingin tahu apa yang harus dilakukan jika Anda kebetulan dalam kecelakaan (meskipun itu benar-benar informasi penting), tetapi itu karena ada kepercayaan yang mendasari bahwa golongan darah mempengaruhi kepribadian dan karakter dalam cara tanda astrologi dapat terjadi. Webtoon lain yang sangat sukses, telah mengemas semua stereotip yang ada dari setiap golongan darah dan lebih banyak lagi menjadi seri lucu. Anehnya, ada banyak yang sangat benar sehingga agak aneh. Jauh lebih lucu ketika Anda tahu golongan darah Anda sendiri. Lebih lanjut … Pernahkah Anda bertanya-tanya mengapa orang Korea bertanya tentang golongan darah Anda? Itu bukan karena mereka ingin tahu apa yang harus dilakukan jika Anda kebetulan dalam kecelakaan (meskipun itu benar-benar informasi penting), tetapi itu karena ada kepercayaan yang mendasari bahwa golongan darah mempengaruhi kepribadian dan karakter dalam cara tanda astrologi dapat terjadi. Webtoon lain yang sangat sukses, telah mengemas semua stereotip yang ada dari setiap golongan darah dan lebih banyak lagi menjadi seri lucu. Anehnya, ada banyak yang sangat benar sehingga agak aneh. Jauh lebih lucu ketika Anda mengetahui golongan darah Anda sendiri.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/a-simple-thinking-about-blood-type-505494-JrTQHkjR-228x300.jpg"},{"judul":"Academy’s Genius Tamer","slug":"academy-s-genius-tamer","tipe":"Manhwa","released":"Agustus 21, 2024","rating":"7.00","author":"Itaesan Kang Seoul","artist":"","status":"Ongoing","genre":["Action","Adventure","Drama","Fantasy","School Life","Shounen"],"synopsis":"“Tunggu, jendela sistem…? Ada apa ini…” [Menyinkronkan cerita dari sudut pandang Han Siha] Aku telah menjadi Han Siha, seorang penjahat kecil dalam novel dark fantasy yang dulu aku sukai. ‘Kenapa harus Han Siha?! Dia tidak punya bakat sihir sama sekali dan terbunuh oleh para protagonis di awal cerita!’ Aku harus bertahan hidup, bagaimanapun caranya! Untuk menjalani kehidupan damai tanpa terjebak dalam urusan para protagonis, lulus dari akademi adalah keharusan. Tapi bagi Han Siha, yang tidak punya bakat sihir dan keterampilan sosial yang buruk, ini adalah tugas yang hampir mustahil… Menjinakkan… Mungkin ini berhubungan dengan pekerjaanku di kehidupan sebelumnya. Haruskah aku mencobanya? “Itu… reptil. Percayalah padaku.” [Kamu telah menjinakkan Naga Merah.] Berhasil…? Apakah aku sebenarnya seorang jenius penjinak? Baiklah, aku hanya perlu fokus pada kelulusan seperti ini! Tapi kemudian… “Han Siha, tim dengan aku.” “Han Siha! Mau bergabung denganku di kompetisi alkimia?” “Han Siha… Aku perlu memberitahumu sesuatu… Ini penting.” Para protagonis yang seharusnya membunuhku di cerita aslinya kini mulai tertarik padaku?! Apakah aku benar-benar bisa lulus dengan selamat?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/08/336we5-148508-YLeB3V8T-210x300.jpg"},{"judul":"Bloodhound’s Regression Instinct","slug":"bloodhound-s-regression-instinct","tipe":"Manhwa","released":"November 25, 2023","rating":"7.00","author":"Acro","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Martial Arts","Seinen"],"synopsis":"“Yan,” sang protagonis, dicuci otak oleh kaisar dan hidup sebagai bonekanya. Setelah mengetahui dia dipermainkan oleh kaisar, dia berencana untuk membalas dendam, namun pingsan karena kekuatan kaisar. Dia pikir dia telah mati, tetapi ketika dia bangun, dia menyadari bahwa dia telah mengalami kemunduran ke saat dia masih menjadi anggota baru. Entah untuk membalas dendam pada kaisar atau mencari keluarganya. Pilihan ada di tangannya.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/11/elgvf4q7pt976-834181-qpnQF7TS-231x300.webp"},{"judul":"Cloudburst","slug":"cloudburst","tipe":"Manhwa","released":"Juli 7, 2021","rating":"8.3","author":"Chaepali","artist":"","status":"Ongoing","genre":["Shounen Ai","Slice of Life"],"synopsis":"Setelah rumor dirinya homoseksual menyebar, Park Seok Yeon mengalami kesulitan selama sekolah dan setelah lulus, dan sekarang dia menghadapi kesulitan untuk mencari pekerjaan. Untungnya, dia menemukan perusahaan yang sempurna dalam segala hal. Namun, siapa yang akan memberitahunya bahwa bosnya adalah orang yang menyebabkan kemalangannya sejak awal?! Bisakah seorang pekerja yang menangis dan bosnya yang kejam menemukan cinta? Mustahil, sama sekali tidak – ah tunggu, baunya harum","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/07/cloudburst-477015-vm1VNtrX-200x300.jpg"},{"judul":"DeathCord","slug":"deathcord","tipe":"Manhwa","released":"September 17, 2022","rating":"7.00","author":"Buffering","artist":"","status":"Ongoing","genre":["Action","Drama","Thriller"],"synopsis":"Suatu hari, Kyung-min, yang harga dirinya telah mencapai titik terendah karena Disiksa/Diganggu oleh teman-temannya, tiba-tiba menerima undangan ke ‘DeathCord’, ruang obrolan tempat untuk membunuh orang melalui pemungutan suara. Pemungutan suara hukuman mati anonim di chat room! Partisipan anonim yang diundang ke chat room tertarik untuk membunuh orang karena alasan mereka sendiri. Namun, salah satu peserta chat menjadi target hukuman mati, setelah itu, para peserta di chatroom “DeathCord” mulai berjuang untuk mengidentifikasi satu sama lain…Sebuah game pembunuhan yang tidak akan berakhir kecuali satu sama lain saling membunuh!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/09/deathcord-813189-PNxneLFo-300x300.webp"},{"judul":"All Football Talents Are Mine","slug":"all-football-talents-are-mine","tipe":"Manhwa","released":"Oktober 29, 2023","rating":"6.99","author":"Hot Six","artist":"","status":"Ongoing","genre":["Sports"],"synopsis":"Woo Ho-young bermimpi menjadi pemain sepak bola. tetapi takdir berkata lain dia tidak memiliki bakat dan mati tersambar petir tanpa sempat mewujudkan mimpinya. Setelah itu iblis mamon muncul dan memberinya kemampuan untuk mencuri bakat orang lain…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/10/all-football-talents-are-mine-cover-795960-jYgXqsZG-231x300.jpg"},{"judul":"Bastian","slug":"bastian","tipe":"Manhwa","released":"Mei 18, 2023","rating":"7.00","author":"Solche (Author), Abin (Artist)","artist":"","status":"Ongoing","genre":["Drama","Fantasy","Josei","Mature","Romance","Shoujo"],"synopsis":"Cucu pedagang barang rongsokan dan putri pengemis menikah. Berlangsung selama dua tahun, mereka akan melakukan kawin kontrak untuk memenuhi kepentingan masing-masing. Seorang perwira angkatan laut yang bercita-cita tinggi dan orang kaya, cucu seorang pedagang barang rongsokan yang dibenci semata-mata karena garis keturunannya yang rendah hati meskipun sukses emasnya. Bastian Klauvitz membutuhkan batu loncatan untuk hidup sukses dan balas dendam. Seorang bangsawan yang jatuh yang hanya bisa menghidupkan kembali kejayaan masa lalu, seorang putri yang mencari nafkah melalui kerja paksa meskipun darah keluarga kekaisaran mengalir di dalam dirinya. Odette von Dyssen membutuhkan uang untuk memulai hidup baru. Keduanya mengira itu adalah kesepakatan yang menguntungkan, sampai sesuatu yang tidak terduga terjadi. “Kamu merusak hal yang paling berharga bagiku, jadi wajar saja jika kamu kehilangan sesuatu yang sama berharganya juga. Apa aku salah?” Bastian memutuskan untuk meminta pertanggungjawabannya atas kerusakan yang terjadi. Benci, dendam, penyesalan, bahkan nama wanita sialan ini. Demi akhir yang lengkap dimana semuanya terbakar putih dan pudar.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/05/bastian-034600-hEvU43tv.jpg"},{"judul":"Chronicles of the Reincarnated Demon God","slug":"chronicles-of-the-reincarnated-demon-god","tipe":"Manhwa","released":"Desember 14, 2024","rating":"7.00","author":"GONE, Sa Do Yeon","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Seinen","Supernatural"],"synopsis":"Yeon Woonhwi, Heavenly Demon muda. Dia menjadi pemimpin muda dari Kultus Divine Heavenly Demon dengan mengandalkan kekuatannya. Woonhwi yang sudah melewati banyak krisis dihadapkan dengan pengkhianatan wakil pemimpin kultus dan tetua yang lain. [Pastikan kau mengingat siapa diriku ketika kau membunuhku, jadi bunuhlah aku sekarang!] Woonhwi yang mati dengan begitu gagah terbangun di tempat yang sangat mengejutkan… [Klan Tang? Apa ini keluarga cabang mereka?] Tang Woonhwi, anggota Klan Tang dari Sichuan cabang Guryong berkeinginan untuk membentuk ulang Kultus Divine Havenly Demon. Chronicles of the Reincarnated Demon God","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/12/chronicles-of-the-reincarnated-demon-god-247719-jy1G586Q-210x300.jpg"},{"judul":"Became the youngest Sister-in-Law of the Ruined Harem Male Leads","slug":"became-the-youngest-sister-in-law-of-the-ruined-harem-male-leads","tipe":"Manhwa","released":"Januari 22, 2025","rating":"7","author":"Eun-Ren, Lina","artist":"","status":"Ongoing","genre":["Full Color","Girls","Time Travel"],"synopsis":"Aku bereinkarnasi ke dalam novel harem terbalik yang putus asa dan kumuh, tetapi entah mengapa tokoh utama wanitanya meninggal. Keterkejutan karena cerita aslinya hancur dan kemudian menghilang tidak berlangsung lama. Para kakak perempuan mulai terhubung dengan para tokoh utama pria. Kepada kaisar yang suka bermain-main dan obsesif, kakak perempuan tertua yang dewasa dan penuh kasih sayang. Kepada jaksa penuntut yang paling kuat dalam pandangan dunia yang blak-blakan, kakak perempuan kedua yang merupakan seorang jenius romansa. Kepada jenius playboy Ma Top-ju, adik perempuan termuda yang sinis. Aku? Aku sekarang berusia enam tahun, jadi akan kacau jika aku memiliki kisah cinta. Bagaimanapun, para kakak perempuan menikah karena mereka tampaknya cocok dengan para tokoh utama pria. Tetapi… “Liliana. Panggil aku oppa.” “Dari semua saudara ipar, apakah aku yang terbaik?” “Itu adalah keinginan kaisar. Kakak ipar termuda akan tinggal di istana dan diperlakukan seperti seorang putri.” Aku hanya ingin kembali ke masa ketika aku berempat dan kakak perempuanku tinggal bersama.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/01/became-the-youngest-sister-in-law-of-the-ruined-harem-male-leads-588872-Ht0GxhCZ-210x300.jpg"},{"judul":"+99 Wooden Stick","slug":"99-wooden-stick","tipe":"Manhwa","released":"Maret 30, 2022","rating":"7.00","author":"Hongsil","artist":"","status":"Ongoing","genre":["Action","Drama","Shounen"],"synopsis":"Manhwa +99 Wooden Stick ‘Aku’, yang diabaikan karena mengatakan ‘chrono life’, sebuah game virtual reality dengan kebenaran tentangnya yang buruk dan benar-benar buruk, berhasil memperkuat senjata dasar ‘wooden stick’ yang dia peroleh secara kebetulan, memperkuatnya menjadi +99, dan pergi mencari orang yang mengabaikannya dengan tongkat. Aku mulai mengalahkan mereka yang mengabaikanku tanpa ampun…! Aksi ultimate scale cider pun dimulai!!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/03/99-wooden-stick-729306-ZbEZhpU9-207x300.png"},{"judul":"Amentia","slug":"amentia","tipe":"Manhwa","released":"Maret 16, 2021","rating":"7.2","author":"Yang Hyeseok","artist":"","status":"Ongoing","genre":["Comedy","Drama","Ecchi","Harem","Romance","School Life","Seinen","Supernatural"],"synopsis":"Menceritakan tentang seorang lelaki bernama Lee Wee Jin yang memiliki adik perempuan yang bernama Wee Na, Lee sangat menyayangi adiknya (Siscon) Saking sayangnya dia bahkan rela melakukan apapun perkataan adiknya. Karena perasaan sayangnya itu, Lee yang suka membayangkan sosok adiknya dalam imajinasinya, kini bisa membuat imajinasinya hidup di dunia nyata, melewati batas kenyataan. Dari mulai situlah Lee menjadi target dari kelompok pembasmi Orang yang bisa membuat imajinasinya menjadi kenyataan yang bernama Waker…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/amentia-959025-I1bGrfYQ-210x300.jpg"},{"judul":"Awfully Damn Kiss and Hug","slug":"awfully-damn-kiss-and-hug","tipe":"Manhwa","released":"April 2, 2021","rating":"7.7","author":"LEE Ki Ha","artist":"","status":"Ongoing","genre":["Drama","Romance","School Life","Shoujo"],"synopsis":"Chae Young Un yang cantik terbiasa berkencan dengan cowok dan putus dengan mereka tak lama setelah itu, tetapi ketika suatu hari dia bertemu dengan siswa tahun pertama yang penuh teka-teki, Jang Yeon Ho, memukuli seorang pria yang baru saja mencuri dompetnya, hidup mereka menjadi saling terkait satu sama lain. . Tidak dapat meninggalkannya sendirian, Chae Young menemukan dirinya khawatir dan merawatnya ketika Jang Yeon Ho berusaha untuk mendorong dirinya semakin jauh ke dalam kehancuran. Apakah kasihan atau cinta yang membuat Chae Young Un peduli dengan Jang Yeon Ho? Dia tidak begitu yakin, tapi apa pun itu, Chae Young menolak untuk meninggalkan sisinya.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/awfully-damn-kiss-and-hug-071651-KYI3yfTa-207x300.jpg"},{"judul":"Archer Sword God : Descendants of the Archer","slug":"archer-sword-god-descendants-of-the-archer","tipe":"Manhwa","released":"Desember 2, 2022","rating":"7.00","author":"Jo Don Hyung","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Historical","Martial Arts","Seinen"],"synopsis":"Eulji Somun, seorang bangsawan yang kini sudah menjadi kakek lanjut usia. Memerintahkan cucu nakalnya untuk pergi ke Jungwon, di mana dia telah berbicara selama tiga generasi dan memiliki banyak perjalanan!\r\n Selamatkan keluarga Namgung yang jatuh. Perjuangan berapi-api Eulji ho untuk memberikan sayap kebangkitan yang luar biasa!!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/12/archer-sword-god-descendants-of-the-archer-492975-3eFM43Ho.jpg"},{"judul":"Damn Reincarnation","slug":"damn-reincarnation","tipe":"Manhwa","released":"Juni 24, 2022","rating":"7.00","author":"Kiki, Mokma (Author), Park Jeong-yeol (Artist)","artist":"","status":"Ongoing","genre":["Action","Adventure","Drama","Fantasy","Shounen"],"synopsis":"Hamel, seorang warrior yang bepergian bersama rekan-rekannya untuk membasmi iblis. Sayangnya, dia meninggal tepat sebelum pertempuran dengan iblis dimulai. ” Ya . ” Apa sih ? Dia terlahir kembali sebagai keturunan dari sesama prajuritnya, Vermouth. Keturunan dari garis keturunan Vermouth yang agung, Hamel. Tidak, dia sekarang adalah Eugene Lionhart. “sudah cukup dengan aku memiliki delusi bahwa adalah seorang jenius dalam kehidupan masa laluku. Tapi …. ini … Ini … Tidak ada bandingannya! Dari tubuh yang sekarat ke tubuh baru, dia memiliki pencapaian yang dia miliki yang tidak ada di kehidupan sebelumnya. Dan, reinkarnasi dari asal yang tidak diketahui, realitas hidup bersama dengan iblis. Menghadapi dunia baru di mana semuanya dipertanyakan. Perjalanan kehidupan sebelumnya yang belum selesai dimulai dengan tubuh Eugene.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/06/damn-reincarnation-226616-2SWDSjmr-210x300.webp"},{"judul":"Baski","slug":"baski","tipe":"Manhwa","released":"April 19, 2022","rating":"7.20","author":"JIN Chul-Soo (Story), Byun Ki-Hyun (Art)","artist":"","status":"Ongoing","genre":["Mystery","Supernatural"],"synopsis":"Sebagai seorang anak, polisi Young-In Jin menyaksikan bersama teman-temannya saat sebuah meteorit jatuh ke Bumi. Tetapi setelah mengetahui bahwa meteorit itu memiliki sifat supernatural, kegembiraan mereka dengan cepat diredam oleh kecelakaan tragis dan mereka bersumpah untuk tidak pernah menyentuhnya lagi. Bertahun-tahun kemudian, sekelompok penjahat bertopeng dengan kekuatan gaib melakukan pencurian bank, membuat Young-In curiga mungkin tidak semua orang menepati sumpah mereka. Saat dia mulai melihat lebih dalam, dia mendapati dirinya sedang menyusuri jalan yang tidak pernah dia duga.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/04/baski-054753-S6Kxlukx-212x300.jpeg"},{"judul":"Country of The Crimson Moon","slug":"country-of-the-crimson-moon","tipe":"Manhwa","released":"Februari 14, 2022","rating":"7.00","author":"Park Shin","artist":"","status":"Ongoing","genre":["Action","Drama","Psychological","Tragedy"],"synopsis":"Mobilisasi anggota organisasi yang memiliki jenis kekuatan super yang dikenal sebagai Kemampuan Glia. Organisasi pamungkas yang dikenal sebagai ‘Bulan Merah’ yang bahkan presiden harus berlutut.! Negara ini sudah menjadi ‘negara Bulan Merah’. Pemerintah yang berusaha menurunkan asal usul kejahatan, Crimson Moon, menemukan Ryu Sihwan yang memiliki kemampuan glia yang setara dengan pemimpin Crimson Moon, Shin Yeongwoo. Menggunakan darahnya, obat ajaib yang membantu seseorang menjadi lebih muda dikembangkan. Dengan obat ajaib itu, para ahli / ahli bela diri generasi sebelumnya yang merupakan empat dari penjahat terhebat yang telah memojokkan Shin Yeongwoo saat mereka berada di usia prima mereka… Akankah 4 penjahat hebat bersama dengan potensi Ryu Sihwan dapat mengalahkan Crimson Moon?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/02/country-of-the-crimson-moon-012852-ZsNHKt0p-207x300.jpg"},{"judul":"Ashtarte","slug":"ashtarte","tipe":"Manhwa","released":"Agustus 18, 2022","rating":"8.6","author":"Andaon","artist":"","status":"Completed","genre":["Fantasy","Historical","Romance"],"synopsis":"“Kekaisaran Firenze akan bertemu dengan cahaya dan kegelapan baru, tetapi kegelapan akan menelan cahaya dan membawa kekaisaran ke kehancuran.” Dalam keluarga kekaisaran yang dipuji karena kunci perak mereka, rambut hitam unik Putri Ashtarte segera dicap sebagai pertanda buruk. Dengan keluarganya yang menghindarinya karena menjadi kegelapan yang dinubuatkan, yang diinginkan Ashtarte hanyalah dicintai, dan mempelajari sihir adalah satu-satunya pilihannya untuk mencapai itu. Suatu hari, dia menemukan mantra takdir yang memindahkannya ke tempat yang tidak diketahui. Ada seorang anak laki-laki yang menunggunya dalam belenggu bernama Abelion Elforman, yang berlabuh…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/08/manga-9097-image-193x278-828014-MTHuQAXv.jpg"},{"judul":"Dain Ironworks","slug":"dain-ironworks","tipe":"Manhwa","released":"April 17, 2021","rating":"7","author":"","artist":"","status":"Ongoing","genre":["Action","Fantasy"],"synopsis":"Geografi Candi Goryeosa vol 10. Orang-orang dari Desa Besi yang ditinggalkan oleh negara itu mengalahkan tentara Mongolia terkuat di dunia! Desa Besi penuh dengan pengungsi, senjata dan besi. di depan desa, ada Jenderal Mongong yang ingin menghancurkan besi dan ratusan tentara Mongol yang mengikutinya. ‘jigwi’ petir Desa Cheolso dan ‘eosahwa’, umur panjang muda yang dingin. kedua pria itu, semua berbeda dari status ke kepribadian, harus bergabung untuk menghentikan tentara Mongol, tetapi kasusnya sedang dalam konflik. akankah Dain Cheolso bertahan dari invasi Mongol? dan bisakah Ji-Gwi dan Eo-Sa-Hwa mengatasi Mongke yang kejam?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/dain-ironworks-746540-89kRWE0u-169x300.jpeg"},{"judul":"Chairman Kang, The New Employee","slug":"chairman-kang-the-new-employee","tipe":"Manhwa","released":"September 3, 2023","rating":"7.00","author":"Sangyeong, Seung Seungi [Add, ]","artist":"","status":"Ongoing","genre":["Drama","Shounen","Supernatural"],"synopsis":"Aku adalah Kang Yong- ho, Ketua Grup Choi Sung, salah satu dari 10 konglomerat top Korea Selatan. Saat aku sedang menikmati kejayaan deklarasi pensiunku, tiba- tiba, seorang karyawan baru jatuh dari langit dan mendarat di kepalaku. Tapi hei, kemana perginya tubuhku, dan sekarang aku sudah berubah menjadi Karyawan baru?! “Apa ini? Apakah kamu menyuruhku untuk memulai dengan Excel atau semacamnya?”","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/09/chairman-kang-the-new-employee-570826-UT6Srhsb-209x300.webp"},{"judul":"Blind Faith Descent","slug":"blind-faith-descent","tipe":"Manhwa","released":"April 12, 2021","rating":"8","author":"HER","artist":"","status":"Ongoing","genre":["Action","Adventure","Drama","Mature","Mystery","Seinen","Supernatural"],"synopsis":"Kisah seorang budak bernama Zion, berlatar di negeri Timur Tengah.  Dia berlatih untuk menjadi ahli necromancer yang hebat, mampu bertarung di tanah yang rata dengan para Ksatria, untuk mendapatkan balas dendam yang telah lama ditunggu sebagai salah satu dari empat anak pilihan Kronos.  Dia menjadi budak atas kemauannya sendiri untuk mencapai tujuannya.  Apa yang telah Tuhan pilih sebagai takdirnya atau apakah itu dipilih oleh iblis?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/blind-faith-967612-kOhLSu6T-208x300.jpeg"},{"judul":"Chronicles Of The Martial God’s Return","slug":"chronicles-of-the-martial-god-s-return","tipe":"Manhwa","released":"Juni 2, 2022","rating":"7.00","author":"Myo","artist":"","status":"Ongoing","genre":["Action","Historical","Martial Arts","Seinen"],"synopsis":"The Ultimate Martial Divine Demon, Dan Woohyun, disegel karena dia terlalu kuat untuk ditangani dunia. Setelah satu milenium berlalu, dia terlepas dari segelnya dan merasa semuanya tidak ada artinya saat dia berjalan di gang-gang belakang… Tepat saat dia jatuh karena dia muak dengan dunia, sebuah tangan kecil muncul di depannya. “Apa ini?” tanya Dan Woohyun. “Sebuah pangsit!” datang balasan. Ini adalah pertama kalinya dalam hidupnya seseorang bersikap baik padanya tanpa niat yang tidak murni, dan itu mengubah nasibnya. Ini adalah kronik dari dewa bela diri yang melintasi ribuan tahun ruang dan waktu!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/06/chronicles-of-the-martial-gods-return-453229-rd7Fx0IT-222x300.webp"},{"judul":"Archmage Restaurant","slug":"archmage-restaurant","tipe":"Manhwa","released":"November 23, 2023","rating":"7.00","author":"Bad Boys, Mr. Cha","artist":"","status":"Ongoing","genre":["Action","Comedy","Fantasy","Shounen","Slice of Life"],"synopsis":"Aku selalu bermimpi untuk menjadi koki terkenal, tapi aku malah dikirim ke dunia lain setelah mengalami kecelakaan. Dunia ini dipenuhi monster dan sihir, tapi tidak ada yang tidak bisa kulakukan kalau aku membuka restoran, ‘kan? Namun, aku malah langsung didaftarkan sebagai anggota militer setelah sampai ke dunia ini karena perang… Akhirnya aku bisa membangun restoranku sendiri setelah berjuang selama 15 tahun… Perjalanan hidup seorang archmage sebagai pemilik restoran! Archmage Restaurant","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/11/6bvbly-197767-U7gRT4Q3-231x300.webp"},{"judul":"Barbarian Quest","slug":"barbarian-quest","tipe":"Manhwa","released":"April 16, 2022","rating":"7.90","author":"Jobless Noble","artist":"","status":"Ongoing","genre":["Action","Adventure","Comedy","Mature","Seinen"],"synopsis":"Pegunungan Langit dalah tempat peristirahatan bagi para roh, dan mereka yang masih hidup tidak diizinkan untuk melewatinya. “Kau akan menjadi warrior yang hebat, Urich.” Urich, warrior terkuat dari suku, meninggalkan rumahnya dan berkelana ke dunia yang beradab.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/04/barbarian-quest-529933-kiim05Ci-222x300.jpg"},{"judul":"DevilShot","slug":"devilshot","tipe":"Manhwa","released":"April 17, 2021","rating":"7","author":"CTK","artist":"","status":"Ongoing","genre":["Action","Comedy","Fantasy","Mystery","Seinen"],"synopsis":"Saat aku melihat mata kematian, aku membuat kontrak dengan Penguasa Dunia Bawah.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/devilshot-682233-AVpVyDPu-208x300.jpg"},{"judul":"Ara Fantasy","slug":"ara-fantasy","tipe":"Manhwa","released":"Maret 21, 2021","rating":"7.0","author":"Yoohee","artist":"","status":"Ongoing","genre":["Action","Fantasy"],"synopsis":"Arcana Fantasy, game yang mengambil alih dunia, menjebak kesadaran Anda di dalam game setelah Anda login. Bisakah banyak korban dapat melarikan diri dari batas antara kenyataan dan dunia virtual? Ini adalah petualangan penuh gejolak dari protagonis utama Yun dan pertumbuhannya di dunia lain.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/ara-fantasy-312530-qHZk78Qb.jpg"},{"judul":"Bring My Level Up Alone","slug":"bring-my-level-up-alone","tipe":"Manhwa","released":"April 6, 2021","rating":"6.5","author":"신필(고렘팩토리)","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy"],"synopsis":"Hanyeol worked as a porter. Become a hunter with the awakening that you have been waiting for! But Hanyeol bekerja sebagai porter. Menjadi pemburu dengan kebangkitan yang telah Anda tunggu-tunggu!\r\n Tapi apa ini?\r\n Tangkap monster untuk naik level dan dapatkan keterampilan melalui tindakan?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/bring-my-level-up-alone-881692-Vm1kSG0O-217x300.jpg"},{"judul":"Again My Life","slug":"again-my-life","tipe":"Manhwa","released":"Maret 4, 2021","rating":"8.4","author":"이해날","artist":"","status":"Completed","genre":["Action","Drama","Shounen"],"synopsis":"Seorang jaksa berdarah panas, Kim Hee Wo, dibunuh dan ditenggelamkan ke laut saat mengejar tiran yang menguasai Korea. Tapi, Kim Hee wo, bertemu dengan malaikat maut yang memberinya kesempatan untuk menghidupkan kembali dan mengirimnya kembali ketika dia berusia 18 tahun. Sebagai siswa sekolah menengah, Kim Heewo, bersiap untuk menghukum si tiran Jo Tae Sup.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/again-my-life-163701-tk8vSTvD-216x300.jpg"},{"judul":"Artifact-Devouring Player","slug":"artifact-devouring-player","tipe":"Manhwa","released":"Februari 23, 2025","rating":"7.00","author":"ê¸°ì¸, ë²¤í°","artist":"","status":"Ongoing","genre":[],"synopsis":"Caraku untuk menjadi lebih kuat sangat sederhana. Aku hanya perlu artefak. Jika aku masih lemah, aku hanya perlu artefak sebanyak mungkin.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/02/artifact-devouring-player-736753-JG9BbPef-208x300.png"},{"judul":"City of Dead Sorcerer","slug":"city-of-dead-sorcerer","tipe":"Manhwa","released":"Juni 26, 2021","rating":"8.1","author":"Carnby","artist":"","status":"Ongoing","genre":["Action","Comedy","Drama","Fantasy","Mystery","Sci-fi","Shounen","Supernatural"],"synopsis":"Tahun 2014, zat baru, SDE01, biasa disebut sebagai “Mana” ditemukan oleh sekelompok ilmuwan Rusia.  Dunia terjun ke dalam perlombaan pembangunan untuk menemukan penggunaan sumber energi baru yang tampaknya tak terbatas ini yang tidak dapat dilihat atau dirasakan.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/06/city-of-the-dead-sorcerer-766358-D8Hxu1mO-228x300.jpg"},{"judul":"Blinded by the Setting Sun","slug":"blinded-by-the-setting-sun","tipe":"Manhwa","released":"April 12, 2021","rating":"7","author":"MURO","artist":"","status":"Ongoing","genre":["Fantasy","Romance","Shoujo"],"synopsis":"“Hildegar”, seorang penyihir yang menerima berkah dari Kariya, Dewi Matahari,dikenal luas karena reputasinya yang menakutkan. “Elkin,” seorang pria dari utara yang kehilangan kampung halamannya, pergi mencari Sang Penyihir ke sebuah kastil yang tidak disebutkan namanya.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/blinded-by-the-setting-sun-972704-UFxXdHsK-211x300.jpeg"},{"judul":"Big Life","slug":"big-life","tipe":"Manhwa","released":"Januari 23, 2023","rating":"7.00","author":"WU Jiho","artist":"","status":"Ongoing","genre":["Adventure","Comedy","Fantasy","Slice of Life","Supernatural"],"synopsis":"Jaegun Ha adalah seorang novelis yang gagal pada usia 27 tahun tanpa menunjukkan apa-apa untuk dirinya sendiri. Itu sampai dia menemukan sekotak barang misterius dan seekor kucing di kuburan! Sekarang Jaegun mampu menyalurkan kemampuan menulis yang luar biasa dari seorang penulis mati bernama Gunwoo Seo, dan karir Jaegun didorong ke status selebritas. Tetapi dengan manfaat kesuksesan datanglah tantangan baru … Webtoon Asli: KakaoPage, Daum Terjemahan Resmi: Inggris, Jepang, Prancis","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/01/big-life-082192-0MNO77DG-222x300.jpg"},{"judul":"Devil’s Editing","slug":"devil-s-editing","tipe":"Manhwa","released":"Desember 4, 2021","rating":"5.5","author":"Geon Cho","artist":"","status":"Ongoing","genre":["Horror","Shounen"],"synopsis":"Pembunuhan mengerikan yang berkedok seorang broadcast joki yang melibatkan penanggung jawab editor video… Apa kebenaran di baliknya?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/12/asdasdasdasdasda-857416-DqD2fr6v-211x300.webp"},{"judul":"Black Haze (Reboot)","slug":"black-haze-reboot","tipe":"Manhwa","released":"April 11, 2025","rating":"7.00","author":"Yong Yong","artist":"","status":"Ongoing","genre":["Action","Comedy","Drama","Fantasy","Shounen"],"synopsis":"Dahulu kala, [Pintu] yang menghubungkan dunia lain terbuka. Manusia memanggil orang-orang yang mendapatkan [Tanda] bersamaan dengan kekuatan sebagai [Penyihir].","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/04/blakchajhbnuygte3-434600-pEYS176M-210x300.jpg"},{"judul":"Ability","slug":"ability","tipe":"Manhwa","released":"Maret 9, 2021","rating":"7.9","author":"Son Jae-Ho","artist":"","status":"Ongoing","genre":["Action","Comedy","Drama","Martial Arts","Mystery","Shounen","Supernatural"],"synopsis":"Dunia supernatural di mana yang kuat memangsa yang lemah.  Bumi bukan hanya untuk manusia ….. dan kemampuan aneh!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/ability-808402-igZ6ZLpg.jpg"},{"judul":"Come on Out, Romeo","slug":"come-on-out-romeo","tipe":"Manhwa","released":"Agustus 23, 2021","rating":"8","author":"","artist":"","status":"Completed","genre":["Action","Drama","Historical","Mystery","Romance","Shounen"],"synopsis":"Romeo Montague, seorang anak laki-laki dilemparkan ke loteng dengan jijik setelah kecelakaan lima tahun lalu. Meskipun dunia mengenalnya sebagai anak laki-laki yang tidak dapat bergerak karena penyakit yang dideritanya yang mengerikan, ia menjalani kehidupan yang bahagia dan berbuah sebagai pertapa di loteng. Hanya sepupunya, Benvolio, dan pengurus rumah tangga, Miriam tahu yang sebenarnya.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/08/come-on-out-romeo-048895-lmbZgaWu-222x300.jpeg"},{"judul":"Corporal Punishment Teacher","slug":"corporal-punishment-teacher","tipe":"Manhwa","released":"Oktober 11, 2021","rating":"7","author":"Shinocchio","artist":"","status":"Ongoing","genre":["Action","Drama","School Life","Seinen"],"synopsis":"Siswa terlemah yang menerima pelajaran mandiri di malam hari khusus dari Choi Kang-in, seorang guru hukuman fisik yang ditugaskan ke Sekolah Menengah Cheoni untuk memperbaiki otoritas dan sistem sekolah yang rusak. Kontratransferensi yang mendebarkan dari siswa yang lemah dan refleksi dimulai.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/10/corporal-punishment-teacher-122484-GTDznM4m-210x300.jpg"},{"judul":"99 Boss","slug":"99-boss","tipe":"Manhwa","released":"Juli 29, 2024","rating":"7.00","author":"Byeol Nomdeul (Author), Plan A (ArtistI","artist":"","status":"Ongoing","genre":["Action","Drama","School Life","Seinen"],"synopsis":"Sang protagonis, Na Seon-wook, terlahir dengan hati seekor harimau. Dia adalah pembuat onar, namun atas permintaan orang tuanya, dia menyembunyikan kekuatannya dan dipindahkan ke SMA Gukyang, sebuah sekolah yang terletak di daerah terpencil yang menurutnya akan sepi. Namun, itu adalah tempat berkumpulnya berbagai budaya kuno dan orang-orang berbahaya. Seon-wook, yang ingin lulus dengan tenang, akhirnya mau tidak mau merasakan darah panasnya dan mulai mendidik mereka!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/07/99-boss-259542-x7F3W5uK-210x300.jpeg"},{"judul":"Chemy","slug":"chemy","tipe":"Manhwa","released":"Juni 6, 2022","rating":"7.00","author":"","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy"],"synopsis":"Hidupku tidak berarti sampai aku mengambil bagian dalam uji klinis yang mencurigakan untuk obat baru. “Obat ini mampu memuat semua pengetahuan yang dimungkinkan oleh biologi molekuler.” Han Jungwoo mampu mengatasi peluang 1 dari 10.000 dan obat itu mulai bekerja. “Silakan bergabung dengan kami di KG Chemical, Tuan Han Jungwoo.” Aku tidak tahu bahwa meminum satu obat dapat mengubah seluruh hidupku.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/06/chemy-765519-7VAbSkOb-210x300.webp"},{"judul":"A Heartfelt Andante","slug":"a-heartfelt-andante","tipe":"Manhwa","released":"Januari 20, 2023","rating":"7.00","author":"NA Yoonhee","artist":"","status":"Ongoing","genre":["Drama","Josei","Romance"],"synopsis":"Kematian satu orang menyebabkan keselamatan orang lain. Setelah bertahun-tahun menderita penyakit jantung, Da-ul menerima transplantasi jantung dari pianis muda dan terkenal Yuwon, yang meninggal dalam kecelakaan mobil. Hidup Da-ul telah berubah selamanya oleh hadiah yang tak ternilai ini, dan dia berjanji untuk membuat setiap detik hidupnya berharga sebagai rasa syukur. Tetapi ketika dia bertemu Yeonjo, wanita yang sangat dicintai oleh donornya, dan mengetahui bahwa dia telah hidup dalam keputusasaan, dia mulai mengembangkan perasaan ambivalen terhadapnya. Apakah itu rasa bersalah, atau mungkinkah hal lain?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/01/a-heartfelt-andante-770750-yXYphgdo.webp"},{"judul":"Absolute Sword Sense","slug":"absolute-sword-sense","tipe":"Manhwa","released":"November 11, 2024","rating":"7","author":"Han Jungwolya, Kim Durumi","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Historical","Martial Arts"],"synopsis":"","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/06/absolute-sword-sense-827639-U73dUp0T.jpg"},{"judul":"Bad Ending Maker","slug":"bad-ending-maker","tipe":"Manhwa","released":"Juni 14, 2023","rating":"7.00","author":"Oilgu, Ryu Eun Garam","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Shounen"],"synopsis":"Mincheol adalah seorang pengembang game yang menghabiskan sebagian besar masa mudanya untuk membuat game virtual reality di mana setelah 5 tahun ia tiba-tiba dipecat karena menentang ide perusahaan untuk menerapkan Sistem Pembayaran Dalam Game pada game yang ia kembangkan. “Begitulah hidupku sebagai direktur pengembangan game berakhir, tetapi karena ini adalah game yang ku ciptakan sendiri, aku akan …. menjadi orang yang mengakhirinya juga, untuk melakukan itu, aku akan masuk ke dalam game untuk menjadi bos terakhir dan menghancurkan game dari dalam dengan tangan kusendiri, “aku akan menunjukkan kepada mereka apa itu Bad Ending”.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/06/bad-ending-maker-222225-clV7NbBx-231x300.jpg"},{"judul":"1RM’s Gigant Rider","slug":"1rm-s-gigant-rider","tipe":"Manhwa","released":"Januari 28, 2024","rating":"7.20","author":"Kudo, Oneuldoyo","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Shounen"],"synopsis":"Bereinkarnasi sebagai orang biasa tanpa nama di Raniakea, benua sihir dan baja, dengan kenangan akan Bumi abad ke-21. Untuk melarikan diri dari kehidupan rakyat jelata, yang hampir seperti budak, dia harus mengangkat ‘Batu Ajaib’ dan menjadi Penunggang Raksasa. ‘Luruskan punggungmu!’ ‘Kencangkan perutmu!’ ‘Tarik napas dalam-dalam ke bagian bawah perutmu!’. Dia menggunakan pengetahuan dari kehidupan sebelumnya sebagai seorang pelatih untuk mengumpulkan kekuatan magis seolah-olah dia sedang berolahraga, dan menaiki tangga hirarki sosial.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/01/1rms-gigant-rider-836224-GkLlH9Fq-210x300.webp"},{"judul":"1st Year Max Level Manager","slug":"1st-year-max-level-manager","tipe":"Manhwa","released":"Juli 28, 2021","rating":"7","author":"HYEON Shin","artist":"","status":"Ongoing","genre":["Action","Comedy","Shounen","Supernatural"],"synopsis":"Jeong Yun Ho, yang merupakan wakil presiden hiburan papan atas dan suami aktris papan atas Ju Yeong In. Dia orang yang sukses, tapi dia selalu merasa kosong di dalam. Akankah hidupnya berubah jika dia membuat pilihan yang berbeda? Sepuluh tahun yang lalu, dia kehilangan senyumnya yang berharga. Dan sekarang, sebagai kata terakhir, sebuah ponsel berdering. “apa sih? aku akan mati?!?” Tapi tunggu, ini aneh. Dia akan kembali ke tahun pertama kehidupannya! Kehidupan “1st year Max Level Manager” baru saja dimulai","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/07/1st-year-max-level-manager-613650-wQ0t7gfJ.jpg"},{"judul":"A Bear’s Daughter","slug":"a-bear-s-daughter","tipe":"Manhwa","released":"Juni 12, 2021","rating":"7","author":"Shinjinha33","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Historical","Horror"],"synopsis":"Petualangan seorang gadis yang mempertaruhkan nasib suku ke dunia di mana monster muncul saat bencana yang paling ditakuti, gerhana.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/06/a-bears-daughter-076539-F9Mtcl9R.jpg"},{"judul":"Black Killer Whale Baby","slug":"black-killer-whale-baby","tipe":"Manhwa","released":"Juli 2, 2024","rating":"7.80","author":"MOON Sihyun, Team_Zena, Q00","artist":"","status":"Ongoing","genre":["Drama","Fantasy","Romance"],"synopsis":"Calyso adalah karakter yang mengalami pengulangan reinkarnasi berkali-kali, sekarang adalah reinkarnasi keempatnya. Di kehidupan sebelumnya, dia selalu mati sebelum menginjak usia 22 tahun dan akan kembali ke awal. Selama kehidupan ketiganya, dia menyadari kalau dimensi bergejolak ketika naga mulai mengamuk. Berdasarkan pengetahuan ini, dia berencana menggunakan kekuatan naga untuk kembali ke dunia asalnya. Sekarang Calypso berada di dalam kisah anak-anak di mana dia bertemu seorang pria yang dianggapnya sebagai ayahnya, tapi dia tidak mengenalinya. Mencari bantuannya, Calypso melibatkan “ayah” dan keluarganya dalam misinya, menjadikan mereka sebagai kawan yang bahkan tidak disadari oleh mereka sendiri dalam perjalanannya. Asupan yang manis-manis dulu ya guys.. Post Views: 173","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/07/black-killer-whale-baby-336857-aUDu3L3D-210x300.jpeg"},{"judul":"Control Player","slug":"control-player","tipe":"Manhwa","released":"April 28, 2023","rating":"7","author":"Galde Yeodon Health God [Add, ]","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Shounen"],"synopsis":"“Aku ingin mengambil kesempatan ini untuk pensiun dari semua kompetisi dan pertandingan hari ini.” Youngmin yang sudah naik ke posisi petarung terkuat hanya menunggu kebosanan. “Aku butuh sesuatu yang akan membuat jantungku berdebar kencang!” Dia menerima provokasi yang tak tertahankan. “Pemain Kwon Young-min… Tentu saja, dia adalah pemain yang hebat. Tapi dia tidak akan sampai ke saga terakhir.” “Apa? Lihat orang ini!” Youngmin, yang dipukul dengan “Kamu buruk dalam game,” akhirnya tidak bisa menolak dan mulai memainkan game virtual reality, Final Saga… “Apa-apaan ini? Oh! aku tidak tahu, coba saja sekarang. Kurangnya informasi, pengalaman, dan pengetahuan dasar, Youngmin mulai bermain game secara membabi buta… “Jika tubuhmu kuat, pikiranmu tenang,” mempraktekkan keyakinan ini, Youngmin mulai hidup sebagai “Lian” di Final Saga dan tumbuh lebih kuat dari tanah ke atas!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/04/1682698981-8383-i413269.jpg"},{"judul":"Dark Fantasy Paladin","slug":"dark-fantasy-paladin","tipe":"Manhwa","released":"Desember 14, 2023","rating":"8.0","author":"","artist":"","status":"Ongoing","genre":["Action","Fantasy"],"synopsis":"Dua tahun telah berlalu sejak Eden terperangkap di dalam sebuah game fantasi gelap berlatar dunia abad pertengahan dengan reputasi tingkat kesulitan yang ekstrem. Dia telah berjuang sebagai paladin dan berhasil memusnahkan 49 demon. Sekarang, dia akhirnya bisa melanjutkan cerita utama game ini. Namun, semakin dia bermain, semakin banyak hal irregular yang terjadi sehingga cerita dan hubungan dengan para NPC berubah. Akankah dia mampu mencegah kehancuran dalam game ini dan bertahan hidup meski banyak hal irregular?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/12/e0afa8996b702a44f297970e58cc5dc8ea40faa5-s2-n2-y1-696553-y9lY4Af5-207x300.webp"},{"judul":"An Imperfect Kiss","slug":"an-imperfect-kiss","tipe":"Manhwa","released":"Maret 6, 2021","rating":"7.6","author":"Kang Ki Eon","artist":"","status":"Ongoing","genre":["Fantasy","Romance","School Life","Shoujo","Supernatural"],"synopsis":"Ciuman yang telah mengubah nasibnya karena keberuntungan? Atau karena kemalangan?\r\n Asmara hardcore seorang gadis miskin yang terkuak di sekolah menengah swasta eksklusif.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/an-imperfect-kiss-967038-NqBRZvS0-207x300.jpeg"},{"judul":"Asha","slug":"asha","tipe":"Manhwa","released":"Desember 22, 2021","rating":"7","author":"Woo Saesae","artist":"","status":"Ongoing","genre":["Drama","Fantasy","Historical","Mystery","Psychological","Seinen","Supernatural"],"synopsis":"raja iblis yang ditangkap oleh manusia. Asha, dipenjara di menara penjara, menciptakan perpecahan antara Putra Mahkota Jeongjin dan Jenderal Muryang, dan berusaha untuk menghancurkan mereka. Pertempuran politik, aksi, dan fantasi oriental yang tak terduga berlangsung dengan latar belakang istana kekaisaran.\r\n Bagaimana kisah selanjutnya ya. Nantikan terus di komiknesia.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/12/420e4ebf-84a7-49fe-82f8-6c31e61d7386-385799-RmCoDwQ5-207x300.webp"},{"judul":"Beastburn","slug":"beastburn","tipe":"Manhwa","released":"Januari 12, 2023","rating":"7.00","author":"Yoon Seon Saeng","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Seinen","Supernatural"],"synopsis":"Cha Hyun-sung, seorang anak laki-laki yang menjalani kehidupan yang menyakitkan, suatu hari dibunuh oleh binatang buas yang tidak dikenal. Namun, apa yang dia lihat di depannya adalah Sun Ga-young, seorang gadis yang telah bangkit dari kematian dan membangunkan serta memburu dirinya sendiri dan binatang buas itu. Di tengah pertempuran antara binatang buas dan manusia, Hyun-sung memulai perjuangannya untuk bertahan hidup.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/01/beastburn-270970-O8shAzu7.jpg"},{"judul":"A Blank Slate Regression for the Idol That Lost His Original Mindset","slug":"a-blank-slate-regression-for-the-idol-that-lost-his-original-mindset","tipe":"Manhwa","released":"Januari 22, 2025","rating":"7","author":"Liber (ë¦¬ë²¨)","artist":"","status":"Ongoing","genre":["Adaptation","Music","Time Travel"],"synopsis":"‘Sekarang aku mau mengerjakan musik sungguhan dari pada idol.’ ♪ Eden Yoon, seorang idol berusia 8 tahun yang lelah bekerja di agensi jelek dan bekerja sampingan sebagai penulis lagu. ♪ Aku berhasil membeli rumah sendiri di Cheongdam-dong, tetapi penyakit seni menyerangku? ♪ [Penggemar ke-30.000 kecewa padamu.] [Kami memulai proyek untuk mendapatkan kembali niat awal bagi para idola yang kehilangan niat awal mereka!] ♪ Tapi kenapa? Saat dia hendak meninggalkan grup, dia dikirim kembali ke hari debutnya ketika dia masih idiot dan diminta untuk menemukan niat aslinya – ♪ [Untuk menyelesaikan proyek, Anda harus memenuhi persyaratan yang diperlukan.] [Anda mengecewakan 30.000 penggemar, tolong buat 30 juta penggemar bahagia. Buatlah!] ♪ Kamu bahkan diberi misi untuk sukses sebagai idola tim utama?! ♪ “Persetan, rumahku di Cheongdam-dong! Biaya hak cipta saya bernilai ratusan juta! “Ferrari-ku!” ♪ [Bahasa kotor terdeteksi.] [Kedalaman awal -2] [※Ketika kedalaman awal mencapai 0, itu dimulai lagi!] ♪ Akankah proyek mendapatkan kembali niat awal seorang idol yang telah kehilangan niat aslinya dalam kondisi ekstrem di mana regresi tak terbatas menunggu bahkan jika dia gagal, berhasil?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/01/a-blank-slate-regression-for-the-idol-that-lost-his-original-mindset-024524-4VyLDpSd-211x300.jpeg"},{"judul":"Annarasumanara","slug":"annarasumanara","tipe":"Manhwa","released":"Maret 19, 2021","rating":"8.7","author":"HA Il-Kwon","artist":"","status":"Completed","genre":["Drama","Josei","Mystery","Psychological","School Life","Slice of Life"],"synopsis":"Desas-desus beredar di sekolah tentang taman hiburan yang ditinggalkan dan seorang pesulap yang tinggal di sana yang dapat membuat seseorang menghilang selamanya.  Yoon Ah-ee, seorang gadis yang berjuang untuk memberi makan saudara perempuannya dan dirinya sendiri setiap hari akan mengalami perubahan hidupnya saat dia bertemu dengan seorang penyihir misterius.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/annarasumanara-962393-Doqxz8FU-210x300.jpg"},{"judul":"6 Worlds of Cultivation","slug":"6-worlds-of-cultivation","tipe":"Manhwa","released":"Maret 7, 2021","rating":"5.4","author":"Wol Yeonjae","artist":"","status":"Ongoing","genre":["Drama","Fantasy","Martial Arts","Romance","Shounen"],"synopsis":"Ditinggal sendirian di depan biara selama masa sulit, Yub SeJun dianggap sebagai bayi normal yang ditelantarkan.  Namun, dia memiliki kekuatan untuk mengubah dunia sesuai keinginannya.  Di dunia, setiap orang mengikuti kultivasi klasik;  Namun, SeJun mengikuti akhlaknya dan menciptakan metode kultivasi baru.  Bisakah dia menjadi pahlawan baru yang akan membawa dunia keluar dari kekacauan?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/6-worlds-of-cultivation-395649-qBcnBWuh-213x300.jpg"},{"judul":"Climbing the Tower that Even the Regressor Couldn’t","slug":"climbing-the-tower-that-even-the-regressor-couldn-t","tipe":"Manhwa","released":"Juli 4, 2023","rating":"8","author":"화 연재","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy"],"synopsis":"Sinopsis Climbing the Tower that Even the Regressor Couldn’t  |  Memanjat Tower yang Bahkan sang Regressor pun Tidak Bisa","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/07/climbing-the-tower-that-even-the-regressor-couldnt-401922-t9b5307E-210x300.jpg"},{"judul":"Decide to Be a Villain","slug":"decide-to-be-a-villain","tipe":"Manhwa","released":"Mei 18, 2023","rating":"7.00","author":"ferocious wild bear","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","School Life","Supernatural"],"synopsis":"San Kim, seorang maniak komik biasa. Suatu hari, dia menjadi ‘manusia super’ yang secara tidak sengaja\r\n mengerahkan kekuatan transenden sambil menelan benda tak dikenal secara paksa oleh Ifjin. Seorang ‘hero’ yang\r\n harus melalui kesulitan untuk menyelesaikan kasus ini. Villain’ keren yang melakukan segala jenis kejahatan. Ke\r\n mana pun seseorang memandang, mereka yang memiliki banyak uang dan karisma adalah ‘villains!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/05/decide-to-be-a-villain-711042-w7QaTYfC.jpg"},{"judul":"A Maid Was More of a Calling Than a Princess","slug":"a-maid-was-more-of-a-calling-than-a-princess","tipe":"Manhwa","released":"Maret 20, 2024","rating":"8.3","author":"Egebet Kim Ppopi","artist":"","status":"Ongoing","genre":["Comedy","Drama","Fantasy","Romance","Shoujo"],"synopsis":"Sianna adalah putri dari sebuah kerajaan kecil. Sampai tentara kekaisaran datang menjajah… Tepat sebelum kepalanya akan dipenggal oleh pangeran kejam itu, Sianna berteriak. “Tolong ampuni saya!” Sianna memohon dengan suara lirih kepada putra mahkota tampan dengan wajah yang berlumuran darah. “Saya memiliki banyak bakat yang saya pelajari di istana. Bukankah saya akan sempurna jika menjadi seorang pelayan?” Begitulah cara Siana menjadi seorang pelayan magang di istana kekaisaran.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/03/resource-496235-pzEJ72bF-210x300.png"},{"judul":"Beyond Virtual","slug":"beyond-virtual","tipe":"Manhwa","released":"September 1, 2021","rating":"7","author":"EGA","artist":"","status":"Ongoing","genre":["Drama","Romance","Slice of Life"],"synopsis":"Siswa SMA Sora Yeom memiliki kehidupan yang sempurna: dia tinggal di rumah yang indah, memakai model pakaian terbaru, dan bahkan berkencan dengan anggota idola favoritnya. Hanya ada satu tangkapan — tidak ada yang nyata! Sora menjalani kehidupan fantasinya di VR, membuat kenyataan terasa membosankan jika dibandingkan. Dengan bantuan sahabatnya Yiheon, yang bermimpi menjadi idola kehidupan nyata, Sora harus menemukan tempatnya di dunia di mana kebanyakan orang lebih suka melarikan diri ke VR daripada menghadapi kenyataan.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/09/beyond-virtual-253253-TWQhOniv-300x300.jpg"},{"judul":"Dark Air","slug":"dark-air","tipe":"Manhwa","released":"Oktober 26, 2021","rating":"7.8","author":"Park Min-seo","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Gender Bender","Romance","Shounen"],"synopsis":"Sebelumnya, dunia penuh dengan sihir, lalu kemudian sihir tiba-tiba menghilang dari semua tempat. Para penyihir tidak bisa lagi melakukan sihir, jadi sekarang yang dulunya kuat, kini tidak berbakat dan dipandang rendah oleh prajurit dan semua orang. Tapi ada dua orang yang bisa melakukan sihir meski sihir sudah menghilang, seorang penyihir yang haus kekuasaan dan anak laki-laki muda yang kehilangan semua yang ia sayangi. Ikuti Melrose dan rekannya dalam petualangan mereka seraya mencoba memecahkan misteri Dark Air ini.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/10/dark-air-855376-AwPq0cDf-208x300.jpg"},{"judul":"Circle Zero’s Otherworldly Hero Business","slug":"circle-zero-s-otherworldly-hero-business","tipe":"Manhwa","released":"Juni 26, 2021","rating":"6.1","author":"LIM Dall-Young, Lunar Phase","artist":"","status":"Ongoing","genre":["Comedy","Drama","Ecchi","Fantasy","Gender Bender","Shounen","Slice of Life"],"synopsis":"Si MC, adalah seorang cowok egosentris yang memiliki kehidupan yang sukses, memimpin sebagai CEO dari sebuah perusahaan di masyarakat modern dibunuh dan dilahirkan kembali sebagai cewek cantik bernama Paril dari keluarga bangsawan di dunia fantasi. Saat dia bangun, (sudah pada tubuh cewek,) dia merasakan bahwa dia sekarang berada di dalam tubuh “wujud yang lebih rendah” dan bahwa semua kekayaan, pencapaian, dan kehidupannya yang sukses telah lenyap. Oleh karena itu, ia memutuskan untuk membangun kembali segala sesuatu dari awal dan membuatnya menjadi “berada paling atas” di dunia paralel ini.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/06/circle-zeros-otherworldly-hero-750535-npjeDLIq-211x300.jpg"},{"judul":"Date With Tia","slug":"date-with-tia","tipe":"Manhwa","released":"November 10, 2023","rating":"7","author":"Jo Yong Seok","artist":"","status":"Ongoing","genre":["Drama","Fantasy","Mirror","Slice of Life"],"synopsis":"Cerita baru dari Author “Windbreaker”","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/11/date-with-tia-158474-zwvp9mGU-221x300.webp"},{"judul":"Ancient Animals","slug":"ancient-animals","tipe":"Manhwa","released":"Maret 18, 2025","rating":"7","author":"Kojehyeong","artist":"","status":"Ongoing","genre":["Drama","Historical","Seinen"],"synopsis":"","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/03/ancient-animals-520546-sgglyD2R-207x300.jpg"},{"judul":"Bug Train","slug":"bug-train","tipe":"Manhwa","released":"Mei 13, 2021","rating":"7","author":"Sajadu","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Shounen"],"synopsis":"Tempat ini ada di dalam dunia game. Kami adalah NPC. Pada hari kita menyadarinya, kita menjadi ‘bug’. Jika Operator menangkap NPC yang menjadi ‘Bug’, mereka akan menjadi ‘Patch’","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/05/bug-train-923383-3qK9n4s1.png"},{"judul":"Assassin’s Creed","slug":"assassin-s-creed","tipe":"Manhwa","released":"Mei 13, 2023","rating":"7.00","author":"","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy"],"synopsis":"WebToon korea yang akan mengisahkan Tentang Edward Kenway Dalam Sekuel Assassin Creed® Black Flag","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/05/assassins-creed-161461-DleXNxhQ.jpg"},{"judul":"Daechi-dong Class","slug":"daechi-dong-class","tipe":"Manhwa","released":"Juni 27, 2023","rating":"7.00","author":"Hogeol Seonsaeng, Team Ipeu","artist":"","status":"Ongoing","genre":["Drama","School Life","Shounen","Supernatural"],"synopsis":"Kang Myeong-Mun berubah dari guru sekolah menengah bergengsi menjadi instruktur akademi swasta yang lusuh karena kegagalannya dalam ‘mengungkap korupsi sekolah swasta.’ Pada hari-hari ketika dia menyesali masa lalunya, dia terpaksa mundur ke masa ketika dia adalah seorang guru pemula karena kejadian tertentu .. Dengan dasar pengetahuan ujian masuk perguruan tinggi yang ia kumpulkan hingga saat ini, perjuangannya untuk menjadi guru terbaik dimulai!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/06/daechi-dong-class-496579-84it4h8t-210x300.jpg"},{"judul":"Cavalier of the Abyss","slug":"cavalier-of-the-abyss","tipe":"Manhwa","released":"Mei 6, 2021","rating":"7.8","author":"GA On-Bi","artist":"","status":"Ongoing","genre":["Action","Adventure","Drama","Ecchi","Fantasy","Romance","Shounen","Supernatural"],"synopsis":"Sequel dari Immortal Regis. Membaca keseluruhan prekuel sangat dianjurkan.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/05/cavalier-of-the-abyss-467133-wclDkUJt-207x300.jpg"},{"judul":"Defense Breaker","slug":"defense-breaker","tipe":"Manhwa","released":"Juli 17, 2025","rating":"8.26","author":"J.Sin (주신), Ino (이노)","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy"],"synopsis":"Jihoon terjebak dalam game bertahan. Ia dipaksa menjadi kapten para ksatria dan mempertahankan kerajaan dari monster. Namun, luka yang diterimanya dari manusia belum sembuh, jadi ia menolak untuk melindungi kerajaan. Lalu tiba-tiba, sebuah rute baru terbuka… Defense Breaker","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/07/defense-breaker-136131-CrP8D4BZ-231x300.png"},{"judul":"Black Corporation: Joseon","slug":"black-corporation-joseon","tipe":"Manhwa","released":"Desember 31, 2023","rating":"7.00","author":"Gukppong, Kim Puluk","artist":"","status":"Ongoing","genre":["Comedy","Fantasy","Historical","Reincarnation","Shounen"],"synopsis":"Maniak yang gila di semua bidang seperti militer dan steampunk telah bereinkarnasi. Namun, ayahnya adalah Sejong yang Agung? Raja yang sangat bijak dan anaknya yang gila. Bersama dengan para menterinya, beserta manusia tak terhitung yang dimanfaatkan. Bahkan hari ini, malam di Joseon dipenuhi dengan lampu pekerja lembur.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/12/black-corporation-424385-hGHGCjER-200x300.webp"},{"judul":"Blade Note","slug":"blade-note","tipe":"Manhwa","released":"April 12, 2021","rating":"7.4","author":"YUN Jun Sik","artist":"","status":"Ongoing","genre":["Action","Drama","Mature","Mystery","Seinen","Supernatural"],"synopsis":"Apakah kau percaya pada Tuhan? Orang yang selamat dari pertanyaan memilih pedang yang kerasukan untuk memberikan jawabannya.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/blade-note-069538-GcbI50yT-300x300.png"},{"judul":"Dark Haired Tactical Genius","slug":"dark-haired-tactical-genius","tipe":"Manhwa","released":"November 21, 2022","rating":"7.00","author":"Kang RoyÂ [Add, ]WHYNOTME ProductionsÂ [Add, ]","artist":"","status":"Ongoing","genre":["Drama","Shounen","Sports"],"synopsis":"Divisi 3 K-League Karakter utama, Ma Jeong-woo, adalah seorang analis strategi. Sebuah tim sepak bola Inggris yang diwarisi dari kakeknya yang meninggal dunia tanpa kabar saat menderita hutang yang terus meningkat! Saya mencoba menjual klub dan memulai hidup baru, ‘Apa? Utang klub saja 150 miliar!?’ Untuk melunasi utangnya, Jeong-woo melangkah maju untuk menjadi pemilik dan bahkan manajer…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/11/dark-haired-tactical-genius-686693-5C3wvwRM.webp"},{"judul":"A Thousand Faces","slug":"a-thousand-faces","tipe":"Manhwa","released":"Mei 22, 2025","rating":"9.00","author":"Kaji, Kim Gamja, Sosan","artist":"","status":"Ongoing","genre":["Drama","Fantasy","Shounen","Slice of Life"],"synopsis":"Original Webtoon:\r\n KakaoPage, Daum","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/05/resource-waifu2x-art-scan-noise3-scale-108657-xwtHil7m-210x300.png"},{"judul":"Bandit King","slug":"bandit-king","tipe":"Manhwa","released":"Juli 15, 2022","rating":"7.00","author":"Brandon Chen (Author), mikeyartbook (Artist)","artist":"","status":"Ongoing","genre":["Action","Horror","Romance","Supernatural","Thriller"],"synopsis":"Ini adalah zombie apocalypse dan dunia yang kita tahu telah menjadi neraka. Roy Kim adalah pecundang dan korban bullying di SMA. Dia berharap dia akan ditakdirkan di kehidupan baru yang berbahaya.Itu sampai dia melintasi Zoe Winters, yang menunjukkan kepadanya bahwa semua hal yang dulu penting dalam masyarakat, tidak lagi penting. Kiamat adalah waktu untuk kelahiran kembali.Roy dan Zoe akan memulai perjalanan untuk berkembang dalam kiamat. Dunia lama telah hilang. Saatnya untuk memerintah yang baru.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/07/bandit-king-347582-McKzLanS-203x300.webp"},{"judul":"ASURA (Handol)","slug":"asura-handol","tipe":"Manhwa","released":"April 2, 2021","rating":"6.5","author":"HanDol","artist":"","status":"Completed","genre":["Action","Adventure","Comedy","Fantasy","Martial Arts","Tragedy"],"synopsis":"Asura adalah juara naraka panas (neraka), tetapi tidak ada yang tersisa baginya untuk bertarung lagi. kemudian dia mendengar indra, makhluk terkuat di dunia, telah muncul …\r\n Manhwa ASURA toonily","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/asura-166776-0EhA4nRt-225x300.jpg"},{"judul":"Back to The Chanbi","slug":"back-to-the-chanbi","tipe":"Manhwa","released":"Juli 8, 2024","rating":"7.20","author":"Jang Sahwi","artist":"","status":"Ongoing","genre":["Comedy","Romance","School Life","Slice of Life"],"synopsis":"Kang Gyeon-oh yang berusia 18 tahun menikmati nasib baik dari cinta dua arah. Orang lainnya adalah Baek Chan-bi, seorang gadis ultra-cantik di kelas yang sama. Ia hanya sempat menikmati kemesraan dengan Chanbi yang selalu berjalan lurus duluan, namun Chanbi mengalami kecelakaan. Dia kehilangan ingatannya setahun terakhir dan bahkan kehilangan ingatannya menyukai Gyeon-oh! Gyeon-oh, yang seketika menjadi cinta bertepuk sebelah tangan. Akankah kita bisa kembali ke masa lalu yang saling mencintai? … Tapi apakah kamu yakin kita saling menyukai? Post Views: 31","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/07/back-to-the-chanbi-163566-xlzXVPnM.jpg"},{"judul":"Bug Eater (Bug Hunter)","slug":"bug-eater-bug-hunter","tipe":"Manhwa","released":"Mei 17, 2022","rating":"8","author":"Lee Ryuk","artist":"","status":"Ongoing","genre":["Action","Fantasy","Shounen"],"synopsis":"Suatu hari pemain No 1 ‘Kim Jihan’ yang mencapai peringkat puncak menggunakan bug dari permainan mendapatkan karakternya dihapus oleh pengguna misterius dan menjadi level 1.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/05/bug-hunter-644325-Wwc5Hnuu-219x300.webp"},{"judul":"Absolute Obedience","slug":"absolute-obedience","tipe":"Manhwa","released":"Agustus 26, 2022","rating":"7","author":"Hon","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Manhwa","School Life"],"synopsis":"Jin Daim, yang diganggu oleh para pengganggu, tiba-tiba suatu hari dia menemukan permainan yang mengubah hidupnya. Gim RPG strategi yang sangat kuat yang memungkinkan dia untuk memerintah para pengganggu itu dan membuatnya menjadi pelayannya! Tujuan akhir dari permainan ini adalah penghapusan kekerasan sekolah dari dunia!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/08/absolute-obedience-381897-KxaEBG42-207x300.webp"},{"judul":"A Bias Girl","slug":"a-bias-girl","tipe":"Manhwa","released":"Maret 7, 2021","rating":"7.1","author":"Wi Seong U","artist":"","status":"Ongoing","genre":["Comedy","Ecchi","School Life","Shounen"],"synopsis":"Dua gadis memulai tahun mahasiswa baru mereka di sekolah tinggi. Namun, kedua gadis setelah bertahun-tahun berada bersama-sama dan dipisahkan. Salah satu dari dua gadis tidak menerimanya dengan mudah dan dunianya berantakan.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/a-bias-girl-118708-I7aR162t-208x300.jpg"},{"judul":"7Fates: Chakho","slug":"7fates-chakho","tipe":"Manhwa","released":"April 5, 2022","rating":"7.00","author":"HYBE","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Shounen","Super Power","Supernatural"],"synopsis":"Di kota Sinsi yang jatuh, seorang pria misterius yang ditemuinya di jalan mengajukan pertanyaan kepada Je-ha.\r\n Tapi saat Je-ha terbangun di rumah sakit, dia tidak bisa mengingat apa yang terjadi hari itu…\r\n Ketika makhluk yang disebut penjahat yang seharusnya tidak ada di dunia ini mewarnai kota menjadi bencana,\r\n Tujuh takdir saling terkait, dan mereka mengangkat tangan untuk menghadapinya. Sekarang saatnya berburu harimau.\r\n Pemeran Super: BTS","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/04/7fates-chakho-803954-sNqCf6yA-230x300.jpg"},{"judul":"A Bad Person (Bad Guy)","slug":"a-bad-person-bad-guy","tipe":"Manhwa","released":"November 13, 2024","rating":"7","author":"Dooms","artist":"","status":"Ongoing","genre":[],"synopsis":"Seorang pria baik yang telah berusaha untuk membuat dirinya menjadi tipe pria ideal naksirnya selama sepuluh tahun. Tetapi! Suatu hari, dia mengatakan bahwa dia menyukai laki-laki nakal…Mulai hari ini dan seterusnya, aku…akan terlahir kembali sebagai anak nakal.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/11/a-bad-person-bad-guy-067530-U2EzN88B.jpg"},{"judul":"Covert Agent","slug":"covert-agent","tipe":"Manhwa","released":"November 30, 2021","rating":"7","author":"YLAB","artist":"","status":"Ongoing","genre":["Action","Fantasy"],"synopsis":"Segala sesuatu yang terjadi mulai sekarang adalah kebetulan. Jangan pernah bermimpi keajaiban seperti itu terulang kembali. Setelah kerajaan kuno ‘Jyushin’ musnah, satu-satunya agen rahasia avant-garde yang masih hidup, Munsu, berkeliling dunia, menghakimi kejahatan..","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/11/covert-agent-177476-8s7Xsos2-210x300.webp"},{"judul":"Chongsa","slug":"chongsa","tipe":"Manhwa","released":"Juni 7, 2021","rating":"6.4","author":"Kim Jun Hyeong","artist":"","status":"Ongoing","genre":["Action","Adventure","Gender Bender","Historical","Martial Arts","Shounen"],"synopsis":"Penjaga kerajaan Raja, terdiri dari prajurit yang memiliki keterampilan tertinggi di semua negara.  Orang menyebut mereka “Chongsa” (mirip dengan musketeer).  Jika seorang chongsa melayani raja Korea, mereka dihormati dan dimuliakan.  Namun, sepuluh tahun sebelumnya, wakil kapten mereka membunuh Raja dan hampir membunuh putri yang menggantikannya.  Tetapi politik tidak pernah sesederhana itu, karena empat pelamar akan segera mengetahuinya.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/06/chongsa-354090-Yw5q12tK-300x300.jpeg"},{"judul":"Childhood Friend Of The Zenith","slug":"childhood-friend-of-the-zenith","tipe":"Manhwa","released":"November 11, 2024","rating":"7","author":"Ubilam","artist":"","status":"Ongoing","genre":[],"synopsis":"Gu Yangchun, orang yang mengkhianati sekte-sekte ortodoks, menjadi Demonic Human dibawah Heavenly Demon. Hidup sebagai Demonic Human, dia menjalani kehidupan yang penuh penyesalan. Dia melakukan banyak kejahatan sampai tak terhitung jumlahnya bukan atas kemauannya sendiri, tapi karena perintah dari Heavenly Demon. Dalam perang besar Ortodoks melawan Demon, berkat Wi Seol-Ah yang berhasil menebas Heavenly Demon yang sudah membuat 3 petinggi pasukan Ortodoks bertekuk lutut. Gu Yangchun ditawan oleh pasukan Ortodoks dan menderita karena dosa-dosanya. Dengan moral yang masih tersisa di dalam dirinya, dia mati dengan memberikan informasi kepada Wi Seol-Ah tentang Kultus Demon karena ikatan yang diberikan oleh Heavenly Demon kepadanya. Setelah itu, karena beberapa alasan, Gu Yangchun mengalami regresi menuju waktu pada saat dia pertama kali bertemu dengan Wi Seol-Ah. Menyadari bahwa regresi itu bukanlah mimpi, Gu Yangchun memutuskan untuk menjalani kehidupan yang tenang. Akan tetapi, berbagai ikatan buruk dari kehidupan sebelumnya mulai mendekat, satu per satu. Childhood Friend Of The Zenith","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/08/childhood-friend-of-the-zenith-207475-auffZQbp-221x300.png"},{"judul":"Academy’s Genius Swordmaster","slug":"academy-s-genius-swordmaster","tipe":"Manhwa","released":"Juli 30, 2023","rating":"7.4","author":"","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy"],"synopsis":"Ronan hidup dengan dipenuhi rasa penyesalan. Di akhir hidupnya yang menyedihkan itu, dia mendapat kesempatan kedua. Dia kembali ke masa dimana dia adalah bocah 10 tahun! Demi orang-orang yang sudah mengorbankan nyawa mereka untuknya, dia berjanji akan menjalani hidup barunya dengan penuh semangat. Academy’s Genius Swordmaster","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/07/bdc3b8aec1ee-c7a5c1f6-690x1000-350x476-885585-MoJAgjbU-221x300.webp"},{"judul":"Absolute Martial Arts","slug":"absolute-martial-arts","tipe":"Manhwa","released":"Maret 9, 2021","rating":"7.00","author":"LEE Kiheon","artist":"","status":"Ongoing","genre":["Action","Adventure","Comedy","Fantasy","Martial Arts","Shounen"],"synopsis":"Di ambang kematian, saya diselamatkan oleh sekelompok eksistensi tingkat iblis tua di puncak kultivasi. Tapi aku, Yeon-kang memiliki terlalu banyak potensi dalam seni bela diri, dan sayangnya diculik dan dipaksa menjadi murid mereka… Bergabunglah denganku saat aku berusaha sekuat tenaga untuk melepaskan diri dari genggaman mereka, dan memasuki dunia Murim!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/absolute-martial-arts-301716-SaDjYfku-220x300.jpg"},{"judul":"Bastard","slug":"bastard","tipe":"Manhwa","released":"Maret 10, 2021","rating":"8.8","author":"Kim Carnby","artist":"","status":"Completed","genre":["Drama","Horror","Mystery","Psychological","Romance","School Life","Tragedy"],"synopsis":"“Ada pembunuh yang tinggal bersamaku.”\r\n Perselisihan yang mengerikan.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/bastard-hwang-youngchan-179148-OnaQ8hcU-198x300.jpg"},{"judul":"Battle Slime","slug":"battle-slime","tipe":"Manhwa","released":"Januari 27, 2024","rating":"7.00","author":"noflxsh","artist":"","status":"Ongoing","genre":["Action","Fantasy","Shounen"],"synopsis":"The Earth, swept away by the Third World War using nuclear bombs, drives humans and living things to the brink of extinction. A world that has lost the concept of a nation and has become nationalized. The Titan Company gradually recovers the devastated world using slimes and monopolizes resources while growing into a unique company on the planet. Titan has only one goal. Combining slimes and growing children to create a black hole on Earth. Then create a god who will make his ambitions come true. This is a story about the struggle between reckless Noah and cranky Ark.Original Webtoon:","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/01/battle-slime-321226-yU6zPoNj-210x300.png"},{"judul":"Bowblade Spirit","slug":"bowblade-spirit","tipe":"Manhwa","released":"Maret 4, 2021","rating":"6","author":"Cho Don Hyeong","artist":"","status":"Completed","genre":["Action","Adventure","Fantasy","Martial Arts","Shounen"],"synopsis":"Busur adalah senjata yang mendominasi segala sesuatu yang terlihat, bahkan untuk target yang bersembunyi pada jarak yang terlalu jauh untuk dilihat oleh mata. Bayangkan saja senjata yang bahkan tidak bisa Anda lihat menargetkan hidup Anda. Apa yang mungkin lebih menakutkan dari itu? Sebuah rezim pelatihan dari neraka dengan seorang kakek yang brutal. Perjalanan yang menyenangkan ke Zhongyuan untuk mencari seorang istri. Munculnya pahlawan yang akan menjungkirbalikkan dunia Murim. Ki Guided Arrow – tampilan baru tentang Ki Guidance yang lebih kuat dari Ki Guided Sword dan Blade! Tembakkan panahnya!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/bowblade-spirit-984789-D7apyVyg-222x300.jpg"},{"judul":"Change Season 2","slug":"change-season-2","tipe":"Manhwa","released":"April 30, 2021","rating":"7","author":"Jinone","artist":"","status":"Completed","genre":["Comedy","Drama","Gender Bender","Romance","School Life","Supernatural","Webtoons"],"synopsis":"Season kedua dari Manhwa Change","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/change-season-2-798305-KGr3Fvkw-212x300.jpg"},{"judul":"Born as the Daughter of the Lowly Concubine","slug":"born-as-the-daughter-of-the-lowly-concubine","tipe":"Manhwa","released":"Januari 28, 2025","rating":"7","author":"Daneun / Eunhyeon / Eunsan (ìì°) / Wolmyeon","artist":"","status":"Ongoing","genre":["Adaptation","Emperor's daughter","Fan-Colored"],"synopsis":"Begitu aku membuka mata setelah mengalami kecelakaan, aku menjadi putri selir di dunia yang mirip drama sejarah. Untungnya, aku tidak perlu memikirkan soal makan karena terlahir di keluarga kerajaan, Tapi, itu untuk sementara karena persaingan untuk menduduki posisi ratu yang kosong di istana kerajaan menyerang Si-ah! . “Bwaaeeeeeangg!! (Biarkan aku hidup tenang bersama ibuku!!)”","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/01/born-as-the-daughter-of-the-lowly-concubine-045602-e8mY7tmw-210x300.jpg"},{"judul":"A Hero Who Does Everything Well","slug":"a-hero-who-does-everything-well","tipe":"Manhwa","released":"September 19, 2024","rating":"7.00","author":"Hwang Gyu Young (Author), White Eagle (Artist)","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Sci-fi"],"synopsis":"Na Kang In membuka matanya di tengah-tengah Korea Selatan, pada tahun 2024. Dia tidak ingat siapa dia atau di mana dia berada, tapi dia mengetahui dari dukungan tempur AI Jeon Ji In, di dalam tubuhnya, bahwa dia adalah anggota dari Aliansi Bumi pada tahun 2082. Dia perlu mengumpulkan informasi untuk mendapatkan kembali ingatannya dan mencari tahu mengapa dia datang ke sini… Na Kang In, yang tidak punya apa-apa selain tahu bagaimana melakukan segalanya, sedang mengalami masa sulit beradaptasi dengan Bumi!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/09/image-2024-09-19-222321712-854665-m3a2XO8z-208x300.png"},{"judul":"Bones","slug":"bones","tipe":"Manhwa","released":"Juni 27, 2023","rating":"9.00","author":"-","artist":"","status":"Ongoing","genre":["Action","Demons","Fantasy","Horror","Tragedy"],"synopsis":"Jihyung, protagonis yang berusaha menjadi ‘hunter’ demi ibunya. Tapi ibunya dicelakai hingga berada dalam kondisi vegetatif oleh para perudung. Dia mencoba untuk balas dendam, tapi dia gagal dan dikubur hidup-hidup… Ini adalah cerita tentang seorang anak laki-laki yang kehilangan segalanya berubah menjadi ‘demon’ dan memulai perburuannya.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/06/bones-805728-sgxcJYGW-200x300.jpg"},{"judul":"Blade of Winds and Thunders","slug":"blade-of-winds-and-thunders","tipe":"Manhwa","released":"April 29, 2022","rating":"7.00","author":"Yong Shin Moon","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Historical","Martial Arts","Shounen"],"synopsis":"Dongbang Mui, putra Empat Raja, Dongbang Gojin, yang disebut pendahulunya. Dengan rahasia kelahirannya, ia menggantikan kakeknya dan menjadi penenun terakhir Moorimmaeng. Ditemani oleh lengan pemburu hadiah yang tak kenal kompromi, dia dibantu oleh cheomsa doggie Saado dari pengelana pertama di dunia, dan dal am cinta Bichon-ri Yaeul, yang memeluk Soribido, dia mendengar kincir angin menuju dunia.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/04/blade-of-winds-and-thunders-563116-qWWZZyNy-221x300.png"},{"judul":"Castle","slug":"castle","tipe":"Manhwa","released":"April 14, 2021","rating":"6.2","author":"JEONG Yeon","artist":"","status":"Completed","genre":["Action","Adult","Drama","Mature","Psychological","Seinen","Tragedy"],"synopsis":"“Castle”, sindikat kejahatan mahakuasa Korea Selatan. Satu orang kembali ke Korea untuk menggulingkan benteng absolut yaitu “Castle”. Kim Shin, pembunuh Rusia kelahiran Korea bernama “Amur Tiger”. Dia kembali ke kota penuh kejahatan Hoe-Am sesuai dengan keinginan terakhir mentornya, Kang Min-Seong. Kim Shin dan rekan-rekannya mempertaruhkan nyawa mereka saat mereka menuju pertarungan terakhir …","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/castle-009481-ZElaKAjO-207x300.jpg"},{"judul":"Beethoven Reborn","slug":"beethoven-reborn","tipe":"Manhwa","released":"Maret 10, 2024","rating":"8.7","author":"Jayeong-i Woojin [Add, ]","artist":"","status":"Ongoing","genre":["Comedy","Drama","Fantasy","Shounen","Slice of Life","Supernatural"],"synopsis":"Hanya musik yang menopangku dari rasa sakit yang menjengkelkan. Andai saja aku bisa mendengarkan musikku… dengan telingaku sendiri… Bahkan ketika jiwaku sedang hancur sekalipun, aku tetap akan berdoa kepada Tuhan… dan berdoa lagi. Ludwig van Beethoven dianggap sebagai komposer terhebat dalam sejarah manusia. Aku menutup mataku seperti itu. Dan 180 tahun kemudian di Seoul. Sang Saint musik, yang dikenal sebagai seorang jenius abadi, telah terlahir kembali. Dan kemudian tiba-tiba aku mulai mendengar suara malaikat. “Dobin.. Dobin..” …","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/03/artwork-17-1-662575-AHa06W2h-210x300.jpg"},{"judul":"Bizzare Restaurant","slug":"bizzare-restaurant","tipe":"Manhwa","released":"November 5, 2022","rating":"8","author":"Mezzed K Shin Hyun Beom [Add, ]","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Shounen"],"synopsis":"Tahu busuk, durian, era surstromming sudah berakhir, pernahkah dengar? kemampuan memasak yang sangat buruk hingga bisa mati di tempat saat memakannya! tetapi kemampuannya meningkat!? tera, yang masakannya menawarkan rasa terbaik(?) di semua dimensi, melalui bantuan yoo seungwoo yang paling berani, telah datang ke bumi yang damai(?). tahan! jika kamu memakannya dan tidak mati, levelmu akan naik! dan atas namaku, lindungi bumi! ‘restoran luar biasa’ tetap buka bahkan saat dunia akan kiamat","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/11/bizzare-restaurant-416380-aB2ILAUd-210x300.jpg"},{"judul":"Baek XX","slug":"baek-xx","tipe":"Manhwa","released":"Januari 19, 2023","rating":"7.1","author":"Byeongjang, Park Tae Joon, Park Tae-joon Cartoon Company","artist":"","status":"Ongoing","genre":["Action","Drama","Martial Arts","Mature","Seinen"],"synopsis":"BaekXX Park Taejun Manhwa Company, Sergeant / Punchkick","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/01/baek-xx-783310-HlKjvrZC-207x300.jpg"},{"judul":"Compatibility Award","slug":"compatibility-award","tipe":"Manhwa","released":"September 17, 2022","rating":"7.00","author":"Kwang Togi","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Horror","Seinen","Supernatural"],"synopsis":"Belun ada","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/09/compatibility-award-148487-RKLiu76V-231x300.webp"},{"judul":"All Rounder","slug":"all-rounder","tipe":"Manhwa","released":"Oktober 14, 2021","rating":"8.5","author":"","artist":"","status":"Ongoing","genre":["Action","Fantasy","Shounen"],"synopsis":"Dunia yang penuh dengan zombie. Tapi kiamat ini… apakah pantas untuk dicoba?! [Keterampilan dapat ‘ditransfer’ dari para ahli.] Perawatan mental, konstruksi kayu, sihir surgawi, komunikasi hewan, teknik mesin, kinerja, dll. Ada banyak hal yang harus dipelajari! Sprint dari penyintas yang siap, yang pandai dalam segala hal, dimulai!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/10/all-rounder-847327-C5kaWxv8.jpg"},{"judul":"Beyond The Strong","slug":"beyond-the-strong","tipe":"Manhwa","released":"November 18, 2021","rating":"7","author":"","artist":"","status":"Ongoing","genre":["Action","Martial Arts","School Life","Slice of Life"],"synopsis":"Ji Jin-hee adalah siswa Taseseong sekolah bakat khusus asuh, seorang siswa yang memiliki sikap pengamat terhadap kekerasan sekolah. Tertidur sehari setelah minum obat yang mencurigakan. setelah hari itu dia menjadi sasaran para pengganggu dan dia mulai diganggu oleh mereka setiap hari, tetapi dia berubah menjadi ego lain Choi Ki-ryong dengan kepribadian yang aneh dan mulai mendidik para pengganggu yang mencari tahta sekolah.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/11/beyond-the-strong-552306-7ZvrlF2Z.jpg"},{"judul":"Conquer The Throne Highschool","slug":"conquer-the-throne-highschool","tipe":"Manhwa","released":"Januari 2, 2023","rating":"7.00","author":"SADO,sledgehammer","artist":"","status":"Ongoing","genre":["Action","Comedy","School Life"],"synopsis":"Throne High School, adalah sekolah menengah swasta khusus laki-laki tanpa hukum dengan orang-orang yang sangat terampil. Lee Sunwoo, seorang anak laki-laki yang dijual ke Throne High School oleh orang tuanya, pergi ke departemen siswa untuk membangun kembali klub bola basket yang hilang. “Hoo, aku tidak percaya ada orang asing yang sombong yang masuk ke departemen mahasiswa… Sudah lama.’ Kepala departemen mahasiswa menyarankan untuk menutup klub yang ada untuk membuat klub bola basket. Lee Sunwoo menerima saran tersebut dan menantang mahasiswa baru dan pemain terkuat di sekolah dengan keinginannya untuk basket.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/01/conquer-the-throne-highschool-255671-cmJRbdDX-236x300.jpg"},{"judul":"A Dragonslayer’s Peerless Regression","slug":"a-dragonslayer-s-peerless-regression","tipe":"Manhwa","released":"Maret 17, 2025","rating":"7","author":"Gon (곤), Hectopascal","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Shounen"],"synopsis":"Zeke Draker, adalah orang pertama dari keturunan langsung keluarga Dragon Slayer yang gagal untuk awakening. Memiliki bakat sebagai Healer alih-alih Swordsman, dia diusir oleh keluarganya. Saat berjuang untuk bertambah kuat, Zeke menemui akhir yang tragis. Di saat-saat kematiannya, muncul kata-kata misterius di depan matanya: Jiwa dari sesosok Elder Dragon terukir dalam tekad dia yang melawan. Kekuatan yang mutlak dan dijanjikan diaktifkan. Saat dia tersadar, dia menyadari bahwa dirinya berada di keluarga Dragon Slayer yang telah membuangnya, 20 tahun sebelumnya. “Jika aku bisa menjadi kuat, aku akan memanfaatkan hal apapun.” Dilengkapi dengan kekuatan immortal, legenda dari seorang Dragon Slayer dengan kelasnya sendiri dimulai.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/03/a-dragonslayers-peerless-regression-284393-dvBZHgzX-209x300.jpg"},{"judul":"A World of Gold to You","slug":"a-world-of-gold-to-you","tipe":"Manhwa","released":"Agustus 11, 2023","rating":"7.00","author":"레민/Remin","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","gore","Magic","Seinen"],"synopsis":"A World of Gold to You – Sekali waktu, dunia telah dibagi menjadi Kerajaan Bulan, dihuni oleh manusia, dan Kerajaan Matahari, dihuni oleh setan. Estelle, seorang ksatria Kerajaan Bulan, kehilangan keluarganya karena penyergapan dari iblis dan dijatuhi hukuman seumur hidup di pengasingan setelah terjerat dengan anak iblis misterius. Untuk bertahan hidup, dia berangkat ke menara misterius di utara bersama teman-temannya. Seorang ksatria pemalu, budak laki-laki, dan bayangan yang pernah menjadi Raja Iblis. Ini adalah kisah memikat tentang tiga orang yang memulai petualangan untuk menemukan jati diri mereka yang sebenarnya.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/08/a-world-of-gold-to-you-583262-JoDziyq2-207x300.jpg"},{"judul":"Barbarian’s Adventure In A Fantasy World","slug":"barbarian-s-adventure-in-a-fantasy-world","tipe":"Manhwa","released":"Agustus 4, 2025","rating":"7","author":"Bluesoul, Makori","artist":"","status":"Ongoing","genre":["Action","Comedy","Fantasy","Shounen"],"synopsis":"Setiap malam, ia berdoa kepada setiap dewa yang ada:\r\n “Tolong, saat aku bangun besok, biarkan aku berada di tengah dunia fantasi.”","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/08/barbarians-adventure-in-a-fantasy-world-523096-aumKj4BS-198x300.png"},{"judul":"[C]LOSER","slug":"c-loser","tipe":"Manhwa","released":"Maret 7, 2021","rating":"8.15","author":"OXASHL , Naomi Saddhadhika","artist":"","status":"Completed","genre":["Drama","Romance"],"synopsis":"Dekat dengan idola rasanya tak selalu indah.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/closer-830704-rgSFUR4B-196x300.png"},{"judul":"Chase Fortune","slug":"chase-fortune","tipe":"Manhwa","released":"Oktober 3, 2023","rating":"7.00","author":"Gyeongtaek Kwak, Seungun Han","artist":"","status":"Ongoing","genre":["Drama","Shounen"],"synopsis":"Manhwa santai yang menceritakan tentang kehidupan seseorang yang bernama Chase dia Menghasilkan keuntungan besar di pasar saham, masuk penjara, meramal nasib, dan memulai perusahaan publiknya sendiri… Hidup adalah roda keberuntungan bagi Chase Han","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/10/chase-fortune-806673-UCTwuZeR-212x300.webp"},{"judul":"A Returner’s Magic Should Be Special","slug":"a-returner-s-magic-should-be-special","tipe":"Manhwa","released":"Oktober 18, 2022","rating":"7.7","author":"Usonan","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","School Life","Shounen"],"synopsis":"Manhwa A Returner’s Magic Should Be Special yang dibuat oleh komikus bernama Jeon Sun-Wook ini bercerita tentang “Sekarang aku kembali, aku tidak akan membiarkan orang yang aku cintai mati lagi!” The Shadow Labyrinth – bencana paling mematikan yang pernah dialami umat manusia. Desir Arman, salah satu dari enam yang tersisa dari umat manusia, ada di dalam Labirin. Enam dari mereka mencoba untuk menyelesaikan level akhir Labirin tetapi akhirnya gagal, dan dunia akan berakhir. Namun, ketika Desir mengira dia akan menemui ajalnya, apa yang muncul di hadapannya adalah dunia … tiga belas tahun yang lalu ?! Desir kembali ke masa lalu, kembali ke masa ketika dia mendaftar di akademi sihir terbaik di negara itu, Havrion. Dia bersatu kembali dengan teman-temannya yang berharga, dan dia bertekad untuk mengubah masa lalu untuk menyelamatkan dunia dan orang yang dicintainya …! Tiga tahun tersisa sebelum munculnya Dunia Bayangan! Ubah masa lalu dan kumpulkan rekan-rekan yang kuat untuk menyelamatkan umat manusia!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/10/a-returners-magic-should-be-special-013893-vTUrhMo2-222x300.jpg"},{"judul":"Chronicles of Heavenly Demon","slug":"chronicles-of-heavenly-demon","tipe":"Manhwa","released":"Maret 4, 2021","rating":"8.6","author":"Il-hwang","artist":"","status":"Ongoing","genre":["Action","Fantasy","Martial Arts","Shounen","Supernatural"],"synopsis":"Penerus dari Sekte Master Tombak dan muridnya Hyuk Woon Seong dijebak mempelajari seni Iblis terlarang dan dibunuh. Kematian tak berdaya dan menyedihkan oleh orang-orang munafik dari Sekte Ortodoks. Saat Woon Seong menghadapi kematiannya, Artefak dari Tombak Master Sekte memancarkan cahaya dan memberinya kehidupan baru. Kehidupan sebagai Nomor 900, peserta pelatihan Kultus Iblis! Dua identitas, Sekte Ortodoks dan Kultus Setan. Tapi tujuannya satu. Balas dendam! Menerima takdirnya dan mengingat dendamnya, Woon Seong berlatih seni bela diri Dan waktu balas dendamnya perlahan mendekat…. Ambil alih Kultus Iblis dan hukum orang-orang munafik dari Sekte Ortodoks! Kisah balas dendam Nomor 900, Woon Seong berkembang dalam tugas hidup dan mati.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/chronicles-of-heavenly-demon-996485-eVwLvVaj-222x300.png"},{"judul":"990k Ex-Life Hunter","slug":"990k-ex-life-hunter","tipe":"Manhwa","released":"Mei 18, 2021","rating":"7.00","author":"백도선,침략자","artist":"","status":"Ongoing","genre":["Action","Adventure","Comedy","Fantasy","Leveling","Manhwa","Reincarnation"],"synopsis":"Pemburu peringkat-F biasa, Gang HyeonJoon, selalu berdoa memohon kekuatan untuk mengubah hidupnya. Suatu hari, doanya terkabul … [Pedang Suci Terakhir memuji keberanianmu.] [Master dalam Bayangan adalah ….] “Cukup! Ini terlalu berlebihan!” 990 ribu kehidupan lampau muncul di depannya!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/05/16-115500-2MHKpOgj-207x300.jpeg"},{"judul":"Bless","slug":"bless","tipe":"Manhwa","released":"April 12, 2021","rating":"6.3","author":"Yoon Chun","artist":"","status":"Ongoing","genre":["Action","Adventure","Martial Arts"],"synopsis":"Yidun, bocah yang tiba-tiba jatuh dari langit yang hanya mengingat dua hal : namanya dan fakta bahwa dia akan menghilang jika dia tidak menemukan 5 harta karun tersembunyi untuk mengalahkan raja iblis, dengan 79 hari tersisa untuk menemukan harta karun Yidun masih tidak bisa mengabaikan orang yang membutuhkan bantuan. Apakah dia bisa mengalahkan raja iblis di waktu kurang dari 80 hari dan menghindari kematiannya?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/bless-438296-HrHBlyZZ-214x300.jpg"},{"judul":"Beautiful Legends","slug":"beautiful-legends","tipe":"Manhwa","released":"April 6, 2021","rating":"7.5","author":"Redice Studio","artist":"","status":"Ongoing","genre":["Action","Adventure","Drama","Fantasy","Shounen"],"synopsis":"Beautiful Legends, sebuah unit yang dianggap legendaris. Seorang gadis tertentu yang mendapatkan kehidupan abadi dengan sebuah lukisan, seorang praktisi seni bela diri, manusia serigala, Frankenstein dan vampir, berperang melawan penjahat yang mengancam umat manusia karena alasan pribadi dan profesional.Artist/tukang gambar dari manhwa Solo Leveling, REDICE (Jang Sung-Lak).","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/beautiful-legends-860480-slZ58D25-248x300.jpg"},{"judul":"Abide in the Wind","slug":"abide-in-the-wind","tipe":"Manhwa","released":"Maret 9, 2021","rating":"7.7","author":"Shin Wol","artist":"","status":"Ongoing","genre":["Action","Adventure","Drama","Fantasy","Romance","Shounen"],"synopsis":"Reana hidup dengan damai di sebuah kota kecil jauh di dalam provinsi Earthside Kingdom.  Dia memiliki ayah yang penyayang, pekerjaan yang menarik, dan kepercayaan seperti anak kecil pada orang-orang di sekitarnya… Tapi segalanya berubah setelah dia bertemu naga yang sekarat.  Dia adalah yang terakhir dari jenisnya dan memiliki kekuatan yang dapat mengguncang dunia – sungguh suatu berita menarik yang luar biasa bagi orang lain!  Dan Reana dilemparkan ke dalam kekacauan, ke dalam pencarian jawaban yang putus asa – sementara perburuan setelahnya dimulai.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/abide-in-the-wind-774443-28EiA3oe-207x300.jpg"},{"judul":"Counter Cube","slug":"counter-cube","tipe":"Manhwa","released":"Juli 1, 2021","rating":"6.5","author":"Ghost Boat Ju Shin [Add, ]","artist":"","status":"Ongoing","genre":["Action","Sci-fi","Supernatural"],"synopsis":"Bagaimana jika ada dunia lain selain lucid dream?  Di situlah mereka yang telah dicuri mimpinya berkumpul.  Do Shi-Eon, yang melarikan diri dari kenyataan dengan lucid dreaming, kehilangan mimpinya dan jatuh ke dalam ruang ‘Shared Dream.’  Sekarang dia harus berjuang untuk merebut kembali mimpinya.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/07/counter-cube-552534-gn5V2mX3-186x300.jpg"},{"judul":"Alpha","slug":"alpha","tipe":"Manhwa","released":"Maret 16, 2021","rating":"6.5","author":"Bugyeum","artist":"","status":"Completed","genre":["Action","Drama","Sci-fi","Shounen"],"synopsis":"Seorang agen Alpha, yang tidak merasakan emosi, diberi misi rahasia. Cerita spin-off buat para fans yang kangen “Noblesse”!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/alpha-824302-pWy8r1pq-207x300.jpg"},{"judul":"Death King Karnak","slug":"death-king-karnak","tipe":"Manhwa","released":"September 1, 2024","rating":"7.00","author":"Julan, Lim Kyung-Bae","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Shounen"],"synopsis":"“Memang apa yang bisa dilakukan dengan tubuh yang hanya tulang seperti ini?” Karnak, manusia yang sudah mendapatkan segalanya dari sihir terlarang “Necromancy,” dan menjadi penguasa kematian. Namun, karena tubuhnya hanya tersisa tulang, dia merindukan “kenikmatan” yang dia rasakan ketika masih menjadi manusia… “Aku akan memutar kembali waktu!” Setelah melakukan penelitian yang panjang, akhirnya dia berhasil menggunakan Space-Time Regression Magic, dan kembali ke masa lalu bersama orang kepercayaannya, Baros. “Hmm… tuan, tampaknya masa lalu sudah berubah, ya?” Sang Penguasa Kematian kembali ke masa lalu dengan tujuan untuk mengubah segalanya!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/09/death-king-karnak-1-463358-IE65Bdqp.webp"},{"judul":"Cerebral Renal Failure","slug":"cerebral-renal-failure","tipe":"Manhwa","released":"April 19, 2021","rating":"7","author":"ARC, Cho Seung-yeop, Kim Do-hoon","artist":"","status":"Ongoing","genre":["Action","Fantasy"],"synopsis":"Dia adalah pahlawan yang merobohkan kuda berdarah neraka yang menghancurkan hutan, tetapi terbunuh oleh pengkhianatan tujuh generasi yang tidak ingin menjadi pahlawan. Namun, ia terlahir kembali sebagai Baekmu-gun, yang dulunya merupakan favorit Gerbang Baekga-gummun, berkat kekuatan prinsip penyelamatan sembilan kali. “Lalu musuh masih hidup?” Balas dendam dan Moorimhaeng terakhirnya adalah puisi untuk mengakhiri hubungan!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/cerebral-renal-failure-943234-AmWZTdgO-168x300.jpeg"},{"judul":"Battle of Mosol","slug":"battle-of-mosol","tipe":"Manhwa","released":"Januari 22, 2025","rating":"7","author":"Jinja","artist":"","status":"Ongoing","genre":["Comedy","Drama","Josei","Romance"],"synopsis":"Mendapatkan cinta sekaligus hadiah 500 juta won! Tiga wanita berusia 30 tahun memulai taruhan untuk keluar dari status *single*, dengan hadiah besar 500 juta won. Ada Gong Jurim, si Putri tanpa Pangeran; Kang Seon-Ah, si Kolektor barang tak berguna; dan Kim Chaeyul, yang teguh menjaga kesucian sebelum menikah. Kira-kira siapa ya yang akan keluar sebagai pemenang dari pertarungan para wanita single ini? Stay tunned darling~!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/01/image-2025-01-22-072314034-205701-NhRf8PaJ-225x300.png"},{"judul":"Change Guy","slug":"change-guy","tipe":"Manhwa","released":"Mei 6, 2021","rating":"7.6","author":"SON Eun Ho","artist":"","status":"Ongoing","genre":["Action","Comedy","Martial Arts","School Life","Shounen","Supernatural"],"synopsis":"Nature vs Nuture. Ketika seorang kutu buku bertukar tubuh dengan anak laki-laki paling tangguh di sekolah!! Tuji dan Usoo telah bertukar…tubuh mereka! Setelah menjadi subjek eksperimen ilmuwan gila dengan penemuan terbarunya – Teleporter Kuantum – tubuh mereka tertukar, menyisakan pikiran dan jiwa mereka yang utuh. Usoo, yang pernah jadi murid teladan harus menghadapi kehidupan Tuji, seorang remaja berbahaya. Tidak pernah memiliki musuh dalam hidupnya, sekarang dia harus berhadapan dengan daftar saingan Tuji, namun akankah sikapnya yang baik dan lemah lembut menangkal saingan-saingannya? Atau akankah kelangsungan hidup menentukan masa depannya? Akankah dia menjadi petarung tangguh yang cocok dengan eksterior barunya?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/05/change-guy-822942-e16LLool-208x300.jpg"},{"judul":"Deor","slug":"deor","tipe":"Manhwa","released":"April 17, 2021","rating":"7","author":"J.Oori","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Shounen"],"synopsis":"Pangeran muda, Deor, adalah orang buangan di negerinya sendiri. Terlahir tanpa kemampuan untuk menggunakan sihir – kondisi langka yang menandakan dia tidak kompeten – dia mengandalkan kecerdasan dan keuletannya untuk membuktikan kesalahan mereka yang percaya bahwa dia tidak cocok untuk mahkota. Namun, dengan iblis dan konspirasi mematikan yang mengancam keberadaan umat manusia, Deor harus melindungi kerajaan yang mengejeknya. Akankah dia mampu mengalahkan iblis dan mengamankan posisinya sebagai raja?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/deor-656986-sejAgiqy-189x300.jpg"},{"judul":"Age of Barbarism","slug":"age-of-barbarism","tipe":"Manhwa","released":"Oktober 21, 2021","rating":"7","author":"SHIN Eui-cheol","artist":"","status":"Ongoing","genre":["Action","Drama","School Life","Shounen"],"synopsis":"Tidak seperti hidup saya, di mana saya hanya pergi tanpa masa lalu atau masa depan, pria yang tampaknya memiliki segalanya sebagai siswa teladan dari keluarga kaya ini adalah pasangan yang bahkan tidak saya ketahui keberadaannya ketika saya dibesarkan di panti asuhan.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/10/age-of-barbarism-820280-yWa51pdk-207x300.jpg"},{"judul":"Around Forty","slug":"around-forty","tipe":"Manhwa","released":"Mei 8, 2025","rating":"7","author":"Sukuns","artist":"","status":"Ongoing","genre":["Drama","Seinen"],"synopsis":"Ketika Hyun-sung-min berusia empat puluh tahun, dia melihat sekelilingnya dan menyadari bahwa dia sendirian. Dihadapkan dengan krisis dalam hidupnya dan di tempat kerja, dia memutuskan untuk berjuang menemukan kebahagiaan sejati. Tidak Ada Kata Terlambat!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/05/around-forty-897980-aszA0g6L-207x300.webp"},{"judul":"21st Century Retrogression","slug":"21st-century-retrogression","tipe":"Manhwa","released":"Januari 31, 2024","rating":"7.00","author":"-","artist":"","status":"Ongoing","genre":["Action","Adventure"],"synopsis":"Ha Pung Gae, biksu tua Tao yang hidup sejak akhir Dinasti Joseon, mencapai terobosan tak terduga dalam gerakan kontra-retrogresi. Meskipun sukses, ia hanya mempunyai sisa umur sekitar sepuluh tahun. Untuk menghindari kematian, dia sekarang harus memulai perjalanan untuk mencapai keabadian!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/01/image-2024-01-31-073209738-435652-PqR39UZ4-214x300.png"},{"judul":"A Story Of Heroes","slug":"a-story-of-heroes","tipe":"Manhwa","released":"Maret 8, 2021","rating":"5.8","author":"Choi Mir","artist":"","status":"Ongoing","genre":["Action","Adventure","Martial Arts"],"synopsis":"Manhwa A Story Of Heroes Bahasa Indonesia ini bertumpu pada seorang remaja konyol pencuri ulung bernama Yushin yang memiliki segel aneh di punggungnya. Pemuda dengan kemampuan silat angin-anginan karena tenaga dalamnya kadang muncul kadang tidak ini tidak menyangka bahwa dia adalah putra dari pemimpin persilatan paling bengis saat itu, Dumyo, ketua partai Kwimun sekaligus orang yang paling menginginkan kematiannya. Atas bantuan pertapa Techun yang mengajari Yushin cara mengendalikan tenaga liarnya, Yushin berusaha untuk mencegah ambisi ayahnya yang ingin mengendalikan seluruh dunia persilatan dengan cara melenyapkan seluruh tokoh-tokohnya.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/a-story-of-heroes-094237-srmmvyQg-208x300.jpg"},{"judul":"Death Speed","slug":"death-speed","tipe":"Manhwa","released":"April 30, 2024","rating":"7.00","author":"Bikramjit Elangbam","artist":"","status":"Ongoing","genre":["Action","Drama","Sports"],"synopsis":"Lemba, yang pernah terisolasi, mencari kebebasan dalam parkour, di tengah-tengah kekerasan geng, dan belenggu masa lalu dan masa kini. Teman dan musuh baru bermunculan, semuanya dalam dunia kejar-kejaran yang berisiko tinggi, menambah tantangannya. Kedamaian yang ia dambakan berada di ambang gangguan.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/04/death-speed-055535-5Yncgm1p-187x300.webp"},{"judul":"All My Alter Egos Are Tycoons","slug":"all-my-alter-egos-are-tycoons","tipe":"Manhwa","released":"September 25, 2024","rating":"7","author":"LICO","artist":"","status":"Ongoing","genre":["Action","Fantasy","Shounen"],"synopsis":"Pria muda, Han Sunghyun, kehilangan keluarganya dalam serangan superhuman tanpa pandang bulu. Selagi hidup menyendiri karena trauma, suatu hari, dia membangkitkan kemampuan untuk mengendalikan avatar di tempatnya! “Apa?! Aku bisa mengirim avatar berburu ke dunia lain yang berbahaya selagi aku santai-santai di rumah, hanya fokus memperkuat kekuatanku?!”\r\n Bersama dengan tumbuh pesat avatarnya, menyebrangi dimensi, ras, dan profesi, Hang Sunghyun mulai memburu superhuman yang menyalahgunakan kekuatan mereka!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/09/tycoonsz-999120-R0dgyWVH-200x300.jpg"},{"judul":"Cystic Story (Call The Spear)","slug":"cystic-story-call-the-spear","tipe":"Manhwa","released":"April 29, 2021","rating":"7","author":"Kim Soon-Tae","artist":"","status":"Ongoing","genre":["Action","Fantasy"],"synopsis":"San-gun, pemilik gunung yang terlahir kembali sebagai harimau dan hidup sebagai roh. Seorang gadis datang ke depan pasukan gunung yang hidup dalam damai. Gadis yang tiba-tiba berkata dia akan membawamu sebagai seorang Jia. Pendaki gunung yang merepotkan mencoba mengusirnya, tetapi dia tidak punya tempat untuk kembali. Seorang pria gunung yang akhirnya memutuskan untuk mengambil kembali seorang gadis. Dan ada banyak ancaman baginya.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/cystic-story-call-the-spear-319158-cF8O3EsU-223x300.jpg"},{"judul":"Dark Hole: Another Survivor","slug":"dark-hole-another-survivor","tipe":"Manhwa","released":"Oktober 19, 2021","rating":"7","author":"","artist":"","status":"Ongoing","genre":["Action","Horror"],"synopsis":"Dark Hole: Another Survivor adalah Manga/Manhwa/Manhua dalam bahasa (Inggris/Raw), seri Manhwa ditulis oleh Memperbarui Komik Ini Tentang","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/10/dark-hole-027363-uYnaiWLZ-206x300.jpeg"},{"judul":"Alone Like The Wolf","slug":"alone-like-the-wolf","tipe":"Manhwa","released":"Oktober 7, 2022","rating":"7.00","author":"?","artist":"","status":"Ongoing","genre":["Action","Drama","Historical"],"synopsis":"Original Webtoon:Naver Webtoon, Naver Series","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/10/alone-like-the-wolf-967062-ozZLAFmr-231x300.jpg"},{"judul":"Book Eater","slug":"book-eater","tipe":"Manhwa","released":"Juli 24, 2021","rating":"7","author":"Mackenro","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Harem","School Life","Shounen","Supernatural"],"synopsis":"Seorang siswa di akademi penyihir dengan sedikit bakat, tetapi semua pengetahuan yang diharapkan dari seorang sarjana.  Dia segera mendapatkan kekuatan untuk mendapatkan keterampilan dari buku secara langsung.  Dia adalah pemakan buku.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/07/book-eater-331657-kVIJUCUP-222x300.jpg"},{"judul":"9th Class Sword Master","slug":"9th-class-sword-master","tipe":"Manhwa","released":"Mei 13, 2023","rating":"7.00","author":"ARC,윤소함,이형석","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy"],"synopsis":"Tahun 237 Kalender Kekaisaran.\r\n Pada akhir ‘perang Trust’ untuk melindungi umat manusia dari ‘Korupsi’ yang merajalela…\r\n Sang Sword Saint, Karryl McGovern, dihadapkan dengan pengkhianatan oleh Oliver, yang merupakan teman baiknya sekalligus Kaisar dari negara di mana dia mengabdikan dirinya.\r\n Setelah membunuh sang Kaisar, Karryl kembali ke masa lalu untuk memperbaiki semua yang terjadi.\r\n Dan kini, aku mendapatkan kekuatan yang tidak pernah kudapatkan di kehidupanku sebelumnya, yakni Sihir dan Swordmanship.\r\n Aku akan mengubah masa depan dengan kedua kemampuan ini!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/05/9th-class-sword-master-050037-hlt5Ixoe.jpeg"},{"judul":"Ashen Oreum","slug":"ashen-oreum","tipe":"Manhwa","released":"Juli 28, 2022","rating":"7.00","author":"Yoo Hyung-seok","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Horror","Mature"],"synopsis":"Dunia di ambang kepunahan karena invasi alien, Han Oreum, yang terus menjalani kehidupan militer sambil membesarkan putrinya Goo Cho-rok sendirian, diserang oleh makhluk aneh selama operasi penyelamatan sipil. Dia buru-buru mengevakuasinya. putrinya dan para penyintasnya dan melawan makhluk mengerikannya, tetapi menunggunya untuk kembali hidup-hidup adalah mayat anak-anaknya yang dibunuh secara brutal…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/07/ashen-oreum-440519-rsq6h6aU-207x300.webp"},{"judul":"Baby Tyrant","slug":"baby-tyrant","tipe":"Manhwa","released":"April 8, 2023","rating":"8.9","author":"Lee Huin","artist":"","status":"Ongoing","genre":["Fantasy","Romance"],"synopsis":"Keluarga yang harmonis dan orang tua yang penuh kasih sayang yang tidak bisa saya miliki. Ketika saya membuka mata saya setelah akhir yang menyedihkan, saya telah bereinkarnasi. Apalagi sebagai Putri Kekaisaran! Tapi negara ini sedikit aneh! Ayah seperti kakak laki-laki, dan kakak laki-laki sejati yang tampaknya memiliki ekor… Mereka datang dan mengganggumu kapan saja! Tapi aku tidak butuh cinta keluarga! Aku akan diam dalam hidup ini dan kemudian aku pergi! Ya! Jelas itu tujuan saya! Bukankah hutan istana kekaisaran akan diberikan, bukankah kastil akan diberikan, sekarang kamu bahkan akan memberiku sebuah negara ketika aku berumur satu tahun?! Negara ini gila!!”Tidak! Aku tidak bisa melepaskan hidupku yang tenang seperti ini!”","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/04/image-2023-04-08-121034482-904275-PPcbqC8W.png"},{"judul":"Checkpoint","slug":"checkpoint","tipe":"Manhwa","released":"Mei 14, 2021","rating":"7.8","author":"Eunso, Songga","artist":"","status":"Ongoing","genre":["Supernatural"],"synopsis":"Bagaimana jika ada titik aman dalam hidup saya? Seorang pria yang memutar waktu beberapa ratus kali per hari.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/05/checkpoint-018381-gCEDwVDr-202x300.png"},{"judul":"Children of the Rune","slug":"children-of-the-rune","tipe":"Manhwa","released":"Juli 1, 2024","rating":"8.00","author":"Jeon Minhee","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy"],"synopsis":"Oh, anak muda, pastikan kamu bertahan hidup! Setelah pamannya menyebabkan keruntuhan keluarganya, satu-satunya yang dimiliki Boris muda hanya pedang keluarga, “Winterer.” Namun, siapa yang sangka kalau harta ini akan menyebabkan krisis yang lain? Setiap kali orang-orang mengincar “Winterer,” hari Boris menjadi tambah dingin seperti musim dingin… perjalanan Boris dimulai. Demi bertahan hidup. Demi melindungi pedang keluarga. Apa yang menunggunya dalam perjalanannya? Rahasia apa yang disimpan pedang musim dingin “Winterer?” Post Views: 95","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/07/children-of-the-rune-371607-eChnzsh7-210x300.jpeg"},{"judul":"Boundless Necromancer","slug":"boundless-necromancer","tipe":"Manhwa","released":"Desember 18, 2022","rating":"7.00","author":"-","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Magic","Manhwa","Martial Arts"],"synopsis":"[ Dari Studio Solo Leveling] Aku tak pernah berpikir aku bisa menjadi seorang hunter. Aku tak pernah berpikir aku mampu.Tapi bukan itu masalahnya.「 ‘Tower of Trials’ telah memilih semua kandidat yang cocok dari Bumi. 」 「 Silakan pilih tingkat kesulitan Anda. 」 「 Hadiah yang Anda dapatkan akan berbanding lurus dengan tingkat kesulitan yang Anda pilih. 」Aku baru saja diberi kesempatan.Kesempatan yang spesial.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/12/boundless-necromancer-545233-lwd6Jidr-210x300.webp"},{"judul":"Black Haze","slug":"black-haze","tipe":"Manhwa","released":"April 12, 2021","rating":"8.7","author":"Yong Yong","artist":"","status":"Ongoing","genre":["Action","Comedy","Drama","Fantasy","School Life","Shounen","Supernatural","Tragedy"],"synopsis":"Setelah kegagalan di sebuah misi, pemeran utama yang peragu, Rood, dikirimkan ke sekolah sihir yang terkenal, Helios. Di sini, dia harus melindungi anak seorang tokoh penting yang mengalami masa sulit di sekolah.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/black-haze-788835-QotH6mR3-192x300.jpg"},{"judul":"Brother, Am I Cute?","slug":"brother-am-i-cute","tipe":"Manhwa","released":"April 15, 2025","rating":"7.00","author":"GeulyuÂ [Add, ]Lee Ji-anÂ [Add, ]","artist":"","status":"Ongoing","genre":["Drama","Fantasy","Slice of Life"],"synopsis":"Cerita tentang seorang kakak yang bersusah payah merawat adik kecilnya setelah kehilangan kedua orang tua mereka karena kecelakaan. Grafiknya bagus coyy","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/04/brother-am-i-cute-236793-qaRTAVFM.jpg"},{"judul":"Ark The Legend","slug":"ark-the-legend","tipe":"Manhwa","released":"Desember 21, 2022","rating":"7.00","author":"Hwang Juyeong (Soy Media)Â [Add, ]Yoo Seong (II)","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy"],"synopsis":"Setelah berdiri di puncak permainan, “Dunia Baru”, Ark, alias Kim Hyeonwoo, menghabiskan hari-hari yang membosankan sebagai penasihat dan sutradara. Suatu hari, dia mendengar dari NIS bahwa Lucifer, seorang kecerdasan buatan yang merupakan saingannya di Dunia Baru, telah melarikan diri ke dunia nyata. Lucifer, yang menduduki generator nuklir secara ilegal, mengundang Ark ke game luar angkasa baru, ‘Galaxian’. [Pengguna Ark dari Dunia Baru harus berpartisipasi dalam kompetisi ini.] Ark, pemain terkuat di Dunia Baru, memasuki permainan untuk menghentikan Lucifer… [Ketahanan belati paduan telah mencapai batasnya.] [Aku kehilangan belati paduan Aku .] Ark kehilangan satu-satunya barang miliknya dan terjebak dalam tutorial. Kehidupan newbie luar angkasa tidak semudah yang kalian pikirkan, bisakah Ark bertemu Lucifer?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/12/ark-the-legend-152708-4jwsU6ih.webp"},{"judul":"Cosmic Heavenly Demon 3077","slug":"cosmic-heavenly-demon-3077","tipe":"Manhwa","released":"Agustus 22, 2024","rating":"7.00","author":"Noksaek Yeowoo","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Martial Arts","Sci-fi","Shounen"],"synopsis":"Setelah bertahun-tahun yang tak terhitung jumlahnya, Iblis Surgawi yang tersegel di dalam Gunung Tai akhirnya terbangun, hanya untuk mengetahui bahwa umat manusia telah lama meninggalkan Bumi yang penuh radiasi dan kini menjelajahi pelosok galaksi.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/08/cosmic-heavenly-demon-3077-714339-ix7Vso0i.webp"},{"judul":"Descent of the Predecessor","slug":"descent-of-the-predecessor","tipe":"Manhwa","released":"Mei 10, 2023","rating":"7.00","author":"Tuniya","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Shounen"],"synopsis":"Mitos dan legenda yang disegel telah kembali menjadi kenyataan. Dunia di mana semua dewa dan naga dilepaskan, dan setan dan setan masuk kembali. kebangkitan manusia. munculnya seorang pahlawan. Era baru mitologi telah dimulai. Kisah ini adalah narasi tentang perang dan cinta para pahlawan yang hidup di zaman baru mitos, atau mungkin mitos baru.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/05/descent-of-the-predecessor-588217-ABM62Do8.jpg"},{"judul":"Dark Mortal","slug":"dark-mortal","tipe":"Manhwa","released":"Oktober 26, 2021","rating":"8.8","author":"Lee JongHyeok","artist":"","status":"Ongoing","genre":["Action","Psychological","School Life","Supernatural"],"synopsis":"Gangnam kehilangan orangtuanya akibat kebakaran serta menjadi buta karena kecelakaan tersebut. Dia tidak bisa melihat apapun selain halusinasi bernama Kkamjang. Apakah Kkamjang cuma sebuah halusinasi ataukah lebih dari itu?\r\n “Lukamu, kedua matamu, dan … bahkan kekuatanmu! Aku akan ubah semuanya untukmu.”","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/10/dark-mortal-391427-lzDFd6t7-214x300.jpg"},{"judul":"Deadly VS Romance (Lethal Romance)","slug":"deadly-vs-romance-lethal-romance","tipe":"Manhwa","released":"Maret 27, 2022","rating":"7.00","author":"Grrr","artist":"","status":"Ongoing","genre":["Action","Comedy","Josei","Martial Arts","Romance","School Life"],"synopsis":"Seorang wanita yang seperti karakter manhwa seni bela diri “Yubi”. Seorang pria yang seperti karakter shoujo manhwa “Shin-woo”. Keduanya yang terbiasa hidup dalam genre mereka sendiri tidak akan mudah jatuh cinta satu sama lain! Akankah mereka dapat mencapai akhir yang bahagia sesuai dengan standar manhwa ?!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/03/deadly-vs-romance-lethal-romance-253698-Frtsym0E-201x300.png"},{"judul":"ARK (Taeha)","slug":"ark-taeha","tipe":"Manhwa","released":"Maret 24, 2021","rating":"7.00","author":"Meteor","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy"],"synopsis":"Hyunwoo, seorang pekerja paruh waktu yang menganggur, sedang berjuang dengan kehidupan sehari-harinya.  Dengan satu-satunya setelan kuatnya adalah bermain game, dia berjuang untuk dipekerjakan dan mendapatkan pekerjaan di perusahaan besar tampak seperti mimpi yang tidak akan pernah menjadi kenyataan.  Namun, suatu hari dia menerima kesempatan untuk mengubah hidupnya!  Wawancara kerja di pengembang game realitas virtual terbesar yang pernah ada, Global Exus, adalah melalui game ?!  Dengan ketidakhadiran ayahnya sejak masa kanak-kanak, ibunya yang sakit, dan kemiskinan mereka yang parah;  ini seperti kesempatan sekali seumur hidup.  Hanya berbekal sifat tangguh, Hyunwoo memasuki <Dunia Baru> dan memulai penaklukannya!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/ark-480527-VdtZuD6g-203x300.jpg"},{"judul":"An Ha Muin","slug":"an-ha-muin","tipe":"Manhwa","released":"Desember 8, 2021","rating":"7","author":"Kang Taesan","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Historical","Martial Arts","Shounen"],"synopsis":"Yong Cheon Sang dari keluarga Yongcheonsega, tidak bermaksud untuk mewarisi generasi baru dengan pernikahan, tetapi ketika pernikahan dilakukan dengan paksa, ia melarikan diri dengan semua artikel yang berisi harta yang dapat menghidupkan kembali seorang penyihir. Setahun setelah melarikan diri dari rumah, Yongcheon-sang meminjam uang dari artikelnya untuk mengembangkannya dengan menyerap kekuatan bayangan, dan sementara itu, ia mendapat batu darah yang telah diturunkan selama bertahun-tahun. Namun, semuanya dihancurkan oleh sekte setan yang bertujuan untuk harta sihir berusia seribu tahun… ini Yong Cheon Sang marah kekuatan bloodstone dan memutuskan untuk menilai wicked yang jahat","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/12/ahm251121-933970-MhQsJPwh-212x300.webp"},{"judul":"Demon Cage","slug":"demon-cage","tipe":"Manhwa","released":"Juni 18, 2024","rating":"7.00","author":"Decadent Dragon 阅文漫画","artist":"","status":"Ongoing","genre":["Action","Adventure","Drama","Sci-fi","Seinen"],"synopsis":"Ini adalah Game Underground tanpa perlindungan apa pun! Tempat ini dipenuhi oleh sekelompok orang gila yang mengejar kekuasaan, harta, dan kehidupan… Tokoh utama Qin Ran, yang hampir mati, memilih untuk memasukinya dengan tegas – demi kesempatan untuk hidup!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/06/demon-cage-644724-BXj7qC7A.jpg"},{"judul":"Cell","slug":"cell","tipe":"Manhwa","released":"Mei 6, 2021","rating":"6.5","author":"강형규","artist":"","status":"Ongoing","genre":["Action","Comedy","School Life","Supernatural"],"synopsis":"Kekuatan super tak terduga tiba-tiba datang pada suatu hari.  Wi Sang-Woo, seorang remaja muda dengan masa depan yang suram memperoleh kekuatan yang tidak berguna!  Tapi, apakah itu akan tetap tidak berguna?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/05/cell-498567-CLzVNeHE.jpg"},{"judul":"Debuff Master","slug":"debuff-master","tipe":"Manhwa","released":"April 19, 2024","rating":"7","author":"Dam Hwa Gong","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Shounen"],"synopsis":"Aku didorong ke tepi tebing, hanya ada keputusasaan yang menungguku.\r\n “Aku sudah lama memperhatikanmu.”\r\n Hidden NPC Deus Level 999!\r\n [Apa Anda ingin menjadi murid Hidden NPC, Deus?]\r\n [YA!]\r\n Begitulah caraku menjadi murid Hidden NPC!\r\n “Bunuh mereka dalam satu pukulan. Itu tidak akan terlihat keren jika kau harus memukulnya dua kali, jadi harus dalam satu pukulan.”\r\n Aku terlahir kembali sebagai makhluk yang membunuh musuhku dalam satu serangan…\r\n Ayo!\r\n Aku hanya membutuhkan satu pukulan!\r\n Aku adalah Debuff Master.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/04/debuff-master-976291-JObcGdh3.jpeg"},{"judul":"Demon Lord (Demon King)","slug":"demon-lord-demon-king","tipe":"Manhwa","released":"Juli 6, 2024","rating":"7.00","author":"요도 김남재","artist":"","status":"Ongoing","genre":["Action","Adventure","Martial Arts"],"synopsis":"Perang besar Ortodoks-Unortodoks yang membelah dunia murim berakhir dengan kemenangan Kultus Demonic. Meski Kultus Demonic mendominasi, pewaris Kultus Demonic dibunuh sebagai bagian dari rencana besar, dan kakak dari sang pewaris kembali dari bayangan untuk membalaskan dendam. Putra sulung Kultus Demonic, Hyuk Ryeonhwi adalah orang yang selamat dari Pulau Purple Cloud, tempat yang dikenal sebagai tanah kematian. Dia menyusup ke dalam fasilitas pelatihan tertinggi Kultus Demonic untuk mencari tahu rencana busuk musuh… dan dia bertemu dengan master murim tersembunyi dari faksi ortodoks, Bi Seol. Mereka berdua saling membantu dan menumbuhkan perasaan yang spesial seiring berjalannya waktu… Dengan ini, dimulailah dominasi Hyuk Ryeonhwi, orang yang nantinya akan dijuluki Raja Iblis. Post Views: 427","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/07/demon-lord-demon-king-465014-t493QGk9.jpg"},{"judul":"Destined Murderer","slug":"destined-murderer","tipe":"Manhwa","released":"Agustus 12, 2025","rating":"6.2","author":"Yulyeong-ai","artist":"","status":"Ongoing","genre":["Drama","Mystery","Psychological","Seinen","Supernatural"],"synopsis":"Number is not your average serial killer. Equipped with the ability to identify future murderers, Number takes the law into his own hands. He believes in ridding the world of destined killers. Simple, right? One day, he runs into Jihyeon, whose number changes constantly as she develops a special power of her own. Will the two work together to eliminate would-be murderers? Or will Jihyeon’s very existence threaten Number’s moral compass?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/08/destined-murderer-394405-IO8TMY8m-207x300.jpg"},{"judul":"By the Way, Dragon Mistress!","slug":"by-the-way-dragon-mistress","tipe":"Manhwa","released":"April 27, 2021","rating":"6.8","author":"Young Hyun","artist":"","status":"Ongoing","genre":["Fantasy","Romance","Shoujo"],"synopsis":"Meskipun ia telah kehilangan keluarganya pada usia muda, melalui bantuan Duchess Orleans dan Kaisar, Karl tumbuh dengan sangat baik. Tetapi pada jamuan makan malam, Karl hadir untuk memberi tahu Duchess tentang kata-kata bermakna Kaisar, sebuah ledakan yang dipertanyakan terjadi. Duchess, apa identitasmu yang sebenarnya?!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/by-the-way-dragon-mistress-596699-vfLKCTC1-214x300.jpg"},{"judul":"Clever Cleaning Life Of The Returned Genius Hunter","slug":"clever-cleaning-life-of-the-returned-genius-hunter","tipe":"Manhwa","released":"Juli 11, 2022","rating":"7.00","author":"Moonbeat","artist":"","status":"Ongoing","genre":["Adventure","Fantasy","Game"],"synopsis":"Kim Jun-Woo, hunter jenius peringkat SSS pertama di dunia.Dia adalah pengguna kemampuan yang luar biasa, tetapi kepribadiannya yang mengerikan menyebabkan masalah dengan reputasinya.Di tengah kesulitannya, dia diserang dan dibunuh oleh kelompok tak dikenal.Dan ketika dia membuka matanya, dia telah kembali ke masa lalu 10 tahun yang lalu.Meskipun ia mencoba menjadi pemburu lagi dan menaikkan pangkatnya, semua keterampilannya disegel oleh karma kehidupan sebelumnya.Agar itu bisa dirilis, dia harus bekerja sebagai ‘Pembersih Dungeon’, yang terkenal sangat tangguh di industri ini?!Tapi pembersih ini, dia berbeda!Tidak hanya monster—pemburu yang merepotkan, atasan hanya mengambil posisi setelah mereka dipekerjakan karena nepotisme, dan bahkan orang-orang yang akan menjadi rekan kerja dengannya.Dia membuat kekacauan total untuk membersihkan semuanya.Mantan pemburu, yang lebih kuat dari pemburu saat ini, dan pembersihan gilanya dimulai!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/07/clever-cleaning-life-of-the-returned-genius-hunter-420399-V7Rm0FXh-207x300.jpg"},{"judul":"A World-Class Walkthrough","slug":"a-world-class-walkthrough","tipe":"Manhwa","released":"Januari 8, 2023","rating":"8.2","author":"Changwaeng","artist":"","status":"Ongoing","genre":["Action","Fantasy"],"synopsis":"Karakter utama, Kim Kyung-Sam, adalah seorang yatim piatu yang sedang mempersiapkan ujian pegawai negeri sambil bekerja paruh waktu di sebuah toko serba ada.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/01/a-world-class-walkthrough-193x278-836747-L46ecGkl.jpg"},{"judul":"Birth of Evil","slug":"birth-of-evil","tipe":"Manhwa","released":"April 12, 2021","rating":"6","author":"Now","artist":"","status":"Ongoing","genre":["Action","Adventure","Comedy","Fantasy","Shounen"],"synopsis":"Seorang penyihir yang ingin menghancurkan dunia, Agne. Demi ambisinya itu dia memanggil Raja Iblis dari Abyss. Tapi bukannya mengakhiri dunia, Raja iblis tersebut malah melakukan perbuatan yang sebaliknya.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/birth-of-evil-956637-HsbUeeMF-211x300.jpg"},{"judul":"Dark and Light Martial Emperor","slug":"dark-and-light-martial-emperor","tipe":"Manhwa","released":"Januari 4, 2024","rating":"8.30","author":"백준, VICTOR, 현임","artist":"","status":"Ongoing","genre":["Action","Adventure","Martial Arts","Shounen"],"synopsis":"Yeon Hojeong, orang pertama yang menyatukan Faksi Dark sebagai pemimpin fraksi Unortodoks, bekerja sama dengan Fraksi Ortodoks untuk melewati kekacauan Tiga Kultus. Namun, dia mati lebih cepat dari yang seharusnya karena terjebak rencana busuk Pemimpin Aliansi Murim. “Ini benar-benar rumahku!” Ketika dia membuka matanya, dia berada di Klan Yeon yang seharusnya sudah runtuh, tempat yang tidak mungkin pernah ia lupakan. “Aku tidak akan membuat kesalahan kali ini, tidak lagi.” Ketetapan untuk mencegah keruntuhan keluarganya dan masa depan yang bergejolak gara-gara Tiga Kultus, dia memulai perjalanan tiada akhir! Ini adalah perjuangan Yeon Hojeong, putra tertua untuk menyatukan dunia murim.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/01/dark-and-light-martial-emperor-953807-syaDo1Bl-210x300.webp"},{"judul":"Bloodhounds","slug":"bloodhounds","tipe":"Manhwa","released":"Februari 10, 2023","rating":"7.20","author":"Jeong Chan","artist":"","status":"Ongoing","genre":["Action","Drama","Mature","Seinen"],"synopsis":"–","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/02/blood-524743-jdNzGc08.jpg"},{"judul":"Company Grievance Squad","slug":"company-grievance-squad","tipe":"Manhwa","released":"November 8, 2022","rating":"7","author":"Jeong Ju-haeng","artist":"","status":"Ongoing","genre":["Action","Drama","Seinen"],"synopsis":"Ilgang Group, grup bisnis nomor satu yang mengendalikan ekonomi Korea. Namun, bagian dalamnya diisi dan diwarnai dengan berbagai macam korupsi.\r\n Ketua, yang membutuhkan solusi untuk menyelamatkan kelompok Ilgang yang membusuk, membuat proposal rahasia dengan memanggil anggota termuda dari keluarga Ilgang, Lee Seon-ho, ke Korea, yang tinggal diam-diam di Amerika Serikat…\r\n “Manusia yang memperlakukan karyawannya seperti anjing dan babi! ‘Tim pengaduan internal’ kami akan menangani pelecehan Anda!”","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/11/1667916857-4607-i399692.jpg"},{"judul":"100 Years Old Top Chef","slug":"100-years-old-top-chef","tipe":"Manhwa","released":"Mei 16, 2023","rating":"7.00","author":"Mungonglyong STUDIO JEMI","artist":"","status":"Ongoing","genre":["Cooking","Drama","Fantasy"],"synopsis":"Koki terkuat di Bumi.Pertama Kedua Ketiga… … dan kehidupan keenam.Waktu gabungan yang dihabiskan untuk memasak lebih dari 100 tahun.“Aku tidak bisa melakukan itu lagi.”Hanya ada satu cara untuk menghentikan pengulangan regresi tanpa henti.Aku pasti akan berhasil kali ini","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/05/100-years-old-top-chef-161957-yJd0TPHU.jpg"},{"judul":"A Cadet Becomes A Prophet?!","slug":"a-cadet-becomes-a-prophet","tipe":"Manhwa","released":"Juli 13, 2025","rating":"7.00","author":"Milib","artist":"","status":"Ongoing","genre":["Action"],"synopsis":"Maniak uang Fernan Pellenberg adalah pewaris muda dari Keluarga Pellenberg. ] Salah satu keluarga paling bergengsi di Kekaisaran, serta siswa terbaik di Akademi Kekaisaran. Namun, ia terkenal karena satu hal lain: obsesinya terhadap uang. Sebagai pemburu uang yang kejam, ia hanya mengakui orang-orang yang memberinya keuntungan dan memandang segala sesuatu di dunia melalui nilai moneter. Orang-orang menjauhinya karena merasa jijik dengan keserakahannya. Namun, apakah hukuman suci akhirnya menimpanya? Suatu hari, tanpa peringatan, bencana menimpa Fernan bagaikan petir yang menyambar dari langit. Saat kesadarannya mulai memudar, sesuatu mencoba menginvasi dan mengambil alih pikirannya, tetapi Fernan berhasil mengusirnya dengan paksa. Sejak saat itu, ia mulai melihat sesuatu yang aneh: sebuah buku ramalan yang mengungkapkan masa depan. Dan bukan sembarang masa depan, melainkan sebuah nubuat tentang akhir dunia.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/07/a-cadet-becomes-a-prophet-824279-XkzgXUuN-209x300.jpg"},{"judul":"Crepuscule (Yamchi)","slug":"crepuscule-yamchi","tipe":"Manhwa","released":"Juli 1, 2021","rating":"7.8","author":"Mirchi","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","School Life","Shounen","Supernatural"],"synopsis":"Lark berbeda dari anak-anak lainnya. Dia memiliki mata merah seperti vampir dan ditindas karena hal itu. Suatu hari Ia bertemu dengan Setz, vampir sungguhan dari klan Bangsawan, satu-satunya orang yang tidak menyebutnya monster atau menindasnya. Mereka pun akhirnya berteman, tapi saat terjadi sebuah insiden, Setz tidak ingin kehilangan temannya sehingga Ia mengajak temannya ke rumahnya-dunia para Vampir.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/07/crepuscule-549028-rV8tcpZV-200x300.png"},{"judul":"Born to be God (Tokjjom)","slug":"born-to-be-god-tokjjom","tipe":"Manhwa","released":"Januari 10, 2022","rating":"7","author":"Tokjjom","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Shounen","Supernatural"],"synopsis":"Kim Tae-Sung’ seorang gangster juga anggota OSIS yang tergila-gila dengan uang, Suatu hari Setelah bertemu dukun, Hwal Yeo-Han yang pindah ke sebelah, Dukun mulai muncul di sekitarnya satu per satu, dan dirasuki oleh sesosok hantu menyerang Tae-Sung, Peristiwa Glamour yang membuat hantu ‘Dukshini’ merasuki Tae-Sung.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/01/screenshot-2022-01-10-115114-119047-oIq0CuhU-219x300.png"},{"judul":"Blood Revenger","slug":"blood-revenger","tipe":"Manhwa","released":"Februari 14, 2022","rating":"7.00","author":"Gobaek","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy"],"synopsis":"Suatu hari, ‘Geum Maru’ diserang oleh monster tak dikenal dan mendapat bantuan dari the revenger, ‘Jay White’, yang memburu kejahatan.‘Geum Maru’ menggunakan insiden itu sebagai alasan untuk bergabung ke dalam perang yang telah berlangsung lama antara Evil dan Revengers…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/02/blood-revenger-973567-Rxucm7dR.jpg"},{"judul":"A Demon That Does Not Say His Name","slug":"a-demon-that-does-not-say-his-name","tipe":"Manhwa","released":"Maret 7, 2021","rating":"3","author":"Seongbeom","artist":"","status":"Ongoing","genre":["Comedy","Fantasy","Slice of Life"],"synopsis":"Suatu hari aku bangun dan ada setan di tempat tidurku.  Untuk beberapa alasan dia hanya tinggal di rumahku.  Hari-hari berlalu, aku mulai melihatnya seolah-olah dia adalah seorang saudara perempuan dan membiarkan dia menjalani kehidupan sebagai seorang manusia.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/a-demon-that-does-not-say-his-name-994495-QOKYUSE5-230x300.jpg"},{"judul":"C.O.P","slug":"c-o-p","tipe":"Manhwa","released":"April 25, 2021","rating":"7","author":"","artist":"","status":"Ongoing","genre":["Action","Sci-fi"],"synopsis":"In the near future, a renewable energy source called ‘Aphorium’ becomes the world’s leading power source. This energy revolutionises the fields of biomedical, material, pharmaceutical, and energy engineering and becomes a resource more valuable than gold. However, cartels begin to illegally export ‘Aphorium’ and control its market, using their influence to manipulate governments around the world. Subsequently, the global company ‘Skycaston’ suggests the creation of the I.T.S: Instant Trial System – an android programmed to incarcerate cartel members without needing a trial. Th…\r\n More…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/cop-952382-t1ZoSCcm.jpg"},{"judul":"Cryptocurrency Revenge","slug":"cryptocurrency-revenge","tipe":"Manhwa","released":"November 13, 2022","rating":"7.00","author":"Park Seong-Hyun","artist":"","status":"Ongoing","genre":["Action","Drama","Seinen"],"synopsis":"Seorang mahasiswa jenius yang kehilangan keluarganya karena kekuatan yang memanipulasi harga koin. Dia menyembunyikan identitasnya untuk membalas dendam dan menyusup ke pasukan gangster koin ‘ONE’. Dia menggunakan otak jeniusnya untuk melancarkan balas dendam berdarah pada kekuatan Koin yang menghancurkan hidupnya. Buka kunci bos noir kejahatan cryptocurrency baru oleh Park Sung-hyun.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/11/cryptocurrency-revenge-684665-8URPILSx-210x300.jpg"},{"judul":"Champion’s Path to Murim","slug":"champion-s-path-to-murim","tipe":"Manhwa","released":"Oktober 2, 2022","rating":"7.00","author":"Author Choi Jin Hyung, StoryMore","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Historical","Martial Arts","Shounen"],"synopsis":"Dikenal sebagai “Mister Perfect”, Sang Juara, Kim Sanghyuk, adalah seorang legenda hidup di dunia seni bela diri campuran. Namun, suatu hari dia terlahir kembali di dunia Murim sebagai anggota termuda dari Tembok Harimau Emas! “Kali ini, aku akan menempa legenda baru di Murim!” Sang Murim yang merupakan rumah bagi medley seni bela diri dan teknik, tiba-tiba menyambut keanehan yang dilatih dalam Tinju, Taekwondo, Muay Thai, Gulat, Jujitsu, Capoeira, Judo, dan berbagai seni bela diri modern. Dia siap mengguncang segalanya!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/09/champions-path-to-murim-715856-bZ2ptsWp-210x300.webp"},{"judul":"Coffee Thief","slug":"coffee-thief","tipe":"Manhwa","released":"Februari 22, 2022","rating":"7.00","author":"YOO Ji-byul","artist":"","status":"Ongoing","genre":["Adventure","Romance","School Life"],"synopsis":"Sebuah kafe di pegunungan di belakang sekolah Rumor tersebar bahwa ada ‘pria yang membeli waktu’ di sana.’Yoo Narae’, yang mengalami kecelakaan setahun yang lalu, pergi ke sana bersama Grim Reaper, ‘Saewoo’ dan mencoba mencuri jam pengendali waktu untuk hidup kembali…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/02/coffee-thief-156629-pDjZuZsi-214x300.jpg"},{"judul":"Boss Return","slug":"boss-return","tipe":"Manhwa","released":"November 15, 2023","rating":"7.00","author":"Yang Sejun","artist":"","status":"Ongoing","genre":["Action","Drama","School Life","Seinen","Supernatural"],"synopsis":"Setelah Di Khianati Oleh bawahannya Sendiri. ‘Baek Ganghoon’, Bos dari suatu Gengster besar, Tersadar bahwa dirinya kembali pada masa SMA-nya! Bisakah dia memulai kehidupannya yang baru tanpa Kekerasan dan Kriminal, untuk mencegah terulangnya Kematian Istri tercintanya?!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/11/boss-return-036388-6dyUHfiY.webp"},{"judul":"Beyond Walpurgis","slug":"beyond-walpurgis","tipe":"Manhwa","released":"Desember 16, 2023","rating":"8.1","author":"Gwin","artist":"","status":"Ongoing","genre":["Action","Adventure","Drama","Fantasy","Seinen"],"synopsis":"Dipertengahan abad 19 Prussia, Dr. Maria Faust, memanggil “Penyihir Konigsberg,” membuat kontrak dengan iblis Mepistopheles, bertemu Martin, pemuda penuh keingintahuan yang bermimpi menjadi seorang novelis, dalam petualangan menemukan “cara menyelamatkan orang mati”. Faust dulu disingkirkan oleh Valentin, pria jahat yang membencinya, namun dengan bantuan Martin dan  muridnya bernama Wagner, yang mendukung Faust, dia kemudian bangkin lagi. Setelah berlalunya semua masalah, faust menemukan kebenaran yang sedang dia cari, namun dia menemukan kesalahannya lagi….","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/12/beyond-walpurgis-806500-JDTiBCqx-210x300.webp"},{"judul":"Ankle Breaker","slug":"ankle-breaker","tipe":"Manhwa","released":"September 6, 2025","rating":"7.00","author":"HA Hayeong","artist":"","status":"Ongoing","genre":["Action","School Life","Shounen","Sports"],"synopsis":"Kini hadir seorang guard ‘pendek’ dengan tinggi 167,8 cm! “Basket itu mustahil kalau pendek? Suruh saja mereka bawa pemain setinggi dua meter, atau bahkan tiga meter. Tak peduli setinggi apa pun mereka, sekali kujatuhkan, mereka semua akan berada di bawahku. ” Mampukah sang protagonis, Kang-hwi, menjadi kepingan terakhir yang dibutuhkan oleh tim basket SMA Jeongwang untuk meraih gelar juara dengan gaya bermain ‘run-and-gun’ mereka?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/09/ankle-breaker-470805-cVrxNq6O-206x300.jpg"},{"judul":"Chronicle of Runes","slug":"chronicle-of-runes","tipe":"Manhwa","released":"Agustus 16, 2025","rating":"7.00","author":"강한","artist":"","status":"Ongoing","genre":["Action","Adventure","Drama","Fantasy","Thriller"],"synopsis":"Di dunia dimana runecraft muncul, ban terlahir dengan rune asura, rune yang paling terkutuk dalam sejarah, dikatakan hanya akan membawa kehancuran. Saat seorang penyihir yang mendambakan kekuatan menyerangnya, ban kehilangan segalanya dan disegel di dalam subspace, terputus dari dunia luar. Tenggelam dalam keputusasaan namun didorong oleh kemarahan yang tak terpadamkan, dia menolak untuk mati. Selama 999 tahun, dia mengasah pisau pembalasannya. Akhirnya, dia membuka kekuatan sejati Rune Asura, merobek penjaranya, dan kembali ke dunia, membawa kehancuran bersamanya.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/08/chronicle-of-runes-722909-yoggapIE-231x300.jpg"},{"judul":"Chronicles of the Lazy Sovereign","slug":"chronicles-of-the-lazy-sovereign","tipe":"Manhwa","released":"Juli 13, 2025","rating":"7.00","author":"","artist":"","status":"Ongoing","genre":["Action","Martial Arts"],"synopsis":"Catatan Rahasia Taejon Pendekar agung yang mengakhiri kekacauan besar di dunia. Wi Yeonho (魏衍澔), Sang Pendekar Agung Bersinar (Gwanghui Mujon / 光輝武尊). Dia adalah seorang junja (orang berbudi luhur), seorang dain (pribadi agung), dan seorang daehyeop (pendekar sejati)…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/07/chronicles-of-the-lazy-sovereign-479615-9YupTJ4C-231x300.jpg"},{"judul":"Death penalty (The Executee)","slug":"death-penalty-the-executee","tipe":"Manhwa","released":"Juni 25, 2025","rating":"7","author":"Jinseong (II)","artist":"","status":"Ongoing","genre":[],"synopsis":"Tokoh utama, Jeong In-woo yang selama ini bekerja sebagai pengawal pribadi Ketua BS Construction, Jeong Baek-san, pergi untuk menjalani kehidupan biasa bersama istrinya Yoo Hye-jung, dan Kang Yoo-chul dari Hansam Group mendatangi Jeong Baek-san dan menghukum Jeong Baek-san beserta bawahannya yang tidak mendengarkan ketua yang telah menguatkannya. Adik-adiknya yang berasal dari panti asuhan yang sama, secara sistematis mendatangi bawahan Jeong Baek-san, Jeong In-woo, atas perintah Hansam Group dan menyebabkan kecelakaan pada mobil In-woo yang menggunakan truk besar. Ketika istrinya Yoo Hye-jung yang duduk di kursi penumpang meninggal dunia dan Jeong In-woo selamat, adik-adiknya itu pun menampakkan wajah asli mereka dan menyerang In-woo, tetapi In-woo menyelamatkan nyawanya dengan bantuan Go Kang-seok yang nyaris lolos dari perusahaan. Setelah sadar, In-woo mendengar cerita dari dalam tentang kejadian tersebut dari Kang-seok dan pergi ke Hansam Group sendirian.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/06/death-penalty-the-executee-830079-IZFVpSxx-218x300.jpg"},{"judul":"D-30","slug":"d-30","tipe":"Manhwa","released":"Februari 23, 2022","rating":"7.00","author":"","artist":"","status":"Ongoing","genre":["Action","Drama","School Life","Tragedy"],"synopsis":"Tokoh protagonis, mengalami kekerasan di sekolah, jatuh dari atap. Setelah hampir tidak bangun dari enam bulan ketidaksadaran, ia menolak bantuan teman masa kecilnya yang lama dan memilih untuk pindah. Dia, yang memulai seni bela diri secara kebetulan, sudah cukup berkembang untuk berada di depan final kejuaraan dan ingin menunjukkan penampilan yang berubah, tapi dia mendengar berita bahwa dia dibunuh oleh para pengganggu sehari setelah dia dipindahkan. Setelah mencapai final dalam shock, ia mengejutkan mengambil warp waktu pada hari pertama ketidaksadaran dan mencoba untuk menyelamatkannya dengan mendapatkan kesempatan 30 hari.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/02/d-30-657141-LfyYEHkW.jpg"},{"judul":"Death God","slug":"death-god","tipe":"Manhwa","released":"September 4, 2022","rating":"7.00","author":"Lim Jae Won, Seol Bong","artist":"","status":"Ongoing","genre":["Action","Fantasy","Historical","Martial Arts","Seinen"],"synopsis":"Anak laki-laki Zhong Li Chu, yang membunuh Musa Huangjung dari Sal Tianmen untuk balas dendam saudaranya. Untuk menghindari dikejar oleh Gerbang Astronomi Sal, dia tersapu oleh pusaran besar yang disebut Sepuluh Mang saat dia mempercayakan dirinya kepada musuh penyiram Salhonbu. Untuk melarikan diri dari bayang-bayang Sepuluh Jaringan, Anda harus menjadi komandan klerikal, ranah legenda! Bisakah Zhong Li Chu menjadi perwira klerikal dan menemukan kebebasan dalam disiplin menakjubkan yang telah diciptakan Jungfa Murim?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/09/death-god-982966-k8445qFi-209x300.webp"},{"judul":"Death Row Boy","slug":"death-row-boy","tipe":"Manhwa","released":"Juni 12, 2022","rating":"7.00","author":"Kim Soong-nyeon","artist":"","status":"Ongoing","genre":["Action","Drama","Psychological"],"synopsis":"Ji-hoo, yang kehilangan keluarganya karena Kim Shin, bertemu dengan korban lain, Du-seok, dan dilatih sebagai senjata manusia.\r\n Dan dia pergi ke penjara sendirian untuk membunuh si pembunuh dengan tinjunya…\r\n “Tidak ada eksekusi di negara kita sejak 1997. Bukankah seharusnya ada yang melakukannya?”","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/06/aaaaaaaa-828218-yegbkRcP-210x300.webp"},{"judul":"Cheolsu Saves the World","slug":"cheolsu-saves-the-world","tipe":"Manhwa","released":"November 17, 2022","rating":"7","author":"Fake Scientist, Soosun","artist":"","status":"Ongoing","genre":["Drama","Sci-fi","Shounen"],"synopsis":"Umat manusia telah gagal menghentikan asteroid raksasa agar tidak jatuh ke Bumi, dan kehidupan seperti yang kita tahu telah berakhir. Seorang pekerja kantoran Korea biasa bernama Cheolsu entah bagaimana diberi kesempatan untuk kembali ke masa lalu dan mencegah bencana ini terjadi. Apakah dia punya kesempatan?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/11/cheolsu-saves-the-world-258654-xN7KfbIx-207x300.jpg"},{"judul":"Circle Zero’s Otherworldly Hero Business: Reboot","slug":"circle-zero-s-otherworldly-hero-business-reboot","tipe":"Manhwa","released":"Maret 18, 2021","rating":"7","author":"LIM Dall-Young, Lunar Phase","artist":"","status":"Ongoing","genre":["Drama","Fantasy","Gender Bender","Seinen"],"synopsis":"The protagonist, an egocentric man who's led a successful life as the CEO of a company in modern society is murdered and reborn as a beautiful lady named Paril Hall Mcgryued from a noble family in a fantasy world. Once he wakes up, (now in the body of Paril,) he finds out that he's now in the body of an \"inferior being\" and that all his wealth, achievements and successful life have vanished. Therefore, he decides to rebuild everything from scratch and make it to the \"top of the pyramid\" in this parallel world.\r\n\r\nRepublished (reboot) Version","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/circle-zeros-otherworldly-hero-business-reboot-821007-17QQxV7J-207x300.jpg"},{"judul":"Demon Lord’s Martial Arts Ascension","slug":"demon-lord-s-martial-arts-ascension","tipe":"Manhwa","released":"November 19, 2022","rating":"7.00","author":"?","artist":"","status":"Ongoing","genre":["Action","Adventure","Demons","Fantasy","Martial Arts"],"synopsis":"“Raja Iblis.” Itu… Mereka biasa memanggilku di kehidupanku sebelumnya, sebelum aku menjadi manusia.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/11/demon-lords-martial-arts-ascension-017659-ilP2iQ1M-215x300.jpg"},{"judul":"A Million-Sub Gym Influencer Becomes a Webtoon Loser?","slug":"a-million-sub-gym-influencer-becomes-a-webtoon-loser","tipe":"Manhwa","released":"Mei 10, 2025","rating":"7","author":"John Stone","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Shounen"],"synopsis":"Dalam dunia yang dilanda ancaman monster, umat manusia menemukan kekuatan baru. Di tengah-tengah pahlawan yang tak pernah berlatih, seorang pria berdiri gagah- Malwang, penjaga eksentrik dari SSAE Gym. Yang memakai pakaian loreng macan dan disenjatai oleh kaki babi, menyambut pendatang baru dengan lengan terbuka dan semangat yang keras. Bersama dengan rekan gym yang unik, Malwang bertarung untuk olahraga, rasa senang, dan masa depan umat manusia. Dibungkus dengan aksi gila dan humor lucu, ini adalah sebuah cerita membangun sebuah tubuh yang kuat- Dan jiwa yang lebih kuat.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/05/a-million-sub-gym-influencer-becomes-a-webtoon-loser-206107-sYE8ftDg-209x300.jpg"},{"judul":"Action Idols – Age of Young Dragons","slug":"action-idols-age-of-young-dragons","tipe":"Manhwa","released":"Maret 9, 2021","rating":"7.2","author":"KIM Tae-Gwan","artist":"","status":"Ongoing","genre":["Action","Comedy","Martial Arts","School Life","Shounen"],"synopsis":"Setelah kematian kakaknya yang mencurigakan, Zena Han memutuskan untuk melanjutkan pelatihannya menjadi siswa seni matial papan atas sehingga dia dapat diterima menjadi klan dan mendapatkan gelar idola aksi yang didambakan.  Dia pindah ke sekolah baru dan soons menemukan dirinya meluncur di jalan di mana kekuatan dan kebenaran dapat ditemukan.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/action-idols-age-of-young-dragons-819622-z2kGK0Xq-176x300.jpg"},{"judul":"Aire","slug":"aire","tipe":"Manhwa","released":"November 7, 2022","rating":"7.00","author":"Seoli","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy"],"synopsis":"Sebuah perjalanan menemukan kekuatan yang hilang. pertualang dimulai…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/11/aire-302933-AGkzXJ0D.webp"},{"judul":"Day walker","slug":"day-walker","tipe":"Manhwa","released":"Agustus 11, 2024","rating":"6","author":"Mute","artist":"","status":"Ongoing","genre":["Action","gore"],"synopsis":"Black Agent Badan Intelijen Nasional (BIN) ‘Suhyuk’ menerima tugas untuk membunuh pemimpin organisasi ‘Nanaya-gumi,’ yang terlibat dalam perdagangan narkoba di Korea. Namun, pemimpin itu ternyata seorang wanita menawan bernama ‘Anna,’ yang tampaknya tidak ada hubungannya dengan pertarungan… Ada yang aneh dengan tugas ini. Suhyuk memulai misinya untuk membalas dendam terhadap BIN yang mengkhianatinya dan Nanaya-gumi, yang membantai rekan-rekannya.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/08/day-walker-922826-zfli1NSt.jpg"},{"judul":"24-hour Rebirth Consultation Centre","slug":"24-hour-rebirth-consultation-centre","tipe":"Manhwa","released":"Juni 30, 2025","rating":"7","author":"Cheong Ah Han, Nok Eum","artist":"","status":"Ongoing","genre":[],"synopsis":"Mewarisi misi ilahi untuk membantu para reinkarnator, regresor, dan transmigrator, Laura adalah satu-satunya konselor di Pusat Konseling Reinkarnasi. Namun, untuk beberapa alasan, para pelanggan—yang seharusnya muncul setiap seratus tahun sekali—tidak muncul selama lima abad. Setelah 500 tahun menunggu, Laura siap meninggalkan pusat itu untuk selamanya ketika tiba-tiba… Pelanggan yang telah lama ditunggu-tunggunya muncul. Atau lebih tepatnya, pelanggan. “…Kerasukan, kurasa.” “Regresi.” “Lebih mirip reinkarnasi.” “…Apakah dunia sudah gila?” Mengapa ada tiga klien sekaligus?! Dengan waktu 24 jam sehari yang tidak lagi cukup, akankah Laura mampu menangani sesi konseling yang kacau ini?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/06/24-hour-rebirth-consultation-centre-181408-7ZG9Mclq-198x300.jpg"},{"judul":"Dark Moon: The Grey City","slug":"dark-moon-the-grey-city","tipe":"Manhwa","released":"Maret 13, 2023","rating":"7.00","author":"HYBE (Author), GGULCHAN & HYBE & POGO (Artist)","artist":"","status":"Ongoing","genre":["Drama","Fantasy","Shoujo"],"synopsis":"Setelah nyaris lolos dari ancaman para vampir, para bocah manusia serigala mencoba menetap di desa tepi pantai. Mereka berharap untuk kehidupan sekolah yang damai tetapi malah bertemu dengan Khan, seorang anak laki-laki yang telah dicap sebagai setan dan diintimidasi karenanya. Telah terjadi kematian di desa yang tenang ini, dan dengan rahasia Khan yang mengakar, anak laki-laki itu mungkin menghadapi bahaya lain…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/03/dtg623532412-e1678712042782-740979-QgbFAegp.jpg"},{"judul":"Crisis (Talk)","slug":"crisis-talk","tipe":"Manhwa","released":"Juli 1, 2021","rating":"7.00","author":"Talk","artist":"","status":"Ongoing","genre":["Action","Adventure","Supernatural"],"synopsis":"Sebuah bumi yang hampir menjadi gurun sebagai bencana.  Manusia dengan kekuatan gaib lahir sebelum dan sesudah bencana, dan mereka disebut ‘Amrita’.  Namun seiring berjalannya waktu, konflik antara Amrita dan manusia biasa semakin menjadi-jadi.  Menghadapi krisis umat manusia  Anak muda Amrita Nico dan gadis Reina yang menyimpan rahasia.  Apa akhir dari petualangan keduanya?!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/07/crisis-talk-173403-YRxGRznl-222x300.jpg"},{"judul":"A.I Doctor","slug":"a-i-doctor","tipe":"Manhwa","released":"Juli 13, 2021","rating":"7.00","author":"Hansanleega, ZAINO","artist":"","status":"Ongoing","genre":["Drama","Sci-fi"],"synopsis":"Bertaruh pada masa depan Grup TaeHwa, A.I. dibuat untuk diagnosis bernama Baruda! Penduduk ahli bedah saraf tahun pertama, Lee Soohyuk, bekerja dengan Baruda ketika dia terkena ledakan misterius dan kehilangan kesadaran. Setelah sadar kembali, dia bertemu A.I. Baruda dalam pikirannya. Sudah tak terpisahkan, mereka dihadapkan pada situasi di mana mereka harus saling membantu. Baruda, yang, melalui pembelajaran mendalam, bertujuan untuk menjadi pendiagnosis terbaik, dan Soohyuk, yang masih ingin menjadi miliknya sendiri, bekerja sama untuk menjadi ahli bedah saraf terbaik di dunia.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/07/ai-doctor-864000-Hhs8gpkP.jpg"},{"judul":"Boss in School","slug":"boss-in-school","tipe":"Manhwa","released":"Maret 3, 2021","rating":"8.7","author":"LEE Hoon Young","artist":"","status":"Ongoing","genre":["Action","Drama","School Life","Seinen"],"synopsis":"Seth Kwon terlahir sebagai pejuang. Tetapi karena janjinya dengan ibunya, ia memutuskan untuk berhenti berkelahi, bahkan untuk membela diri… Semuanya berubah ketika ayahnya meninggal dan meninggalkannya dengan satu pesan: “berhenti menendang pantatmu”.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/boss-in-school-306478-0GPOGYfW-212x300.png"},{"judul":"Darkness and Death","slug":"darkness-and-death","tipe":"Manhwa","released":"Agustus 13, 2021","rating":"7","author":"Nurik, Hokutai","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Martial Arts","Psychological","Supernatural","Thriller"],"synopsis":"Serangkaian peristiwa terkait terjadi di Dunia Terbengkalai setelah bencana. Orang-orang yang diberkahi dengan Kekuatan misterius setelah hari yang menentukan itu dipaksa untuk saling berhadapan, tanpa menyadari bahwa mereka hanyalah pion dalam permainan yang lebih besar.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/08/darkness-and-death-860910-D6jTQokG.jpg"},{"judul":"Cryptid","slug":"cryptid","tipe":"Manhwa","released":"November 6, 2024","rating":"7.00","author":"247","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Shounen","Supernatural"],"synopsis":"Robin, seorang siswa SMA biasa di Korea Selatan. Dalam perjalanan pulang dari sekolah, sirene serangan udara meraung-raung di seluruh kota, dan ‘sesuatu’ yang tak dikenal menghancurkan kehidupan normal Robin. Robin terjebak dalam pertempuran antara ‘Cryptid’ yang sudah lama terlupakan dan ‘Korps Tanpa Nama’ yang melindungi umat manusia… Tunggu, ini menakutkan!!!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/11/cryptid-612241-EJk6sAda.jpg"},{"judul":"A Gate Opened On My First Day As A Politician","slug":"a-gate-opened-on-my-first-day-as-a-politician","tipe":"Manhwa","released":"September 7, 2022","rating":"7.00","author":"Jepigalu","artist":"","status":"Ongoing","genre":["Drama","Fantasy"],"synopsis":"Han Seung-Moon adalah seorang pemuda yang akhirnya terpilih menjadi anggota Majelis secara kebetulan. Dia mencalonkan diri untuk jabatan tanpa banyak harapan, tetapi lawannya ditangkap karena melanggar undang-undang dana pemilihan, dan dia menang Karena Murni KeberuntunganDia pikir dia adalah orang paling beruntung yang masih hidup saat dia dilantik. Itu sampai atap Gedung Majelis Nasional runtuh saat monster jatuh.Ini adalah kisah kacau dan pedas dari petualangan politik pemburu gerbang pasca-apokaliptik!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/09/a-gate-opened-on-my-first-day-as-a-politician-076349-WZC8Weur-210x300.webp"},{"judul":"Change","slug":"change","tipe":"Manhwa","released":"Maret 10, 2021","rating":"7.2","author":"Jin Yuan Jinone [Add, ]","artist":"","status":"Completed","genre":["Comedy","Drama","Gender Bender","Romance","School Life","Shounen","Slice of Life"],"synopsis":"Seorang anak laki-laki yang kasar dan berotot yang bercita-cita menjadi juara nasional, tiba-tiba berubah menjadi gadis imut, bagaimana “dia” akan mencapai impian “dia”?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/change-980620-RGGIafel-180x300.jpg"},{"judul":"A Regressor’s Tale of Cultivation","slug":"a-regressor-s-tale-of-cultivation","tipe":"Manhwa","released":"Juli 18, 2025","rating":"7.00","author":"Tremendous, 엄청난","artist":"","status":"Ongoing","genre":["Action","Adventure","Drama","Fantasy"],"synopsis":"Aku menemui ajalku dengan menjadi pecundang selama hidupku karena tidak diberkahi bakat apapun. Itulah kehidupan pertamaku… dan awal mula dari Regresiku yang tiada akhir.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/07/a-regressors-tale-of-cultivation-026205-gLyKjxfb-207x300.jpg"},{"judul":"Absolute Regression","slug":"absolute-regression","tipe":"Manhwa","released":"Juli 30, 2024","rating":"7.30","author":"Jang Yeonghun, JP","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Martial Arts"],"synopsis":"“Tolong kirim aku ke masa lalu.” Jika dia tidak bisa membunuh orang itu di era sekarang, dia hanya perlu kembali ke masa lalu. Pria itu menggunakan “Great Regression Technique” untuk melintasi waktu, kembali ke masa lalu yang sangat dia idam-idamkan. “Unrivaled Swordsman” yang telah kehilangan segalanya, keluarganya, teman-temannya, dan kehidupannya. Ini adalah langkah pertamanya untuk mendapatkan balas dendamnya.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/07/absolute-regression-279513-v82ou1sd.jpg"},{"judul":"After School Special Supplementary Class","slug":"after-school-special-supplementary-class","tipe":"Manhwa","released":"Desember 2, 2022","rating":"7.00","author":"Munsang, Nemo","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","School Life","Shounen"],"synopsis":"SMA Shinheung, di mana skill bertarung adalah hasil dari nilai, dan kisah bertahan hidup siswa yang lebih rendah yang memilih persahabatan daripada kompetisi.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/12/after-school-special-supplementary-class-824057-ysmBRc4P.webp"},{"judul":"Bookworm","slug":"bookworm","tipe":"Manhwa","released":"April 18, 2021","rating":"9.2","author":"Kang Cheol-Mil","artist":"","status":"Ongoing","genre":["Action","Adventure","Comedy","Fantasy","Sci-fi","Shounen","Slice of Life"],"synopsis":"Kutu buku – Soo-Hyuk. Membaca kesenangan nomor satunya, dia selalu mencari cara baru untuk membaca buku. Bahkan bergabung dengan game baru sehingga tidak ada yang bisa mengganggunya untuk membaca buku. Saat Soo-Hyuk selesai membaca buku pertamanya, ia menerima pemberitahuan: Wisdom +1 level ….","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/bookworm-062272-f3zewTn6-209x300.jpg"},{"judul":"Archmage Transcending Through Regression","slug":"archmage-transcending-through-regression","tipe":"Manhwa","released":"Oktober 5, 2022","rating":"8.7","author":"","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Regression"],"synopsis":"Mikhail Walpurgis, satu-satunya Archmage Circle-9 di dunia, jatuh dalam pertempuran karena seorang pahlawan terkutuk, dan berhasil mengeluarkan satu mantra sihir tingkat tinggi untuk yang terakhir, . Seiring waktu, dia mundur ke 20 tahun yang lalu.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/10/huishuha-032487-5nv5vGqc-210x300.webp"},{"judul":"Bad Prosecutor – Sword Showdown","slug":"bad-prosecutor-sword-showdown","tipe":"Manhwa","released":"Oktober 15, 2022","rating":"8.4","author":"","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Thriller"],"synopsis":"[Karya ini adalah adaptasi dari sebuah drama] Bagaimana Anda bisa melawan hukum ketika hukum ada di pihak Anda? “Jin Jung”, itu dilarang di dunia penuntutan untuk berperilaku seperti preman! Untuk menangkap orang-orang jahat, dia memilih cara yang bijaksana di atas hukum, trik di atas prosedur standar, dan kenakalan di atas kejujuran! Dia hanya punya satu tujuan! Untuk mengungkapkan kebenaran dan menjatuhkan kejahatan besar masyarakat! Ini adalah pertarungan antara Jaksa Penuntut “Jin Jung” dan menghukum orang-orang berkuasa yang korup yang seharusnya berada di sisi keadilan!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/10/bad-prosecutor-sword-showdown-095785-N8DKHNvR-210x300.png"},{"judul":"Blood Demon Reincarnation","slug":"blood-demon-reincarnation","tipe":"Manhwa","released":"Maret 8, 2025","rating":"7.00","author":"San Cheon","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Shounen"],"synopsis":"Kang San is a Bottom 1% Tanker with NO TALENT, ABILITIES, or SKILL. Misfortune follows him until a divine messenger appears before him one day.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/03/blood-demon-reincarnation-031359-jMLou4QA-207x300.jpg"},{"judul":"Blade of Retribution","slug":"blade-of-retribution","tipe":"Manhwa","released":"Mei 10, 2024","rating":"7.00","author":"Meen","artist":"","status":"Ongoing","genre":["Action","Drama","Martial Arts","Seinen","Tragedy"],"synopsis":"Dihari ketika Juara Kendo Shiho memutuskan untuk membantu ibunya menjalankan restoran Gukbap, dia menerima kabar bahwa adiknya, Shiyeon, bunuh diri. Saat pemakaman, Shiho menyadari ada yang tidak beres. Itu bukan bunuh diri, dia dibunuh. Untuk mengetahui kebenaran dan membalas kematian adiknya, Shiho mengangkat pedangnya sekali lagi untuk memulai perangnya sendiri.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/05/image-2024-05-10-194641201-357432-nU6THqLr-210x300.png"},{"judul":"Annoying Alice","slug":"annoying-alice","tipe":"Manhwa","released":"Maret 19, 2021","rating":"9.2","author":"LEE Hyun-Min","artist":"","status":"Ongoing","genre":["Comedy","Drama","Romance"],"synopsis":"Alice sangat menyebalkan!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/annoying-alice-143961-WT4ACLeK-221x300.jpg"},{"judul":"Deadbeat Hero","slug":"deadbeat-hero","tipe":"Manhwa","released":"November 12, 2021","rating":"7","author":"SHIHO","artist":"","status":"Ongoing","genre":["Adventure","Comedy","Drama","Fantasy","Shounen"],"synopsis":"Na Gangnam telah menjadi seorang pengangguran selama bertahun-tahun, melepaskan ibunya yang malang. Tetapi suatu hari, dia tiba-tiba memutuskan bahwa dia akan mulai menjadi anak yang baik mulai hari berikutnya. Saat tidur, dia bangun dari suara keras dan membuka jendelanya… tapi apa ini? Kenapa ada slime di depan rumahnya? Dia akhirnya dilemparkan ke dunia fantasi bersama dengan seluruh rumahnya?! Perjalanan Gangnam kembali ke rumah, maksudku, ke ibunya dimulai sekarang.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/11/deadbeat-hero-205030-DXilomII-222x300.jpg"},{"judul":"A Grandcross Story","slug":"a-grandcross-story","tipe":"Manhwa","released":"Oktober 19, 2022","rating":"7","author":"Seungyong,Studio Grigo","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Manhwa","Shounen"],"synopsis":"Sebuah Cerita Grandcross Dia akan melakukan apa saja untuk meningkatkan jumlah suka dan pelanggan, BJ Dosa Jeon Woo-chi ada di sini untuk mengirim angin puyuh melalui streaming Internet Korea abad ke-21! Jeon Woochi adalah seorang pendeta Tao yang pernah membalikkan Joseon. Sejak itu, 500 tahun telah berlalu, dan dia sekarang berada di era media sosial. Dia hidup dengan menarik perhatian orang melalui siaran internet dan media sosial. Namun, suatu hari, Jinhee, putri keluarga yang kakeknya ia bantu di masa lalu, datang dengan gulungan misterius milik objek Jeon Woochi, untuk meminta bantuan. Namun, monster tak dikenal yang menargetkan gulungan itu menyerang Jeon Woochi. Dengan munculnya monster tak dikenal, banyak peristiwa mulai terjadi di sekitar Jeon Woochi. Pada saat yang sama, dia diundang ke turnamen streaming pemenang penghargaan, Channel Exceed, dan dia melihat konspirasi besar di baliknya…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/10/a-grandcross-story-807451-jW4CT55Q-210x300.webp"},{"judul":"A Tidal Wave of Glory","slug":"a-tidal-wave-of-glory","tipe":"Manhwa","released":"Maret 30, 2024","rating":"7.00","author":"Beulimseu, Haje","artist":"","status":"Completed","genre":["Drama","Fantasy","Shounen"],"synopsis":"Halo, musisi terbaik saat itu, mengalami kecelakaan lalu lintas dalam perjalanan ke upacara Grammy. Dan ketika dia sadar kembali, dia menemukan dirinya berada di tubuh seorang bocah lelaki Korea bernama No Hae-il. Dia menemukan dirinya berada dalam keadaan yang benar-benar buruk. tempat dan waktu yang berbeda. Dia menegaskan bahwa nama Inggris No Hae-il adalah Halo dan merasakan takdir yang kuat. Halo, yang memasuki Hae-il, terbukti menjadi seorang jenius musik saat ini juga","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/03/image-2024-03-30-125623657-524023-DFVbxEX3-231x300.png"},{"judul":"Demonic Master of Mount Kunlun","slug":"demonic-master-of-mount-kunlun","tipe":"Manhwa","released":"September 1, 2022","rating":"7.00","author":"Geulbyeol Jali, Heron Nest (Author), Wooyoo Saseon (Artist)","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy","Historical","Martial Arts","Shounen"],"synopsis":"Iblis Surgawi Sejati menjabat sebagai pemimpin muda Sekte Setan selama 100 tahun karena ayahnya, pemimpin Sekte itu, berumur panjang.\r\n Namun, setelah mewarisi posisi Pemimpin Kultus, yang tidak dia inginkan, dia meninggal hanya dalam satu tahun.\r\n Tetapi ketika dia bangun, dia sekarang masih bayi!\r\n Dia ditinggalkan di pinggir jalan, tetapi dia dijemput oleh seorang Taois dari Kunlun, sebuah sekte milik faksi keadilan.\r\n Saat itulah ia menjadi Jung Gwang, murid termuda dari Jeong Jabae.\r\n Saat dia meninggal karena sebab alami, dia tidak memiliki dendam.\r\n Dia lebih ingin tahu tentang kehidupan dengan hubungan yang hangat di antara orang-orang daripada yang berdarah.\r\n Dia tidak bisa menikmati kehidupan sebelumnya karena dia sibuk membersihkan kekacauan ayahnya, jadi bukankah dia harus hidup untuk dirinya sendiri kali ini?\r\n Tapi dia sekarang anak-anak. Setelah memasuki Kunlun, dia setidaknya harus memastikan dia tidak akan menyesal sebelum saat-saat terakhir.\r\n Di bawah pengaruhnya, Kunlun secara bertahap berubah.\r\n Taoisme? Itu bukan urusanku.\r\n Cara iblis? Aku sedikit muak.\r\n Kisah kehidupan yang bergejolak di Murim dari Iblis Surgawi Sejati yang terlahir kembali.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/09/demonic-master-of-mount-kunlun-956255-z374Vp38-220x300.webp"},{"judul":"Carnivorous Hunter","slug":"carnivorous-hunter","tipe":"Manhwa","released":"Juli 7, 2022","rating":"7.00","author":"Prodify, Woo Sol Yeon (Author), Prodify (Artist)","artist":"","status":"Ongoing","genre":["Action","Adventure","Drama","Fantasy","Mature","Shounen"],"synopsis":"Dengan munculnya binatang buas di seluruh dunia, miliaran orang telah meninggal karena bencana tersebut. Sebagian dari para survivors yang hidup menjadi “metahuman”. Mereka adalah orang-orang yang akan mampu menghadapi binatang buas, dengan demikian, celah besar antara metahuman dan manusia yang tidak dapat bertransisi terbuka. Kim Seonwoo adalah manusia pemandu biasa untuk penaklukan binatang metahumans. Di ambang kematian mereka, dia mendengar suara di kepalanya berkata: “Bunuh mereka.” “Bunuh mereka dan ambil kekuatan mereka!”","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/07/carnivorous-hunter-404764-UltRrQje-210x300.webp"},{"judul":"Deadman 31","slug":"deadman-31","tipe":"Manhwa","released":"Oktober 21, 2021","rating":"7","author":"Shinwol","artist":"","status":"Ongoing","genre":["Action","Fantasy","Mystery","Romance","Seinen"],"synopsis":"Deadman, seorang detektif abadi yang mempertaruhkan nyawa selama 31 hari, mengutamakan kepuasan pelanggan. Bahkan jika Anda tidak puas, kami akan membuat Anda puas!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/10/deadman-31-254373-aqlwiufH-222x300.jpeg"},{"judul":"Absolute Dominion","slug":"absolute-dominion","tipe":"Manhwa","released":"September 28, 2024","rating":"7.5","author":"Jang Young Hoon","artist":"","status":"Ongoing","genre":["Action","Adventure","Drama","Martial Arts","Seinen"],"synopsis":"“Aku akan melahap Jianghu ini!”","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/09/bdc3b8aec1ee-c6f7bdbac5cd-bde6b3d7c0cf-690x1000-633178-m7Q3EjwI-207x300.png"},{"judul":"BlackSun","slug":"blacksun","tipe":"Manhwa","released":"April 15, 2021","rating":"7","author":"","artist":"","status":"Ongoing","genre":["Action","Fantasy"],"synopsis":"Seorang anak laki-laki yang tidak memiliki pengetahuan tentang beban yang dibawanya atau kejahatan yang bersembunyi dalam kegelapan mencarinya sejak lahir, akan segera merasakan beban dan menjadi harapan terakhir umat manusia..","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/blacksun-751593-Zixgi7X9-240x300.jpg"},{"judul":"Battleground","slug":"battleground","tipe":"Manhwa","released":"Januari 18, 2022","rating":"7","author":"HYEONG EUN","artist":"","status":"Completed","genre":["Action","Adventure","Drama","Shounen"],"synopsis":"[PUBG UNIVERSE] Hoyoung Cheon adalah seorang agen badan intelijen negara, ditugaskan untuk mengikuti Battlegrounds, sebuah permainan pembunuhan ilegal. Namun, tugas Hoyoung Cheon adalah untuk mencari anggota MPR, Naksu Kim. Di antara 100 terpidana mati, apakah Cheon dapat bertahan hidup melawan musuh-mushnya dan menjalankan misinya?!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/01/battleground-manhwa-manga-613821-CUgMEC16-215x300.png"},{"judul":"Breakers","slug":"breakers","tipe":"Manhwa","released":"Agustus 26, 2025","rating":"7.00","author":"Chwiryong","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Shounen"],"synopsis":"Joo In-gong terseret masuk ke dalam remake dari game yang sedang ia mainkan, . Namun, ada sesuatu yang janggal. Seharusnya hanya ada dua karakter yang bisa dimainkan—Loch dari pihak manusia, dan Zephyr dari pihak iblis. Tapi entah bagaimana, ia justru terbangun dalam tubuh Shutra—pangeran kesembilan dari Dunia Iblis, sosok yang sebenarnya bahkan tidak pernah ada dalam cerita asli game itu. Dianugerahi dua kekuatan misterius, “Pengaturan Ulang Karakter Protagonis” dan “Kekuatan Penaklukan,” Joo In-gong kini harus mengubah alur cerita game demi bertahan hidup melawan Zephyr. Namun, setiap kali jalan cerita berubah… perhatian semakin banyak tertuju padanya.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/08/breakers-383995-HPakOoOv-200x300.webp"},{"judul":"Closed Room Mafia","slug":"closed-room-mafia","tipe":"Manhwa","released":"November 29, 2022","rating":"7.00","author":"Baek Jiwoon","artist":"","status":"Ongoing","genre":["Shounen"],"synopsis":"Siswa sekolah menengah Kang Chul-joing terbangun di ruang terkunci yang tidak dikenal.\r\n Dia menemukan dirinya dalam situasi kacau, dia mencari di sekitar ruangan dan menemukan MP3 lama.\r\n Apa yang dia pelajari dari pesan yang tersisa di MP3 adalah bahwa dia diracuni dan dia hanya memiliki tiga jam lagi untuk hidup.\r\n Kang Chul-joong, yang biasanya adalah penggemar kuis misteri, mencoba melarikan diri dari ruangan yang tidak diketahui dengan menemukan petunjuk berdasarkan keterampilan penalarannya yang telah dia kumpulkan selama bertahun-tahun.\r\n Namun, kenyataannya berbeda dengan idealnya.\r\n Apa petunjuk terakhir yang dia perhatikan ketika dia melakukan serangkaian kesalahan dan berakhir dalam situasi mendesak di mana racun menyebar dan dia mulai muntah darah?!Game bertahan hidup baru yang dipersembahkan oleh Baek Ji-woon, pencipta “Perjuangan” dan “Raja Mayat Hidup”!\r\n Apakah ada cara untuk melarikan diri dari ruang rahasia neraka ini!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/11/closed-room-mafia-641049-ULBekkrC-208x300.jpg"},{"judul":"Covenant","slug":"covenant","tipe":"Manhwa","released":"Maret 10, 2023","rating":"7.00","author":"-","artist":"","status":"Ongoing","genre":["Action","Adventure","Martial Arts","Psychological","Sci-fi","Seinen","Supernatural","Tragedy"],"synopsis":"–","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/03/covenant-672994-O2OaIbXm.jpg"},{"judul":"Death or Punch","slug":"death-or-punch","tipe":"Manhwa","released":"Februari 16, 2023","rating":"7.00","author":"Noh Do-hwan","artist":"","status":"Ongoing","genre":["Action","Adult","Drama","Horror","Mature","Psychological","Seinen","Tragedy"],"synopsis":"Minho adalah ikan yang keluar dari air di sekolahnya yang bergengsi. Setelah dipukuli sampai babak belur oleh teman sekelasnya, dia mencapai titik puncaknya. Dia membutuhkan perlindungan atau dia sudah selesai. Beruntung baginya, seorang pria misterius, Kang Woo-hyeok, kebetulan berada di tempat yang tepat pada waktu yang tepat. Orang-orang yang tampaknya sangat berbeda ini sama-sama memiliki apa yang dibutuhkan orang lain. Woo-hyeok bisa menjadi pengawal Minho, dan Minho…dia bisa memberikan permintaan kematian Woo-hyeok!!!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/02/death-or-punch-754343-n7sy6w1n.webp"},{"judul":"Blood and Butterflies","slug":"blood-and-butterflies","tipe":"Manhwa","released":"April 12, 2021","rating":"6","author":"Remin","artist":"","status":"Ongoing","genre":["Action","Fantasy","Horror","Psychological","Supernatural"],"synopsis":"Suatu hari, monster raksasa berbentuk serangga muncul di seluruh dunia… dengan hanya “Anak-anak Kupu-Kupu” untuk melawannya.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/blood-and-butterflies-240846-HR93yKCX-209x300.jpeg"},{"judul":"Back Then, I Didn’t Realize It Was A Big Win","slug":"back-then-i-didn-t-realize-it-was-a-big-win","tipe":"Manhwa","released":"Agustus 27, 2023","rating":"7.00","author":"차우렌즈","artist":"","status":"Ongoing","genre":["Action","Comedy","Game"],"synopsis":"Seo Yeon-woo mencari nafkah dengan bermain game, dan dalam game quest tersembunyi yang diberikan kepadanya, dia berjuang selama beberapa bulan dan menerima pecahan kubus sebagai hadiah. Untuk apa pecahan kubus ini digunakan? Apakah ini penipu? Kembalikan waktu yang telah saya buang! Namun sesuatu yang menakjubkan terjadi ketika kubus itu sampai ke tangan saya. “Kamu telah menjadi pemilik senjata ajaib kuno ‘Kigantes Dark’.” Apakah ini titik balik hidupku? Apakah saya mendapatkan jackpot? Ini adalah kisah Seo Yeon-woo, seorang gamer tipe bertahan hidup, dan petualangannya dengan senjata kuno, Kigantes Dark!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/08/back-then-i-didnt-realize-it-was-a-big-win-272286-R5lniM4G.jpg"},{"judul":"Apocalyptic Chef Awakening","slug":"apocalyptic-chef-awakening","tipe":"Manhwa","released":"November 11, 2023","rating":"8.1","author":"","artist":"","status":"Ongoing","genre":["Action","Adventure","Cooking","Fantasy"],"synopsis":"Shin Young-jun, seorang sersan koki, disambut oleh kiamat hanya beberapa hari sebelum liburan. Batalyon tersebut berubah menjadi kekacauan dalam sekejap, dan jaringan komunikasi terputus. Lalu sesuatu muncul di depan matanya! [Selamat atas kebangkitanmu!] [Pekerjaan: Koki Pemula Lv.1] Jika aku seorang pejuang atau pembunuh, aku akan mencoba untuk berdiri sendiri… Yang ditugaskan padanya adalah koki, yang jelas merupakan pekerjaan pendukung . Tidak ada yang bisa dilakukan jika sudah seperti ini. “Mulai sekarang, aku akan memberimu makan.”","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/11/aca523423423-e1699703771255-047315-iOs5i4Gn-231x300.webp"},{"judul":"Chaos Attack","slug":"chaos-attack","tipe":"Manhwa","released":"Mei 6, 2021","rating":"6.2","author":"Massstar","artist":"","status":"Ongoing","genre":["Action","Comedy","Shounen","Supernatural"],"synopsis":"Do Ah Lee, seorang anak laki-laki SMA yang “normal”, terjebak dalam situasi yang aneh dan memalukan. Sebelum dia mengetahuinya, dia diperas untuk menjadi manajer tim pahlawan yang unik, nakal, dan agak sedikit malas. Apakah dia akan kembali ke hari-hari sekolahnya yang “normal”?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/05/chaos-attack-349580-zuXlpWQ9-300x195.jpg"},{"judul":"Academy of Monster","slug":"academy-of-monster","tipe":"Manhwa","released":"Maret 9, 2021","rating":"7.0","author":"Hancho","artist":"","status":"Ongoing","genre":["Action","Fantasy","Shounen"],"synopsis":"“Ya? Masuk ke Monster Academy?”","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/academy-of-monster-329067-PjK7XSuB-201x300.jpg"},{"judul":"Chronicles of the Demon Faction","slug":"chronicles-of-the-demon-faction","tipe":"Manhwa","released":"Maret 25, 2023","rating":"7","author":"codezero","artist":"","status":"Ongoing","genre":["Action","Adventure","Demons"],"synopsis":"Chun Hajin, pembunuh terkuat Aliansi Heavenly Righteous dari Murim Ortodoks.\r\n Hajin terbunuh ketika berusaha melarikan diri demi meraih kebebasan.Kemudian…‘Kultus Divine kekal selamanya, semua Demonic tunduk! Selamat atas kepulihan anda, tuan muda ketiga!’Dia bereinkarnasi sebagai musuh dunia murim, tuan muda ketiga Kultus Demonic?!Penaklukan kultus demonic oleh Chun Hajin, senjata rahasia murim ortodoks dimulai sekarang!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/03/chronicles-of-the-demon-faction-275727-v4GsvSyQ.jpg"},{"judul":"Be the Actor","slug":"be-the-actor","tipe":"Manhwa","released":"November 4, 2022","rating":"7.00","author":"GogwangÂ [Add, ]Kim HaemaÂ [Add, ]","artist":"","status":"Ongoing","genre":["Drama","Fantasy","Shounen"],"synopsis":"Jadilah Aktor ‘Jang Young-guk’, yang meraih sukses besar sebagai aktor pendukung. Menerima Penghargaan Aktor Pendukung Terbaik pertama dan terhormat di Acting Awards. Namun, pada hari itu, ibunya meninggal … Ngeri dengan kematian ibunya, yang dia abaikan selama bertahun-tahun, Young-guk memutuskan untuk mengakhiri hidupnya … Sebelum kematiannya, dia merindukan kehangatan ibunya dan kenangan damai. dari masa lalu. Dia menyesal membalikkan ingatan itu… Pada saat itu, dia tiba-tiba mundur ke masa kecilnya… “Aku mundur, ke masa lalu yang aku rindukan” “Sebagai fakta yang tak terhindarkan, hidup ini hanya…” Sekali lagi, kisah seseorang yang ingin hidup sebagai aktor dimulai. Akankah dia bisa menjalani kehidupan yang bahagia tidak seperti kehidupan sebelumnya?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/11/be-the-actor-169161-DBIV3lRp.webp"},{"judul":"Damn Demonic Swords","slug":"damn-demonic-swords","tipe":"Manhwa","released":"November 22, 2023","rating":"8.3","author":"Author Dongsil-dongsil,]G.CafeGun [Add, ]Solmong [Add, ]","artist":"","status":"Ongoing","genre":["Action","Drama","Fantasy"],"synopsis":"“Membalas kebaikan dua kali lipat, dan membalas kejahatan sepuluh kali lipat”.\r\n Signature Jagger adalah seorang warrior yang berusaha menghindari masalah bagaimanapun caranya. Entah suatu kebetulan atau takdir dia diikuti oleh demonic swords yang berubah menjadi gadis. Dan terlibat berbagai macam masalah…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/11/1700584054-7020-i435523-975037-LA3mNYca.jpg"},{"judul":"Devil Returns To School Days","slug":"devil-returns-to-school-days","tipe":"Manhwa","released":"April 12, 2023","rating":"7","author":"The Geek","artist":"","status":"Ongoing","genre":["Action","Bully","Delinquent","Fantasy","School","Time Travel"],"synopsis":"Nilai bagus, penampilan tampan, kemampuan bertarung di atas rata-rata, dan sedikit jiwa keadilan. Di malam menjelang kelulusannya, Kim Hyunsung didorong jatuh dari atap dan berakhir dalam kondisi vegetatif. Tidak bisa mati, hanya dengan pendengaran dan kesadarannya yang masih hidup, dia menghabiskan sepuluh tahun selanjutnya di neraka hingga dia mendadak kembali ke hari pembullyan itu dimulai.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/04/devil-returns-to-school-days-683297-CoY3BEPE.webp"},{"judul":"Android Have No Blood","slug":"android-have-no-blood","tipe":"Manhwa","released":"Maret 18, 2021","rating":"8","author":"재담","artist":"","status":"Ongoing","genre":["Action","Adventure","Comedy","Martial Arts","Shounen"],"synopsis":"Android-ai berteknologi tinggi, memasuki dunia seni bela diri karena pendaratan darurat dan pergeseran dimensi. Meskipun dia bisa memasak makanan untuk yang lapar, dia bahkan tidak akan makan sepotong sendiri (dia adalah robot) Dia akan membantu orang dalam bahaya, tapi dia tidak akan pernah membunuh mereka (mengikuti tiga prinsip robot) Dia tidak pernah tidur dan tidak pernah lelah, orang menganggapnya sebagai pahlawan hebat … Mari kita lihat petualangan pahlawan robot AI di dunia seni bela diri.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/androids-have-no-blood-962641-PzszpvB3-207x300.jpg"},{"judul":"Alternate Life","slug":"alternate-life","tipe":"Manhwa","released":"Mei 23, 2022","rating":"8.10","author":"Carlos/Jink","artist":"","status":"Ongoing","genre":["Drama","Horror","Psychological","Tragedy"],"synopsis":"Selama 20 tahun hidupnya, Jiwon selalu menderita karena penampilannya yang tidak seperti orang pada umumnya. Namun hidupnya berubah karena profile media sosial yang baru dia buat ‘Sihoo Kim’ berhasil viral dalam waktu singkat! Mampukah Jiwon menjalankan kedua kehidupannya? Sebagai Jiwon Lim sekaligus dengan ‘Sihoo Kim’ buatannya?!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/05/alternate-life-364487-3wVZ2Uvz-210x300.webp"},{"judul":"44th Period Survival Class","slug":"44th-period-survival-class","tipe":"Manhwa","released":"April 9, 2025","rating":"7","author":"Sang C","artist":"","status":"Ongoing","genre":["Drama","Horror","School Life","Seinen"],"synopsis":"Tiba-tiba, lubang-lubang mulai bermunculan di dunia, yang disebut lingkaran hitam. Lingkaran Hitam adalah sebuah misteri. Tidak ada yang tahu apa yang menyebabkannya atau apa yang ada di dalamnya, kecuali bahwa tidak ada yang pernah kembali dari jatuh ke dalamnya. Suatu hari, sebuah lingkaran hitam muncul di sekolah protagonis kita, Doyun. Lingkaran hitam tersebut semakin membesar hingga menelan sekolah, dan sebagian besar siswa, termasuk Doyun, jatuh ke dalamnya. Dapatkah mereka menemukan jalan keluar dan melarikan diri dari lingkaran hitam tersebut?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2025/04/44th-period-survival-class-337847-C7BvfS4w-207x300.jpg"},{"judul":"Be Born Again","slug":"be-born-again","tipe":"Manhwa","released":"April 6, 2021","rating":"7.8","author":"LEE Chang-Jun","artist":"","status":"Ongoing","genre":["Action","Drama","Seinen","Supernatural"],"synopsis":"Heters adalah manusia yang mempunyai kekuatan super. Setiap Heter memiliki kemampuan regeneratif yang super dan satu kekuatan tambahan. Miru adalah seorang pemburu Heters, pemburu ini dikenal sebagai Closer. Miru mempunyai masa lalu dengan para Heters dan tidak akan berhenti berburu Heters sampai mereka semua musnah.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/be-born-again-494143-YsbUyulA-203x300.jpg"},{"judul":"Build Up","slug":"build-up","tipe":"Manhwa","released":"Juli 8, 2021","rating":"7","author":"911","artist":"","status":"Ongoing","genre":["Action","Comedy","School Life","Shounen","Slice of Life","Sports"],"synopsis":"Maru Kang hanyalah seorang anak biasa dengan minat biasa, sampai suatu hari ayahnya memaksanya untuk menonton pertandingan sepak bola di TV, memicu obsesi dengan olahraga. Diisi dengan tekad, ia menetapkan tujuan baru untuk dirinya sendiri – untuk menjadi pemain sepak bola yang luar biasa! Satu-satunya masalah adalah, ia telah dinyatakan “Raja Pecundang” di sekolah menengahnya. Bisakah Maru mengatasi rintangan di jalannya dan berubah menjadi pemain sepak bola yang berbakat dan sukses?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/07/build-up-434821-omRFUiNe-214x300.jpg"},{"judul":"Burnout Shock","slug":"burnout-shock","tipe":"Manhwa","released":"Oktober 11, 2021","rating":"7","author":"Noh Do-hwan","artist":"","status":"Ongoing","genre":["Action","Adventure","Fantasy","Shounen"],"synopsis":"Karena masalah kontrol yang mudah terbakar yang tidak diketahui menyebar ke seluruh dunia, senjata, infrastruktur, dan peradaban yang dibangun manusia telah hancur. Young Rai, yang kehilangan ibunya karena ‘Sakan’ dari Topzone, mengambil pil percobaan dan kehilangan ingatan setelah mengamuk. 10 tahun kemudian, bekerja sebagai tentara yang melindungi warga sipil dari mafia, Rai, yang menderita efek samping percobaan, menemukan bahwa untuk menemukan obatnya, dia perlu menemukan ‘Wanita Api’. Kisah Rai untuk bertahan hidup dengan Wanita Api ‘Seungha’ pergi ke Topzone … tidak, untuk membalas dendam, perjalanannya bersamanya dimulai.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/10/burnout-shock-799115-53ZuVykp-222x300.jpg"},{"judul":"Castle 2: On Top of Everyone","slug":"castle-2-on-top-of-everyone","tipe":"Manhwa","released":"Maret 13, 2023","rating":"7.00","author":"Jeong Yeon","artist":"","status":"Ongoing","genre":["Action","Drama","Mature","Psychological","Seinen","Tragedy"],"synopsis":"Kim Shin, seorang pembunuh khusus yang mengumpulkan orang-orang dari seluruh negeri untuk mengatur “White Coat” untuk menggulingkan kekuatan absolut “Castle” di dunia belakang, Begitulah cara dia masuk ke dalam Castle dan mulai tidur dengan musuh. Akankah Kim Shin bisa menghancurkan Castle dan menyelesaikan balas dendamnya sesuai keinginannya?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2023/03/castle-2-on-top-of-everyone-550557-irPbBrru.webp"},{"judul":"Blast","slug":"blast","tipe":"Manhwa","released":"Maret 10, 2021","rating":"7.4","author":"LEE Ha Na","artist":"","status":"Completed","genre":["Action","Comedy","Fantasy","School Life","Shounen","Supernatural"],"synopsis":"Kael (alias Ryu Shiho) adalah ancaman dalam bentuk malaikatnya, melecehkan malaikat lain setiap kali dia mendapat kesempatan. Oleh karena itu, para bapa surgawi memutuskan untuk mengusirnya ke dunia manusia, berharap perilakunya akan membaik. Tapi … Mereka salah menebak. Sikapnya tidak menjadi lebih baik sama sekali, dan yang terpenting, manusia sekarang memanggilnya “Lucifer” karena perbuatan jahat dan matanya yang menakutkan. Jika dia ingin melihat pintu surga terbuka lagi, dia harus melakukan seratus perbuatan baik… Akankah tugas ini terbukti mustahil?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/03/blast-753463-EKZEiDXA-203x300.jpg"},{"judul":"Becoming a Legendary Ace Employee","slug":"becoming-a-legendary-ace-employee","tipe":"Manhwa","released":"November 11, 2024","rating":"7.00","author":"JRobin, BONGUN,","artist":"","status":"Ongoing","genre":["Adventure","Comedy","Drama","Sci-fi","Slice of Life"],"synopsis":"Kim Tae-seok, yang bekerja di lokasi konstruksi, menerima pemberitahuan lulus pemeriksaan dokumen untuk perusahaan besar El Sung. Pada saat yang sama, sebuah pesan muncul di depannya: ‘Anda telah memasuki jalur untuk menjadi seorang tutorial karyawan reguler. Apakah Anda ingin melanjutkan?’ Ikuti perjuangan Kim Tae-seok untuk menjadi karyawan serba bisa yang legendaris dalam petualangan korporat ini!","thumbnail":"https://kiryuu02.com/wp-content/uploads/2024/11/image-processing20231223-2-o55llr-946463-uqoinhqd-310046-V72cWa7u-210x300.jpeg"},{"judul":"Builder","slug":"builder","tipe":"Manhwa","released":"April 27, 2021","rating":"6.9","author":"Moon Haneul","artist":"","status":"Ongoing","genre":["Action","Adventure","Comedy","Ecchi","Sci-fi","Shounen","Supernatural"],"synopsis":"Dekat dengan masa depan kita, manusia telah membuat cara baru untuk bermimpi apa pun yang mereka inginkan. Mereka yang berusaha untuk menjadi dewa di dunia mimpi ini disebut “Builder”. Mengapa dia ingin menjadi Builder?","thumbnail":"https://kiryuu02.com/wp-content/uploads/2021/04/builder-951817-xHpYlSQj-225x300.jpg"},{"judul":"Academy’s Undercover Professor","slug":"academy-s-undercover-professor","tipe":"Manhwa","released":"Juni 6, 2022","rating":"7.8","author":"Sayren, Tana (II)","artist":"","status":"Ongoing","genre":["Action","Adventure","Comedy","Drama","Fantasy","Mystery","School Life","Shounen"],"synopsis":"Aku tidak dilahirkan kembali dengan bakat ataupun kemampuan, tetapi setidaknya pengetahuanku dari bumi memungkinkanku untuk tetap selangkah lebih maju di dunia lain ini.","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/06/academys-undercover-professor-405579-622Zx5xn-210x300.webp"}]