{"judul":"I Am The Older Sister Of The Possessed Female Lead","slug":"i-am-the-older-sister-of-the-possessed-female-lead","tipe":"Manhwa","released":"Juni 4, 2022","rating":"7.00","author":"Hanseol Myeong, Mongchere","artist":"","status":"Ongoing","genre":["Comedy","Romance"],"synopsis":"Adik perempuanku yang dulu melecehkanku telah berubah!\r\n “Saya? Mengikatmu? Saudariku?”\r\n Mengapa, mengapa Anda tiba-tiba berbicara secara formal? Dia bahkan tidak ingat apa yang dia lakukan!\r\n “Akan baik bagi kakak perempuanku untuk berpartisipasi dalam pesta debutan tahun ini juga.”\r\n Anda mengatakan kepada saya untuk tidak pergi bahkan tahun lalu …\r\n “Bagaimana dengan seorang pria berpenampilan keren dengan rambut hitam yang tampaknya tidak mendapatkan setetes darah bahkan jika dia ditikam? Bagaimana dengan seorang pria muda yang cantik dan lembut seperti anak anjing di tengah hujan? Ada orang yang sedikit kalah dengan dua orang di depan mereka, tapi ada satu orang yang sangat baik!”\r\n Dia bahkan membacakan informasi pribadi pria yang mengatakan dia harus tahu seleraku. Tidak, lebih tepatnya, apakah saya terlihat seperti akan bermain dengan seorang pria sekarang?\r\n “Maukah Anda menikah dengan saya? Annette dari Valois.”\r\n “Annette, Annette, kuharap kau jadi burung beo. Sehingga aku bisa melihat dan membesarkanmu di dalam sangkar.”\r\n Ayo bermain… Sepertinya kita akan bermain…\r\n “Ah, tapi kakak perempuan! Orang itu tidak bisa!!!”\r\n Semuanya baik-baik saja, tetapi saudari, tidak bisakah Anda setidaknya memberi tahu saya mengapa Anda tidak menginginkan siapa pun? Saya bertanya-tanya mengapa dia tiba-tiba menjadi baik, tetapi adik perempuan ini sepertinya baru saja keluar dari perahu! Ada seorang flower boy yang mendekati adik perempuanku! Yang Mulia Permaisuri, yang terjebak di tempat asing dan hanya menyukaiku! Saya tidak tahu. Lebih baik aku kembali seperti dulu…","thumbnail":"https://kiryuu02.com/wp-content/uploads/2022/06/i-am-the-older-sister-of-the-possessed-female-lead-022703-ROasc2w5-243x300.webp"}